{"title":"Computational Plasticity in Powder Forming Processes","uid":14637652,"size":32463495,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0012ea07c94c32c9bd6a4964a073dd7eca147b8f&amp;dn=Computational+Plasticity+in+Powder+Forming+Processes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1463476933,"description":"Computational Plasticity in Powder Forming Processes - Amir R. Khoei (Elsevier, 2005).pdf\r\n\r\nISBN 0080446361\r\n\r\nThe powder forming process is an extremely effective method of manufacturing structural metal components with high-dimensional accuracy on a mass production basis. The process is applicable to nearly all industry sectors. It offers competitive engineering solutions in terms of technical performance and manufacturing costs. For these reasons, powder metallurgy is developing faster than other metal forming technology.\r\n\r\nComputational Plasticity in Powder Forming Proceses takes a specific look at the application of computer-aided engineering in modern powder forming technologies, with particular attention given to the Finite Element Method (FEM). FEM analysis provides detailed information on conditions within the processed material, which is often more complete than can be obtained even from elaborate physical experiments, and the numerical simulation makes it possible to examine a range of designs, or operating conditions economically.\r\n\r\n* Describes the mechanical behavior of powder materials using classical and modern constitutive theories.\r\n* Devoted to the application of adaptive FEM strategy in the analysis of powder forming processes.\r\n* 2D and 3D numerical modeling of powder forming processes are presented, using advanced plasticity models","torrent":{"xt":"urn:btih:0012ea07c94c32c9bd6a4964a073dd7eca147b8f","amp;dn":"Computational+Plasticity+in+Powder+Forming+Processes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0012ea07c94c32c9bd6a4964a073dd7eca147b8f","infoHashBuffer":{"type":"Buffer","data":[0,18,234,7,201,76,50,201,189,106,73,100,160,115,221,126,202,20,123,143]},"announce":[],"urlList":[]}}