{"title":"Arne Dahl - Viskleken (Svensk Retail EPUB)","uid":13018415,"size":453193,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:001584aa0793eb66f790b57dd46e918af694ceb9&amp;dn=Arne+Dahl+-+Viskleken+%28Svensk+Retail+EPUB%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1450315242,"description":"Författare: Arne Dahl\r\n       Titel: Viskleken (Opcop #1)\r\nUtgivningsår: 2011\r\n       Språk: Svenska\r\n        ISBN: 9789175030456\r\n      Format: Retail EPUB\r\n\r\nÖppnare gränser har förändrat Europas brottslighet. Därför startas Opcop, en ny och än så länge hemlig operativ enhet inom Europol. Flera svenskar, med den rutinerade kriminalaren Paul Hjelm i spetsen, ingår i den nya gruppen. Med säte i Haag och med kontakter i Europas alla hörn ska man bekämpa internationell brottslighet. Men trots att all information rörande Opcop är konfidentiell, verkar någon ha läckt: ett lik, arrangerat i en bisarr ställning, påträffas utanför London, och i kroppen finns ett meddelande riktat till gruppen.\r\n\r\nEn möbelföretagare i Nacka gör affärer med den italienska maffian, en amerikansk tradingbank flyttar gigantiska pengasummor, anställda i en kinesisk möbelfabrik är sjuka, och under ett toppmöte i London sluddrar en döende man en märklig fras i Arto Söderstedts öra. På något sätt hänger allting ihop.\r\n\r\nViskleken är en helt fristående fortsättning på Arne Dahls uppmärksammade deckarsvit om A-gruppen, specialenheten för &quot;våldsbrott av internationell art&quot;. I den sista delen lades A-gruppen ned. Men Paul Hjelm, Kerstin Holm, Sara Svenhagen och flera andra av dess tidigare medlemmar är inte alls beredda att lägga ner. Nu tar de sig an Opcop, och ger sig ut i en värld där internet, sociala media och rörlighet över landsgränser gjort den råa brottsligheten internationell. Människans girighet, korruption och längtan efter makt är densamma. Den har bara hittat en ny, och större, arena","torrent":{"xt":"urn:btih:001584aa0793eb66f790b57dd46e918af694ceb9","amp;dn":"Arne+Dahl+-+Viskleken+%28Svensk+Retail+EPUB%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"001584aa0793eb66f790b57dd46e918af694ceb9","infoHashBuffer":{"type":"Buffer","data":[0,21,132,170,7,147,235,102,247,144,181,125,212,110,145,138,246,148,206,185]},"announce":[],"urlList":[]}}