{"title":"[NubileFilms] - Alexis Adams (Temptation) [NEW May 1, 2016]","uid":14502310,"size":259034880,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:01948254b0c2b19a50174ff94ee8352dbbeb3fde&amp;dn=%5BNubileFilms%5D+-+Alexis+Adams+%28Temptation%29+%5BNEW+May+1%2C+2016%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"LucasCar","files":1,"time":1462198498,"description":"[NubileFilms] - Alexis Adams (Temptation) [NEW May 1, 2016]\r\n\r\n Chad White is trying to get some work done, but busty seductress Alexis Adams has different ideas. Strutting into his office with a crotchless thong and sheer bra, the horny coed climbs onto Chad’s desk and lets him know that she won’t take no for an answer. Chad gets the hint quickly enough, and soon he has led Alexis over to the bed so that he can play with the gifts that she has on offer. Alexis’s lingerie has exactly the desired effect, revving he r man up and making him exceptionally eager to see to her pleasure from a tit-squeezing massage to a pussy-pleasuring finger fuck. Alexis is all about giving as good as she gets, so it’s no surprise when she lays Chad down on the bed and pulls his cock out. It isn’t long before she has wrapped her soft lips around his shaft and begun to suck. She takes her time, using her hands and warm mouth to ensure that her lover is enjoying every moment of his deep throat cock sucking and ball gargling. By the time Chad finally gets the opportunity to sink himself deep into Alexis’s twat, he’s rock hard and raring to go. Pulling her thong to the side, Alexis climbs up on top of Chad and sinks down slowly. Once she’s fully impaled, she gets to work pumping her hips up and down in an ever-increasing speed that soon has her big titties jiggling in Chad’s face. Never one to forego a pussy feast, Chad takes the opportunity that Alexis presents to put his mouth to work licking and sucking her juicy landing strip fuck hole. His window of opportunity is short but satisfying, and soon enough he bends his partner over so that he can take her doggy style. Alexis is totally into this new position, even doing much of the work for Chad as she chases the joy of climax. Flipping onto her back, Alexis spreads her legs while Chad continues to bump and grind at her soft snatch. Her gasps and moans fill the room, growing louder and more urgent the closer she gets to cumming. When Chad helps her onto her side and finishes her off with a spooning fuck, Alexis can’t contain her sheer bliss. Now that he has fully satisfied his woman, Chad gets his own turn at climax. He’s already on edge, so it isn’t long before he pulls out of Alexis’s tight twat and loses his load all over her fuzzy mound. The lovers remain entwined for a few moments as they come down from their mutual bliss.\r\n \nhttp://imgart.org/img-5727449f6b755.html\r\n\r\n\r\n\r\n* * * For more stuff please visit * * * \nhttps://thepiratebay.se/user/LucasCar/","torrent":{"xt":"urn:btih:01948254b0c2b19a50174ff94ee8352dbbeb3fde","amp;dn":"%5BNubileFilms%5D+-+Alexis+Adams+%28Temptation%29+%5BNEW+May+1%2C+2016%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01948254b0c2b19a50174ff94ee8352dbbeb3fde","infoHashBuffer":{"type":"Buffer","data":[1,148,130,84,176,194,177,154,80,23,79,249,78,232,53,45,187,235,63,222]},"announce":[],"urlList":[]}}