{"title":"[GirlsWay] - Dani Daniels, Shyla Jennings - (Sharing The Bed Par","uid":13025834,"size":448446225,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0284e0c933b923e6c9025e2990f8d42006f56c92&amp;dn=%5BGirlsWay%5D+-+Dani+Daniels%2C+Shyla+Jennings+-+%28Sharing+The+Bed+Par&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kuzili1","files":1,"time":1450400232,"description":"Dani Daniels &amp; Shyla Jennings – Sharing The Bed: Part Two\r\nReleased: December 17, 2015\r\n\r\nGirlsway’s Exciting Lesbian Coming Out Story, Sharing The Bed, Continues with this highly psychological second chapter: In our pilot episode, we met Shyla, an anxious young Christian lady. Shyla has grown up with all the values of any typical Christian All-American girl, but when she met her first ever live gay person Sasha, her gear began to turn. In all her anxiety, she finally comes to terms with her true feelings of curiosity and attraction for her new friend. But as we saw, Sasha was more eager than Shyla had expected, and before things heated up, Shyla had to face herself, and ask who her true authentic self is. As Shyla returns to her home, we see her following her normal routine: self-deprecation, and decision making, get coffee, stare out the window, think of… Sasha finally texts her and like any young lady who’s coming to terms with her seemingly naughty lesbian attraction, the butterflies in her tummy keep her fighting with herself to answer, excited about what could come of their relationship. She tries to act normal, and stick to what she knows. Soon her Christian identity pulls at her from her new found lesbian obsession. Sasha realizes that Shyla may be going through a serious change of identity, and recommends she see her therapist, Dani Daniels. Shyla isn’t sure, since Jesus has always been there to guide her, but in the end, Dani seems to be the only one to talk to about this rather complicated situation. Shyla arrives to meet Dani, who uses all her tricks to try and help Shyla to calm down. Clearly the inner turmoil of being a devout Christian has led her to a state of serious anxiety. Dani swoops in to save the day, helping Shyla to calm herself, and validate her feelings. Dani tests out a new technique, Sexual Surrogacy, something in which Shyla must come to terms with on its own, in order not to feel like she’s cheating. Dani lets down her hair to explain how it works, and Shyla agrees to the therapy. Shyla opens up her heart to explain her attraction to Sasha. Dani follows Shyla’s lead, delving into her both figuratively and physically. As the clothes fly and the butterflies grow in Shyla’s tummy, Dani gets to work in pleasing Shyla’s every sexual desire as if she were Sasha, playing out Shyla’s fantasies on every level. Dani’s soft tongue and lips explore Shyla’s tender body, and her soft nipples all to the gentle moans Shyla sings to accompany the tender seduction. What ensues is a lesbian love making session that will certainly alter Shyla from the person she once knew herself to be. Will Dani’s sexual surrogacy therapy continue to reach new heights of lesbian intensity?\r\n\r\nFile size                                : 428 MiB\r\nDuration                                 : 44mn 51s\r\nBit rate                                 : 1 200 Kbps\r\nWidth                                    : 720 pixels\r\nHeight                                   : 400 pixels\r\nDisplay aspect ratio                     : 16:9\r\n\r\nTo avoid fakes, ALWAYS check that the torrent was added by kuzili1\r\n\r\n   \nhttp://extratorrent.cc/\r\n   \nhttp://extratorrent.cc/torrent/4598538/\r\n\r\nScreens...\r\n \nhttp://imgfapper.com/img-56734b05de337.html","torrent":{"xt":"urn:btih:0284e0c933b923e6c9025e2990f8d42006f56c92","amp;dn":"%5BGirlsWay%5D+-+Dani+Daniels%2C+Shyla+Jennings+-+%28Sharing+The+Bed+Par","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0284e0c933b923e6c9025e2990f8d42006f56c92","infoHashBuffer":{"type":"Buffer","data":[2,132,224,201,51,185,35,230,201,2,94,41,144,248,212,32,6,245,108,146]},"announce":[],"urlList":[]}}