{"title":"Hourglass Series - Myra Mcentire","uid":13337090,"size":4096033,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:053913bc4bdde42e7d877c03e23b15e0065a9a09&amp;dn=Hourglass+Series+-+Myra+Mcentire&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":9,"time":1453995735,"description":"01. Hourglass [Hourglass, #1] - Myra McEntire\r\n\r\n\r\n\r\nOne hour to rewrite the past . . .\r\n\r\nFor seventeen-year-old Emerson Cole, life is about seeing what isn't there: swooning Southern Belles; soldiers long forgotten; a haunting jazz trio that vanishes in an instant. Plagued by phantoms since her parents' death, she just wants the apparitions to stop so she can be normal. She's tried everything, but the visions keep coming back.So when her well-meaning brother brings in a consultant from a secretive organization called the Hourglass, Emerson's willing to try one last cure. But meeting Michael Weaver may not only change her future, it may change her past.\r\n\r\nWho is this dark, mysterious, sympathetic guy, barely older than Emerson herself, who seems to believe every crazy word she says? Why does an electric charge seem to run through the room whenever he's around? And why is he so insistent that he needs her help to prevent a death that never should have happened?\r\n\r\nFull of atmosphere, mystery, and romance, Hourglass merges the very best of the paranormal and science-fiction genres in a seductive, remarkable young adult debut.\r\n\r\n02. Timepiece [Hourglass, #2] - Myra McEntire\r\n\r\n\r\n\r\nA threat from the past could destroy the future.\r\n\r\nKaleb Ballard was never supposed to be able to see ripples--cracks in time. Are his powers expanding, or is something very wrong? Before he can find out, Jonathan Landers, the man who tried to murder his father, reappears. Why is he back, and what, or whom, does he want?\r\n\r\nIn the wake of Landers's return, the Hourglass organization is given an ultimatum by a mysterious man. Either they find Landers and the research he has stolen on people who might carry the time gene, or time will be altered--with devastating results for the people Kaleb loves most. Now Kaleb, Emerson, Michael, and the other Hourglass recruits have no choice but to use their extraordinary powers to find Landers. But where do they even start? And when? Even if they succeed, just finding him may not be enough ...\r\n\r\nThe follow-up to Hourglass, Timepiece blends the paranormal, science fiction, mystery, and suspense genres into a nonstop thrill ride where every second counts.\r\n\r\n\r\n\r\n03. Infinityglass [Hourglass, #3] - Myra McEntire\r\n\r\n\r\n\r\nThe stakes have risen even higher in this third book in the Hourglass series. The Hourglass is a secret organization focused on the study of manipulating time, and its members -- many of them teenagers -­have uncanny abilities to make time work for them in mysterious ways. Inherent in these powers is a responsibility to take great care, because altering one small moment can have devastating consequences for the past, present, and future. But some time trav­elers are not exactly honorable, and sometimes unsavory deals must be struck to maintain order. With the Infinityglass (central to understanding and harnessing the time gene) at large, the hunt is on to find it before someone else does. But the Hourglass has an advantage. Lily, who has the ability to locate anything lost, has determined that the Infinityglass isn't an object. It's a person. And the Hourglass must find him or her first. But where do you start searching for the very key to time when every second could be the last?","torrent":{"xt":"urn:btih:053913bc4bdde42e7d877c03e23b15e0065a9a09","amp;dn":"Hourglass+Series+-+Myra+Mcentire","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"053913bc4bdde42e7d877c03e23b15e0065a9a09","infoHashBuffer":{"type":"Buffer","data":[5,57,19,188,75,221,228,46,125,135,124,3,226,59,21,224,6,90,154,9]},"announce":[],"urlList":[]}}