{"title":"Donald Trump Beware Of Asian Hustler","uid":13463078,"size":395750398,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0556b8c91263d40d59c6ceb153a0bd013540df60&amp;dn=Donald+Trump+Beware+Of+Asian+Hustler&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sarah.jensen","files":1,"time":1454900625,"description":"Pet was in the coffee shop boasting along with her low class friends, about how her boyfriend was old and rich, and she could fuck around on him so much and he was too stupid to realize that she was merely out for his cash. She had bought a brand new teddy bear, which she said would be more of a friend than him. Each of her friends in turn boasted at how old their boyfriends and husbands were, fifty, sixty, even eighty, and how much they had got out of them, new pickup trucks, new condos, houses, investments in non-existing projects. The list went on. Pet was great. She said that all she had to do was jiggle her pretty tits in front of him in the evening, and he would promise her anything. He had lost half of his wealth in a divorce of a thirty year marriage, and she was determined to get the rest in a matter of months. And still screw around. And still hook other gullible guys along the way. The best part was her ego, she really believed in rubbing their noses in it, depriving them of all their money, and then embarrassing them. And I was just listening, with my quadruple espresso mixed with a high energy drink in front of me. So it did not need a lot of encouragement from me for Pet to do this video. That was six months ago. She did it for free, so long as she had enough time to drain her boyfriend, and this video will serve as a good instrument for her to dump him, and move onto the next. So here you are, I hope this was not your girlfriend. Pet, a girl you really want to fuck, and I sincerely hope she does not end up fucking you. Actually, I do not care. This is your lookout. Why not look out at the high definition video","torrent":{"xt":"urn:btih:0556b8c91263d40d59c6ceb153a0bd013540df60","amp;dn":"Donald+Trump+Beware+Of+Asian+Hustler","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0556b8c91263d40d59c6ceb153a0bd013540df60","infoHashBuffer":{"type":"Buffer","data":[5,86,184,201,18,99,212,13,89,198,206,177,83,160,189,1,53,64,223,96]},"announce":[],"urlList":[]}}