{"title":"ExploitedCollegeGirls Bruna 720p","uid":13033744,"size":2281486270,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:06678e106bc7ae8382b269104549b52d0d567ec4&amp;dn=ExploitedCollegeGirls+Bruna+720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1450458698,"description":"ExploitedCollegeGirls Bruna 720p\r\n \nhttp://postimg.org/image/apk85ez8b/\r\n\r\nUpdated on Thursday, December 17, 2015\r\nFeaturing: Bruna\r\nAge: 21\r\nHeight: 5'7&quot;\r\nFigure:32B-24-36\r\nEyes: Black as the void.\r\nLikes: European men, Adventure, Shakira.\r\n\r\nLeggy, elegant Bruna is a whole lot of all right. From her exotic features to her tan lined tits to her real Brazilian waxed puss, this girl is something pretty unique for Ex Co Gi. It's hard to say what we like best about her, her outrageously sexy accent, the hips-don't-lie way she grinds her pussy when she's getting fucked or her young Ally Sheedy looks. No need to decide, this week you get them all included!\r\n\r\nYes, you'll be thinking as the Behind The Scenes interview starts, another super hot chick with with an attitude. But Bruna lets it slip pretty quickly though when she admits that the thought of Ex Co Gi's legions of fans handling their own manhood turns her on. You can tell Bruna thinks quite a lot of her self from her answers to Jay's questions, like when she brags that she only dates &quot;European Men.&quot; Fortunately for you and us, apparently she also makes exceptions for Americans with cameras. Jay calls her bullshit and has her hit the floor and start blowing him before the shoot even starts.\r\n\r\nAfter more small talk and some make up touch ups, Jay gets down to business with his fingers and a vibrator which Bruna seems to enjoy. So much so that in no time at all she lays back into a quiet orgasm. She gets back to her knees and blows Jay again, this time really laying on both the hand action and the eye contact. There is something intensely sexy about Bruna's deep, dark eyes and Jay gets as much of her on cam as he can.\r\n\r\nAfter drilling Bruna in every position he can think of including some hip grinding, deep penetrating rear action as Bruna is pressed face down into the bed, Jay unleashes a monster load on her pretty face. Thanks for visiting girl, and don't worry, nobody will see your update all the way down in Brazil, it's way too far away!","torrent":{"xt":"urn:btih:06678e106bc7ae8382b269104549b52d0d567ec4","amp;dn":"ExploitedCollegeGirls+Bruna+720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06678e106bc7ae8382b269104549b52d0d567ec4","infoHashBuffer":{"type":"Buffer","data":[6,103,142,16,107,199,174,131,130,178,105,16,69,73,181,45,13,86,126,196]},"announce":[],"urlList":[]}}