{"title":"WWE: Champions v0.31 Unlimited money mod","uid":13482059,"size":528354566,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:073a4ddf9e1442aa6bd6b747f259ad6283445ebf&amp;dn=WWE%3A+Champions+v0.31+Unlimited+money+mod&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":2,"time":1455061919,"description":"WWE Old School…WWE New School…Let’s Settle This! \r\n\r\nYour dream rivalries and battles are happening live, in WWE Champions. Create and customize your ultimate team of Superstars and battle them across the generations of the WWE’s greatest anytime in one game. The fast paced action is easy to learn while rewarding skill and quick thinking; so come join a community of fellow WWE fans battling for reputation, power, and bragging rights in WWE Champions.\r\n\r\nThe Iconic Superstars of the 80’s and 90’s through Today\r\nNow you can assemble the dream roster of champions from the history of the WWE. The Rock, Undertaker, Macho Man Randy Savage, John Cena, Triple H, Big Show, Andre The Giant and more Legends and current Superstars are ready to enter the ring.\r\n\r\nCustomize Your Dream Team\r\nUpgrade and tailor your superstar’s skills to improve their power and customize the epic moves you want. Combine a wide variety of superstars, skills, and upgrades to build your completely unique team.\r\n\r\nEnter the Ring With Friends \r\nTeam up or battle against your friends anytime. It’s easy to challenge your friends to a match anytime to earn bragging rights. Or, combine forces with friends to tag team with rivals around the world.\r\n\r\nIt’s Always Live\r\nJust like the WWE, Champions is evolving year-round. Recruit up and coming Superstars. Join the community in weekly bouts that re-create the coming Smackdown and Raw battles, and monthly title events.\r\n\r\nFast and Intense Battling\r\nWWE Champions unique puzzle-battle system tests your quick thinking and rewards skillful play as your Superstar gains power from your moves. Unlock and unleash epic moves, or fight your way out of a desperate situation in action battles that you can finish in less than five minutes anytime, anywhere.\r\n\r\nWhat’s new:\r\n-Crash Fixes\r\n-Performance Improvements\r\n-Game and damage rebalancing\r\n\r\nRequires Android OS: 4.0+","torrent":{"xt":"urn:btih:073a4ddf9e1442aa6bd6b747f259ad6283445ebf","amp;dn":"WWE%3A+Champions+v0.31+Unlimited+money+mod","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"073a4ddf9e1442aa6bd6b747f259ad6283445ebf","infoHashBuffer":{"type":"Buffer","data":[7,58,77,223,158,20,66,170,107,214,183,71,242,89,173,98,131,68,94,191]},"announce":[],"urlList":[]}}