{"title":"Les chemins de l'éveil (Meditation.Zen)","uid":14640462,"size":13628415,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a7b04d0dad8c4c43f2df169600e148322c5143a&amp;dn=Les+chemins+de+l%27%26eacute%3Bveil+%28Meditation.Zen%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"asperge","files":4,"time":1463511779,"description":"Dr Roger Walsh - Les chemins de l'éveil\r\nLe Jour | ISBN : 2890446751 | 2000-04 | PDF/DJVU | 346 pages | 8/4 MB\r\n\r\nCe livre s'appuie sur vingt années de recherches dans le domaine de la spiritualité et sur la pratique de diverses traditions religieuses. Son auteur est à la fois adepte de la spiritualité et scientifique émérite. Il explique comment mettre en pratique au quotidien les principales disciplines formant le coeur des grandes religions. Au fil des décennies consacrées à l'étude des spiritualités du monde, le Dr Roger Walsh a mis en lumière leur dessein commun ainsi que sept disciplines menant à parachever ce but : connaître le caractère sacré et divin de notre être intérieur et du monde qui nous entoure.\r\n\r\n&quot;Les chemins de l'éveil&quot; intègre en un mode de vie pleinement satisfaisant des principes appartenant au bouddhisme, au christianisme, à l'hindouisme, à l'islam, au judaïsme et au taoïsme ; un mode de vie où chaque geste accompli s'imprégnera d'amour, de joie, de sérénité, de la vision sacrée, de sagesse et de générosité. Cet ouvrage exceptionnel nous enseigne des exercices et des méditations et on y puisera un trésor de prières et de conseils pratiques.\r\n\r\nRoger Walsh est médecin et professeur de psychiatrie, de philosophie et d'anthropologie. Ses recherches et ses travaux sur la spiritualité lui ont valu une vingtaine de prix internationaux","torrent":{"xt":"urn:btih:0a7b04d0dad8c4c43f2df169600e148322c5143a","amp;dn":"Les+chemins+de+l%27%26eacute%3Bveil+%28Meditation.Zen%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a7b04d0dad8c4c43f2df169600e148322c5143a","infoHashBuffer":{"type":"Buffer","data":[10,123,4,208,218,216,196,196,63,45,241,105,96,14,20,131,34,197,20,58]},"announce":[],"urlList":[]}}