{"title":"Simple Planes v1.3.02.0","uid":13037764,"size":96469190,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0a941f80858aa730ae1a7f23f09aa94ee2fb28f6&amp;dn=Simple+Planes+v1.3.02.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"CrossyBossy","files":2,"time":1450496433,"description":"You have the tools you'll need to bring any airplane to life. Snap parts together to build your airplane's body. Place engines to add thrust. Design and attach wings and then strap yourself into the cockpit and see how it flies. \r\n\r\nFlight simulation at its finest. Every little change you make in the designer impacts how the airplane flies. Weight distribution, thrust, lift, and drag are all calculated continuously while flying. Parts can break off in spectacular fashion while flying due to over-stress or by hitting something. The fun won't stop there though. You can keep on flying even with a missing wing if you've got the skills. \r\n\r\nClimb into the cockpit of one of your custom aircraft and see how it does in the challenges. The challenges will keep you entertained for hours. Land on aircraft carriers, dodge surface-to-air missiles, race through courses, and so much more. \r\n\r\nTest your airplane with no restrictions. Fly beyond the boundaries of the island. Who knows what is out there? Who knows what you will find? \r\n\r\nModding is fully supported so you can build your own parts and environments. Download our Unity package which includes specially designed tools to aid in designing and building mods which you can then share with your friends and the community","torrent":{"xt":"urn:btih:0a941f80858aa730ae1a7f23f09aa94ee2fb28f6","amp;dn":"Simple+Planes+v1.3.02.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a941f80858aa730ae1a7f23f09aa94ee2fb28f6","infoHashBuffer":{"type":"Buffer","data":[10,148,31,128,133,138,167,48,174,26,127,35,240,154,169,78,226,251,40,246]},"announce":[],"urlList":[]}}