{"title":"Force Reborn: Frontier Breach v 1.1 mod","uid":13498158,"size":30418714,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:0cba508b2473cc21ef32d89a5adf22c9bb6fe8c7&amp;dn=Force+Reborn%3A+Frontier+Breach+v+1.1+mod&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tiropitaki","files":1,"time":1455173713,"description":"Far across the future in another universe. The human race &quot;Terrans&quot; lived among new colonies advancing into new technologies. Now the resources at grown weak Terrans are in research with new power resource however they are not alone. Another alien race &quot;Necros&quot; envy the Terrans for its resourcefulness and try to steal their technology. \r\n\r\nAn adventurer named Axis Brandspear of the Terrans in search for relics across the galaxies now has a new quest that others have never faced before. Now he faces countless of Necros that stands in his way.\r\n\r\nGAME FEATURES:\r\n- Powerful Warships to defeat the enemies.\r\n- Tune Up your ship with upgrades to become powerful.\r\n- Power Grinding Level Up system that unlocks new attacks.\r\n- Neat combo points that releases nice Rewards.\r\n- lots of various enemies and epic boss fights.\r\n- Challenge your friends in Leaderboards.\r\n- Lots of achievements to gain.\r\n- Game movie scenes that tells a story.\r\n\r\nGAMEPLAY:\r\n-Force reborn is an RPG (role playing game) based system in a top view shooter game. It allows the player to level up that gives increase in the player stats for life, damage and critical strike rating. It also has a neat combo points when you hit enemy fast and gain rewards by making large points. It also has a story that spice up the gaming experience. Lots of enemy, chapters and challenges that is worth playing.\r\n\r\nHOW TO PLAY:\r\n-The game is as simple as dragging your warship using your fingers to move around the scene. It can be dragged in a close distance and still see the warship. The warship will automatically attack to destroy your enemies.\r\n\r\nTHE WARSHIPS:\r\n-Each warship has different strength in Life, Damage, Attack speed and Critical strike ratings. New warship can be unlocked by collecting Coins that can be collected by destroying enemies and bosses. Coins can also be purchased.\r\n\r\nTUNE UP YOU WARSHIP:\r\n-In addition to powerful warships. You can tune up your ship to become powerful. Life, Damage, and Critical strike ratings can increase the warships. The upgrade will apply to any warship you select. \r\n\r\nLEVEL SYSTEM:\r\n-The Player can Level up by destroying enemies. The Pilot can gain extra Life, Damage and Critical strike ratings. In addition to stats you also unlock new power up skills.\r\n\r\nPOWER UPS:\r\n-Power ups gains additional attack to the warship. If your level goes higher newer power ups are being activated. All power ups has their own unique advantage.\r\n\r\nENEMIES:\r\n-The enemies comes different in every stage. They carry different strength and attacks. They also come in teams and formations that are quite a challenge. \r\n\r\nCHALLENGING BOSS:\r\n-Each Boss has their own attack and strength. Each new warship you choose will win over the next Boss. \r\n\r\nCOMIC SCENES:\r\n-The game also carries a story that comic and sci-fi fanatics are going to look forward to. They have special animations like watching a short movie series. The art is fantasy type artwork done by John A.C.E.\r\n\r\nWhat’s new:\r\n- Fixed issue on orientation on other scenes to portrait mode.\r\n- Graphical fixes.\r\n\r\nWhat’s in the mod:\r\nUnlimited money\r\n\r\nRequires Android OS: 2.3.3+","torrent":{"xt":"urn:btih:0cba508b2473cc21ef32d89a5adf22c9bb6fe8c7","amp;dn":"Force+Reborn%3A+Frontier+Breach+v+1.1+mod","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cba508b2473cc21ef32d89a5adf22c9bb6fe8c7","infoHashBuffer":{"type":"Buffer","data":[12,186,80,139,36,115,204,33,239,50,216,154,90,223,34,201,187,111,232,199]},"announce":[],"urlList":[]}}