{"title":"Advances in Polymer Science [Updated at 2016.01.21]","uid":13274832,"size":1687818798,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e10a9f2e74720a80e7d38be0fe3ac20f32663b2&amp;dn=Advances+in+Polymer+Science+%5BUpdated+at+2016.01.21%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":259,"time":1453428823,"description":"Published by Springer\r\nISSN 0065-3195\r\nISSN 1436-5030 (electronic)\r\n\r\nSeries Editors: Abe, A., Albertsson, A.-C., Coates, G.W., Genzer, J., Kobayashi, S., Lee, K.-S., Leibler, L., Long, T.E., Möller, M., Okay, O., Percec, V., Tang, B.Z., Terentjev, E.M., Theato, P., Vicent, M.J., Voit, B., Wiesner, U., Zhang, X.\r\n\r\nOriginally published with the title: Fortschritte in der Hochpolymeren-Forschung, ISSN 0341-020x\r\n\r\nThe series Advances in Polymer Science presents critical reviews of the present and future trends in polymer and biopolymer science. It covers all areas of research in polymer and biopolymer science including chemistry, physical chemistry, physics, and material science.\r\n\r\nThe thematic volumes are addressed to scientists, whether at universities or in industry, who wish to keep abreast of the important advances in the covered topics.\r\n\r\nAdvances in Polymer Science enjoys a longstanding tradition and good reputation in its community. Each volume is dedicated to a current topic, and each review critically surveys one aspect of that topic, to place it within the context of the volume. The volumes typically summarize the significant developments of the last 5 to 10 years and discuss them critically, presenting selected examples, explaining and illustrating the important principles, and bringing together many important references of primary literature. On that basis, future research directions in the area can be discussed. Advances in Polymer Science volumes thus are important references for every polymer scientist, as well as for other scientists interested in polymer science - as an introduction to a neighboring field, or as a compilation of detailed information for the specialist","torrent":{"xt":"urn:btih:0e10a9f2e74720a80e7d38be0fe3ac20f32663b2","amp;dn":"Advances+in+Polymer+Science+%5BUpdated+at+2016.01.21%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e10a9f2e74720a80e7d38be0fe3ac20f32663b2","infoHashBuffer":{"type":"Buffer","data":[14,16,169,242,231,71,32,168,14,125,56,190,15,227,172,32,243,38,99,178]},"announce":[],"urlList":[]}}