{"title":"[Clips4sale] Mr Creep - Dr. Creep HD 720p","uid":13489616,"size":1106201987,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:0e2befc174562a71cec921861edd1e77b412e74e&amp;dn=%5BClips4sale%5D+Mr+Creep+-+Dr.+Creep+HD+720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"enterdrone","files":1,"time":1455110947,"description":"screen\r\n \nhttp://desihawas.com/img-56bb2ce52ab24.html\r\n\r\n1.03 GB - 26:33 -.mp4 - 1280x720\r\n\r\n\r\nThe other night I was feeling lonely so I decided I should have some company over to try and cheer myself up. I called a high dollar escort agency and ordered a pretty 19 year old whom they promised was very new in the business. My budget is much to small to allow for her $1000 price tag, but luckily I have a few tricks up my sleeve... In my younger days I spent some time in South America. In my travels I befriended a mad plastic surgeon, who I will call Dr. Creep. Needless to say Dr. Creep did some very interesting work. I became his personal assistant and right hand man for several months. We became very close and over time he revealed a few of his secrets to me. One night, very suddenly, Dr. Creep had to flee to a location he couldn't reveal to me. Before he left he gave me his stethoscope. The Good Doctor told me he had made it himself and that it contained parts of an ancient Aztec sacrificial blade. Dr. Creep said its power to mesmerize was unrivaled... My Hooker fell under the stethoscope's spell almost instantly. I gave her a full examination, inspecting her breasts, mouth, asshole, feet, bellybutton, eyes, and of course her pussy. I determined that she needed a rigorous fucking. I administered her treatment with extreme precision. After painting her face with my cum I brought her out of the trance instructing her that she would have no memory of what happened, only know that she must collect her clothes and go. Dr. Creep, wherever you are, this one's for you.... ***Starring Marina Angel***","torrent":{"xt":"urn:btih:0e2befc174562a71cec921861edd1e77b412e74e","amp;dn":"%5BClips4sale%5D+Mr+Creep+-+Dr.+Creep+HD+720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e2befc174562a71cec921861edd1e77b412e74e","infoHashBuffer":{"type":"Buffer","data":[14,43,239,193,116,86,42,113,206,201,33,134,30,221,30,119,180,18,231,78]},"announce":[],"urlList":[]}}