{"title":"Bleach [Manga Ita Cbr] vol. 71 [TNT Village]","uid":14591577,"size":69144918,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0fc22db9713d6ceb8fcf69814c0133c75bb3ad2b&amp;dn=Bleach+%5BManga+Ita+Cbr%5D+vol.+71+%5BTNT+Village%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"turchez90","files":1,"time":1462986561,"description":".:Locanda:.\r\n\r\n[img]http://imageshack.us/a/img31/3197/3yqm.jpg[/img]\r\n\r\n.:Trama:.\r\n\r\nIchigo Kurosaki è un giovane dotato dell'abilità di vedere gli spiriti. La sua vita subisce un drastico cambiamento quando una Shinigami (letteralmente Dio della Morte, o anche Mietitore di Anime) di nome Rukia Kuchiki, incrocia il suo cammino in cerca di un Hollow, una pericolosa anima smarrita. Durante lo scontro con lo spirito, Rukia rimane gravemente ferita ed è costretta a trasferire parte dei suoi poteri ad Ichigo, che accetta la proposta della Shinigami nel tentativo di proteggere i suoi familiari. Tuttavia, durante il processo di trasferimento, qualcosa va storto ed Ichigo assorbe tutti i poteri di Rukia, diventando uno Shinigami a pieno titolo. Avendo perso i suoi poteri, Rukia rimane bloccata nel mondo dei vivi finché non recupererà le forze. Nel frattempo, Ichigo sostituisce Rukia nei suoi doveri di Shinigami, combattendo gli Hollow e guidando le anime verso il regno dell'aldilà, noto come Soul Society (Società delle Anime).\r\n\r\nCol passare del tempo, i superiori di Rukia vengono a sapere del trasferimento dei poteri, considerato illegale nella Soul Society, e condannano la Shinigami a morte. Nonostante non riesca ad impedire che Rukia venga riportata nella Soul Society, Ichigo si appresta a salvare la ragazza, grazie all'aiuto dei suoi compagni di classe Orihime Inoue, Uryū Ishida e Yasutora Sado e degli ex-Shinigami Yoruichi Shihōin e Kisuke Urahara. Giunti nella Soul Society, Ichigo e compagni si battono con l'élite degli Shinigami, potenziandosi nel processo, per raggiungere Rukia prima della sua esecuzione.\r\n\r\nSia l'esecuzione di Rukia, che il tentativo di salvataggio di Ichigo e compagni, facevano parte del piano di Sōsuke Aizen, un Capitano Shinigami, precedentemente creduto morto, che voleva entrare in possesso dell'Hougyoku, oggetto dai grandi poteri. Assieme ad altri due Capitani, Gin Ichimaru e Kaname Tōsen, Aizen tradisce i suoi compagni Shinigami e si allea con i più potenti tra gli Hollow, potenziandoli ulteriormente, proprio grazie all'Hougyoku, e tramutandoli in Arrancar.\r\n\r\nI Capitani traditori prendono residenza nell'Hueco Mundo, la patria degli Hollow, e, grazie all'aiuto dei dieci più potenti esponenti degli Arrancar, gli Espada, rapiscono Orihime allo scopo di attirare Ichigo, i suoi alleati e alcuni degli Shinigami più potenti, lontano dalla città di Karakura, luogo dove Aizen potrà creare la Chiave del Re. Una volta in possesso della chiave, Aizen avrà accesso alla residenza del Re della Soul Society e potrà ucciderlo. A Karakura, tuttavia, i Capitani traditori, i tre Espada più potenti ed i loro sottoposti, scoprono che la città è stata sostituita con una copia e che un grande contingente di Shinigami è sul posto per sbarragli la strada.\r\n\r\nGli ultimi rimasti in piedi dopo lo scontro tra Shinigami ed Espada sono Aizen ed Ichigo, che nel frattempo è riuscito a tornare dall'Hueco Mundo. I due, giunti presso la vera città di Karakura, iniziano a battersi fino a quando Aizen viene sigillato grazie ad Urahara e trasportato nel Seireitei dove viene condannato a 20.000 anni di reclusione mentre Ichigo, dopo essere rimasto svenuto per un mese, ritorna alla sua vita avendo perso i poteri da Shinigami.\r\n\r\nDiciassette mesi dopo lo scontro con Aizen, un'organizzazione formata da Fullbringer, nota come Xcution, contatta Ichigo con l'intenzione di aiutarlo a riguadagnare i suoi poteri.\r\n\r\n.:Dettagli:.\r\n\r\nAutore: Tite Kubo \r\nTitolo: Bleach \r\nTipologia: Manga \r\nPagine: 170~220 pagine ciascun volume \r\nAnno: 2001-in corso \r\nNazionalità: Giappone \r\nGenere: Shonen \r\nLingua: Italiano\r\nDimensione del file: 65,9 mb \r\nFormato del file: CBR (JPG)\r\n\r\n.:Screenshots:.\r\n\r\n[img]http://i.imgur.com/vN7zK4R.png[/img]\r\n\r\n[img]http://i.imgur.com/3FhQPFb.png[/img]","torrent":{"xt":"urn:btih:0fc22db9713d6ceb8fcf69814c0133c75bb3ad2b","amp;dn":"Bleach+%5BManga+Ita+Cbr%5D+vol.+71+%5BTNT+Village%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fc22db9713d6ceb8fcf69814c0133c75bb3ad2b","infoHashBuffer":{"type":"Buffer","data":[15,194,45,185,113,61,108,235,143,207,105,129,76,1,51,199,91,179,173,43]},"announce":[],"urlList":[]}}