{"title":"Abdelhai Bennani Trio - There Starts the Future (2009)","uid":13030288,"size":356937820,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:13a092a6c54789db681962f5cd37fc961b6d0d6b&amp;dn=Abdelhai+Bennani+Trio+-+There+Starts+the+Future+%282009%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mariorg","files":6,"time":1450442616,"description":"Abdelhaï Bennani Trio\r\nThere Starts the Future\r\n2009 - Ayler Records: aylCD-083 \nhttp://www.ayler.com/abdelhai-bennani-trio-there-starts-the-future.html\r\n\r\n* Abdelhaï Bennani: tenor saxophone\r\n* Benjamin Duboc: bass\r\n* Edward Perraud: drums\r\n \nhttp://www.allmusic.com/artist/abdelhai-bennani-mn0001482658 \nhttp://benjamin.duboc.free.fr/ \nhttp://www.edwardperraud.com/\r\n\r\nRecorded at Les Instants Chavirés, Montreuil, France, on June 6, 2007.\r\nRecorded by Etienne Foyer.\r\n\r\n\r\nReviews\r\n~~~~~~~\r\n\r\nBy Stef \nhttp://www.freejazzblog.org/2008/12/sax-trios-on-ayler-records.html\r\n\r\nI had once heard Abdelhaï Bennani's &quot;Ensounded&quot; record, and qualified it maybe\r\ntoo fast as good but not more than that, but after listening to this\r\nperformance, I may have to go back and revise my opinion. The trio conists of\r\nthe leader on tenor, Benjamin Duboc on bass and Edward Perraud on drums. From\r\nthe very beginning Bennani sets the scene by playing very intense, almost\r\nagonizing tones, in short bursts and wails, creating openness and tension at\r\nthe same time. Duboc reacts well, both pizzi and arco, and Perraud joins with a\r\nvery implicit rhythm, keeping the tempo yet playing assymmetrically, now on the\r\ntoms, then on the cymbals, some rolls and a rimshot. The music hesitates, tries\r\nto move forward, perplexed and in full suprise, yet it moves on, and as a\r\nlistener you would expect a moment of release, a moment when the thing explodes\r\ninto unrestrained hitting, plucking and blowing. You can wait for nearly 30\r\nminutes on that first track, but that release does not come, you stay in this\r\nlittle sound universe the trio has created for you : intense, open, hesitating,\r\nagonizing. That doesn't mean that nothing happens, quite on the contrary, the\r\nstory they tell is an interesting and captivating one, there are variations, in\r\nBennani's tone, in some sudden walking bass and tempo increase, but it just\r\nwill not give that moment of release, before you know it, they're back in their\r\nsmall universe, as a trio, for a bass solo, for some powerfully subtle drum\r\nbeats. The second track starts more uptempo, yet don't expect themes or\r\npatterns, Bennani keeps uttering his highly sensitive squeals, and then it\r\nevolves into slowness, with little sounds produced by the three instruments,\r\napparently only there as boundaries for silence and open space, yet the slower\r\nthey play, the less sounds you hear, the higher the intensity. You get the\r\nfeeling that some huge thing is trying to get out, emotionally overpowering and\r\npotentially explosive, yet it doesn't, it's duly chained within this trio's\r\nsound universe, making the story even more compelling. And that's the amazing\r\nparadox of this trio : how free improvisation can create such a powerful\r\nfeeling of confinement and restraint (whether deliberate or not). A great\r\nlistening experience for those with open ears.\r\n\r\n--\r\n\r\nBy Hugo Strandberg (sv) \nhttp://www.orkesterjournalen.com/recensioner/pa-skiva-alfabetisk-lista/631-abdellhai-bennani-trio-there-starts-the-future\r\n\r\nPar Serge Baudot (fr) \nhttp://www.jazzhot.net/PBEvents.asp?ActionID=67240448&amp;PBMItemID=16274\r\n\r\nPar Julien Gros-Burdet (fr) \nhttp://www.citizenjazz.com/Abdelhai-Bennani-Trio.html","torrent":{"xt":"urn:btih:13a092a6c54789db681962f5cd37fc961b6d0d6b","amp;dn":"Abdelhai+Bennani+Trio+-+There+Starts+the+Future+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13a092a6c54789db681962f5cd37fc961b6d0d6b","infoHashBuffer":{"type":"Buffer","data":[19,160,146,166,197,71,137,219,104,25,98,245,205,55,252,150,27,109,13,107]},"announce":[],"urlList":[]}}