{"title":"Disciplining the Maid - Zoe Blake","uid":13477849,"size":384657,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:15e880a46893ca01792c395751efea0d65ff1851&amp;dn=Disciplining+the+Maid+-+Zoe+Blake&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1455027639,"description":"From best-selling age play author Zoe Blake comes a new glimpse into a Victorian world of complete sexual dominance and submission.\r\n\r\nFor wealthy and worldly Lord Stockton, there has been no shortage of mistresses available to grace his bed and offer him the one thing he demands - sexual submission.\r\n\r\nBut this handsome member of the Victorian ton wants something deeper. He wants the kind of total submission that only a complete innocent can offer, and the experienced mistresses fall short of giving him what he most desires - complete mastery over every facet of their lives in and out of the bedchamber.\r\n\r\nLily has never had a real home. Raised in an orphanage, she enters service at an early age and has managed to avoid lecherous employees and footmen to come into Lord Stockton's service as an unspoiled beauty ripe for the taking.\r\n\r\nLord Stockton knows Lily is the one to give him what he wants. And his offer to give her the paternal love and guidance she missed growing up in exchange for her submission is an appealing offer. But is a young maid strong enough to enter into the deeply submissive state a man like Lord Stockton demands?\r\n\r\nTo truly become his, Lily must submit every part of her body for his use, dress in immature clothing, and turn her back on adulthood forever. Even more trying, she must accept sexual pain, pleasure and punishment in doses she never thought possible to endure. Yet as Lord Stockton trains his young maid, he finds himself enduring his own vulnerability as he loses his heart to the woman he’s vowed to control.\r\n\r\nZoe Blake's detailed descriptions of sexuality and discipline make &quot;Disciplining the Maid&quot; more than just an erotic read. Readers will feel as if they are in Lily's place as the sexual tension and raw emotion of her transformation comes to the most fulfilling climax you'll find in any age play novel this year","torrent":{"xt":"urn:btih:15e880a46893ca01792c395751efea0d65ff1851","amp;dn":"Disciplining+the+Maid+-+Zoe+Blake","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15e880a46893ca01792c395751efea0d65ff1851","infoHashBuffer":{"type":"Buffer","data":[21,232,128,164,104,147,202,1,121,44,57,87,81,239,234,13,101,255,24,81]},"announce":[],"urlList":[]}}