{"title":"In the Studio With Redbeard Volume 2 (2013-2016) Rock Interviews","uid":14466691,"size":7827785222,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:16772eb4a4c9561c115a5b925e921a7ae602e38d&amp;dn=In+the+Studio+With+Redbeard+Volume+2+%282013-2016%29+Rock+Interviews&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NotHuman","files":313,"time":1461866940,"description":"In the Studio with Redbeard - Radio Interviews and Live Performances with Rock Legends \r\n\r\nVolume 2: 2013-2016 (308 MP3s)\r\n\r\nRedbeard has been a rock radio personality since the 1970s. For over four decades, he has mediated in-depth interviews with legends of rock on his nationally syndicated show &quot;In the Studio with Redbeard.&quot; Each interview focuses on a specific album or subject, and most run about 20 minutes in length (some have multiple parts). \r\n\r\nThis ongoing series of torrents is a complete audio rip of the website In the Studio with Redbeard (http://www.inthestudio.net/). It currently contains all the MP3s streaming on the website, and the plan is to have more torrents in the future as content is added to the site.  The first two torrents are Volume 1 (2010-2013) and Volume 2 (2013-2016).  The years listed tell when the interviews were posted to the website, but the interviews themselves span several decades. \r\n\r\nEach torrent is broken up into three sections: In the Studio radio interviews, online exclusive interviews (these were not broadcast on the radio show and only available on the website), and live tracks (these include in-studio and live performances from a variety of artists).  Some shows between torrents that appear to be duplicates are not; the newer versions are updated with extra content with new interviews and insights (for anniversary milestones or band members passing away, for example).\r\n\r\nIf you are a fan of rock music and like hearing interviews from the musicians about the creation of the albums and behind-the-scenes stories, these torrents are for you.  There's hours and hours of interesting conversation here to keep you captivated for days on end. I haven't seen this offered anywhere else, and I wrote a custom program just to be able to download the files. So it's something you can't get anywhere else. \r\n\r\nAll tracks are encoded at 128kbps and downloaded unaltered from the site, aided by a custom Java script using the excellent library jsoup. All files are fully tagged with consistent filenames and artwork. See info.txt for complete list of all the files included in the first two torrents, broken up by section","torrent":{"xt":"urn:btih:16772eb4a4c9561c115a5b925e921a7ae602e38d","amp;dn":"In+the+Studio+With+Redbeard+Volume+2+%282013-2016%29+Rock+Interviews","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16772eb4a4c9561c115a5b925e921a7ae602e38d","infoHashBuffer":{"type":"Buffer","data":[22,119,46,180,164,201,86,28,17,90,91,146,94,146,26,122,230,2,227,141]},"announce":[],"urlList":[]}}