{"title":"Arne Dahl - Sista paret ut (Svensk Retail EPUB)","uid":13018450,"size":1345313,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e0f204defb4be86861f42114ed207cf64b0e778&amp;dn=Arne+Dahl+-+Sista+paret+ut+%28Svensk+Retail+EPUB%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1450315855,"description":"Författare: Arne Dahl\r\n       Titel: Sista paret ut (Opcop #4)\r\nUtgivningsår: 2014\r\n       Språk: Svenska\r\n        ISBN: 9789175034126\r\n      Format: Retail EPUB\r\n\r\nStämningen i Europa hårdnar. Maffian är starkare än någonsin, narkotikamarknaden mer avancerad och metoderna våldsammare – något som Paul Hjelm och hans kollegor brutalt har fått erfara. Men nu utmanas maffian på allvar, från oväntat håll. Någon är mäktigare, starkare. Någon som i lagens ständigt växande gråzoner kan nästla sig in på Wall Street och samtidigt ta över den växande marknaden för designerdroger. Samtidigt utsätts det lilla svenska bioteknikföretaget Bionovia AB för avancerat cyperspionage. Spåren leder hela vägen till Kina och till en omfattande nätavlyssning – men hur kommer det sig att de utsatta företagen alla arbetar med genetisk forskning? I en hårdnande värld, där maktens spelregler ständigt snävas in, finns det kanske bara en sak kvar att manipulera: människans eget dna.\r\n\r\nOpcop-gruppen har samarbetat ett tag nu. Några medlemmar har ryckts ifrån dem, andra är ärrade för livet. I Stockholm håller Kerstin Holm och Sara Svenhagen fortfarande ställningarna: i Haag märks Paul Hjelm och Jorge Chavez. Övriga medlemmar rör sig runt världen: Kina, New York, Belgien. Och nog har de uträttat mycket, liv har räddats och ligor sprängts. Samtidigt är det några människor, organisationer, som ständigt gäckat Opcop och hela tiden legat steget före. Kommer de att visa sig igen?\r\n\r\nOpcop-gruppen samlar sina styrkor. Det blir en kraftmätning för den stukade gruppen, och kampen mot brottslighet blir personlig – inte minst för Paul Hjelm själv.\r\n\r\nSista paret ut är den sista, och fristående, delen i Arne Dahls Opcop-svit. Nu gäller det","torrent":{"xt":"urn:btih:1e0f204defb4be86861f42114ed207cf64b0e778","amp;dn":"Arne+Dahl+-+Sista+paret+ut+%28Svensk+Retail+EPUB%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e0f204defb4be86861f42114ed207cf64b0e778","infoHashBuffer":{"type":"Buffer","data":[30,15,32,77,239,180,190,134,134,31,66,17,78,210,7,207,100,176,231,120]},"announce":[],"urlList":[]}}