{"title":"Xev Bellringer - My Big Black Cock Boyfriend [1080p]","uid":13490707,"size":1243381656,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:1ed4fde441c202707fe382bbf16bc61cecfac2fa&amp;dn=Xev+Bellringer+-+My+Big+Black+Cock+Boyfriend+%5B1080p%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxsunset","files":1,"time":1455122930,"description":"Screenshots: \nhttp://imgur.su/image/bBua\r\n\r\nUgh, what a stressful day at work! The worst part was that I couldn't even get a hug from you when I needed it, baby. I'm tired of keeping our relationship a secret from all of our coworkers, it's time we just come out as a couple so I can be affectionate with you at work. I can't stand all of those women flirting with you too... Really baby?? I love you so much, thank you! I couldn't stop thinking about doing things to you all day, I'm sooo worked up. Well, now that we're alone you can have me...Come on baby, talk dirty to me and I'll peel off my clothes. Mmm I fantasized about being under your desk sucking you off...look how wet it made me. You want a taste? Ooooh baby, just put your tongue right...OHH yes, you're so good at this! Mmm let me return the favor, my love. God, I always forget how huge your black cock is...it's so hard to fit the whole thing in my mouth. You have to go slow, but I want to try to stuff it down my throat. MMMph!! You're mine, baby. None of those girls at the office can have you. This beautiful, perfect cock is all mine. Lay down, I need to feel your thick meat stretch my pussy out, baby","torrent":{"xt":"urn:btih:1ed4fde441c202707fe382bbf16bc61cecfac2fa","amp;dn":"Xev+Bellringer+-+My+Big+Black+Cock+Boyfriend+%5B1080p%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ed4fde441c202707fe382bbf16bc61cecfac2fa","infoHashBuffer":{"type":"Buffer","data":[30,212,253,228,65,194,2,112,127,227,130,187,241,107,198,28,236,250,194,250]},"announce":[],"urlList":[]}}