{"title":"Stargate Atlantis - Season 03 - Episodes 1 thru 10","uid":14600422,"size":8171847782,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:205e3036a82fa07326cee05c75e5a9e4f0b69118&amp;dn=Stargate+Atlantis+-+Season+03+-+Episodes+1+thru+10&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":38,"time":1463023980,"description":"Stargate Atlantis - Season 03 - Episodes 1 thru 10\r\n\r\n\r\nSeason three premiered in the United States on July 14, 2006, picking up where season 2 ended. Having stopped the Wraith from reaching Earth and having failed to develop a working Wraith retrovirus, the expedition faces its third year in the Pegasus galaxy with the Wraith still a threat and a new, powerful enemy bent on destroying the expedition and Atlantis: the Asurans, self-replicating nanobots, also known as Replicators. The situation becomes complicated when an experiment gone awry drains their only ZPM, leaving them without a power source for the city's shields. Soon thereafter, they find a lost Ancient vessel and subsequently lose the city of Atlantis when the crew of the Ancient ship reclaims it. \r\n\r\nThe SGC sends General O'Neill and Richard Woolsey to try to negotiate an agreement between Earth and the Ancients to allow the expedition to return to Atlantis. O'Neill and Woolsey dial Earth and inform them that the Asurans are taking over the city. They kill the Ancient crew who reclaimed the city after 10,000 years. The main members of the Atlantis expedition on Earth disobey their orders and go back to the city, rescue O'Neill and Woolsey, and repel the Asuran invasion. The season finale starts off with Earth launching a first strike against the Asurans, who are building an armada to attack Earth. \r\n\r\nThe Asurans counterattack by attacking Atlantis with a powerful beam weapon fired through a satellite housing a Stargate. As a last resort, the Atlantis team fires up the city's stardrive and escapes into space. The finale ends when the hyperdrive malfunctions, leaving the city flying through uncharted space with a day's worth of energy left in their sole ZPM and Dr. Weir critically injured","torrent":{"xt":"urn:btih:205e3036a82fa07326cee05c75e5a9e4f0b69118","amp;dn":"Stargate+Atlantis+-+Season+03+-+Episodes+1+thru+10","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"205e3036a82fa07326cee05c75e5a9e4f0b69118","infoHashBuffer":{"type":"Buffer","data":[32,94,48,54,168,47,160,115,38,206,224,92,117,229,169,228,240,182,145,24]},"announce":[],"urlList":[]}}