{"title":"Anders Jallai - Vetenskapsmannen - Svensk","uid":13309624,"size":186562735,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:21bebb05bc0dfce06d9a2409e2a023a1dfc570d5&amp;dn=Anders+Jallai+-+Vetenskapsmannen+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"icecreamman2","files":87,"time":1453765735,"description":"Anders Jallai - Vetenskapsmannen - svensk\r\n\r\nEn ny socialdemokratisk regering med statsminister Sten Lovén i spetsen har tagit över landet. Anton Modins son sitter på den slutna anstalten i Norrtälje efter händelserna vid Bilderbergmötet i Grisslehamn för nästan tre år sedan. Krafter inom CIA och Mossad vill ha honom utlämnad. De anser att han är en livsfarlig terrorist och att han utgör ett potentiellt hot mot västvärlden. Dessutom är han operatör för den ryska underrättelsetjänsten GRU och numera rysk medborgare. Blir han utlämnad kommer han att förhöras under tortyr, kanske på Guantánamobasen. Det vet Modin, och han frågar sig om den nya regeringen kan stå emot påtryckningarna från världens två mäktigaste underrättelsetjänster. Något måste göras, innan det är försent … En Säpoutredare, Camilla Novak, söker upp Modin. Hon gräver i det hemligstämplade fallet med professor Sven Olin, vetenskapsmannen som försvann spårlöst sommaren 1986 i Grisslehamn. Hon misstänker att Modin vet något om fallet eftersom han vid den tiden jobbade för underrättelsetjänsten och dessutom var sommarboende i Grisslehamn. Vetenskapsmannen är den sjätte fristående delen i Anders Jallais serie med politiska thrillers om den före detta SSI-agenten Anton Modin. Berättelsen bygger på verkliga händelser i Sverige under kalla kriget.Anders Jallai är en av landets ledande thrillerförfattare. Han har en bakgrund som kustjägare i marinen och stridspilot i flygvapnet. Han har medaljerats av Hans Majestät Konungen och chefen för den Ryska marinen. 2004 blev han utsedd till årets projektledare för arbetet med, och fyndet av den försvunna svenska DC-3:an.\r\n\r\nUppläsare: Reine Brynolfsson\r\nSpeltid 8 tim 8 min","torrent":{"xt":"urn:btih:21bebb05bc0dfce06d9a2409e2a023a1dfc570d5","amp;dn":"Anders+Jallai+-+Vetenskapsmannen+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21bebb05bc0dfce06d9a2409e2a023a1dfc570d5","infoHashBuffer":{"type":"Buffer","data":[33,190,187,5,188,13,252,224,109,154,36,9,226,160,35,161,223,197,112,213]},"announce":[],"urlList":[]}}