{"title":"[NubileFilms] - Miyuki Son (Post It Kiss) [NEW May 11, 2016]","uid":14591324,"size":85804084,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:234da5f8382fac7743d7f08a65c8c9dfc8f79cc2&amp;dn=+%5BNubileFilms%5D+-+Miyuki+Son+%28Post+It+Kiss%29+%5BNEW+May+11%2C+2016%5D+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LucasCar","files":1,"time":1462978088,"description":"[NubileFilms] - Miyuki Son (Post It Kiss) [NEW May 11, 2016] \r\n\r\n Miyuki Son has just met David Santos, who she has brought in to help with an art project. The chemistry between the two is unmistakable, so when Miyuki orders David to take off his t-shirt he’s happy to comply. Miyuki responds by pressing post-it notes to David’s torso in all the places that she intends to kiss. David is having a hard time relaxing, so Miyuki leads him over to the couch. Once he has sat down, she tells him to close his eyes. Once he does, she puts her plan to action by kissing each of the spots where she had previous pressed a post-it. Her efforts to help him relax are definitely working, and they become even more effective when she unzips his pants and pulls out his hardening cock. Leaning forward, Miyuki wraps her lips around David’s dick and starts sucking. That’s all the encouragement David needs to get Miyuki out of her clothes so that he can bury his face between her legs. It’s not long before Miyuki is moaning as her release rolls through her in waves of ecstasy. Another brief blowjob is the prelude for the two new lovers finally coming together. Once Miyuki is satisfied that David is fully hard and ready to rock, she straddles his lap and then slides down so that she can ride her brand new stud. Her position puts her full firm breasts right in David’s face, adding to his pleasure as she bounces away. As soon as Miyuki cums again, she climbs off of David’s lap and goes to work with her hand on his fuck stick. He has definitely relaxed, as evidenced by the speed with which he finds release beneath her touch. Sticky with jizz and totally replete, David admits that he is finally relaxed enough to help Miyuki finish her project.\r\n \nhttp://imgart.org/img-573329f4752ac.html\r\n \nhttp://imgart.org/img-573329f8f1795.html\r\n \nhttp://imgart.org/img-573329fc5b07b.html\r\n\r\n\r\n\r\n★ ★ ★  For more Exclusive Porn please visit ★ ★ ★\r\n                \nhttps://thepiratebay.se/user/LucasCar/","torrent":{"xt":"urn:btih:234da5f8382fac7743d7f08a65c8c9dfc8f79cc2","amp;dn":"+%5BNubileFilms%5D+-+Miyuki+Son+%28Post+It+Kiss%29+%5BNEW+May+11%2C+2016%5D+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"234da5f8382fac7743d7f08a65c8c9dfc8f79cc2","infoHashBuffer":{"type":"Buffer","data":[35,77,165,248,56,47,172,119,67,215,240,138,101,200,201,223,200,247,156,194]},"announce":[],"urlList":[]}}