{"title":"Tartarughe Ninja alla riscossa S04e01-05 THE 7 STARS' TEAM","uid":13221591,"size":1068916756,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:23f5105a178cc0b8b9ed59e5ac053fa5d0901179&amp;dn=Tartarughe+Ninja+alla+riscossa+S04e01-05+THE+7+STARS%27+TEAM&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"foll01","files":5,"time":1452798301,"description":"Tartarughe Ninja alla riscossa S04e01-05, [Mux - H264 - Ita Ac3 Eng Aac] THE SEVEN STARS' TEAM\r\n\r\nTRAMA\r\n\r\nLe tartarughe ninja sono quattro tartarughe mutanti antropomorfiche, ghiotte di pizza e cresciute nelle fogne di New York, addestrate nell'arte marziale del ninjutsu da Hamato Yoshi, alias Splinter, ex maestro di arti marziali.\r\n\r\nLe tartarughe acquisirono sembianza umanoide quando, nello stato di tartarughine d'acquario, entrarono in contatto con un misterioso composto chimico riversato nelle fogne, nelle quali finirono accidentalmente; poiché l'ultimo essere con il quale erano state in contatto era un umano, vennero trasformate in umanoidi. Anche Splinter, trovandosi nelle fogne a causa delle condizioni di indigenza in cui viveva, entrò a contatto con il composto trasformandosi a immagine dell'ultimo essere vivente con il quale era entrato in contatto; Yoshi nella sua miseria aveva per compagni dei topolini, e divenne un grosso topo antropomorfo.\r\n\r\nDeposto il nome di Yoshi e adottato quello di Splinter, il vecchio maestro adottò le giovani tartarughe, essendo sempre stato un amante degli animali, e le battezzò con i nomi di quattro protagonisti del Rinascimento: Leonardo da Vinci, Raffaello Sanzio, Michelangelo Buonarroti e Donatello. Le tartarughe conducono una vita riservata in ampie fogne, timorose di venire additate a mostri dalla popolazione umana e discriminate; quando salgono in superficie sono solite travestirsi sommariamente con un impermeabile ed un cappello Borsalino.\r\n\r\nInsieme combattono il diabolico Shredder, vecchio rivale di Splinter trasformatosi in un supercattivo che indossa un'armatura metallica ricolma di lame, ispirata a quella dei samurai giapponesi. Shredder comanda il clan del piede, un esercito di ninja robotici, e con lo sgradito ausilio di Krang, un alieno amorfo dall'intelletto superiore, trama per conquistare il potere assoluto.\r\n\r\nNelle loro avventure, le tartarughe ninja possono contare sull'aiuto di April O'Neil, una giornalista umana, che spesso passa loro informazioni di prima mano. Col tempo escono parzialmente dal loro cauto isolamento facendo amicizia anche con altri umani, come la collega di April, la sbadata Irma..\r\n\r\nRELEASE ORIGINAL FOR MORE INFO\r\n \nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=487987","torrent":{"xt":"urn:btih:23f5105a178cc0b8b9ed59e5ac053fa5d0901179","amp;dn":"Tartarughe+Ninja+alla+riscossa+S04e01-05+THE+7+STARS%27+TEAM","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23f5105a178cc0b8b9ed59e5ac053fa5d0901179","infoHashBuffer":{"type":"Buffer","data":[35,245,16,90,23,140,192,184,185,237,89,229,172,5,63,165,208,144,17,121]},"announce":[],"urlList":[]}}