{"title":"Joey DeFrancesco - Live The Authorized Bootleg","uid":13469246,"size":158326528,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:250d8261de703af055e9d06bf0b8aea3c99802a7&amp;dn=Joey+DeFrancesco+-+Live+The+Authorized+Bootleg&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"L_Hammond","files":10,"time":1454966060,"description":"Joey DeFrancesco - Live The Authorized Bootleg\r\n\r\nJoey DeFrancesco and George Coleman in top form. Highly recommended organ and sax jazz.\r\n\r\nTracklisting:\r\n01. Introduction (0:45)\r\n02. Cherokee (9:17)\r\n03. Ceora (Feat. Colleen McNabb) (13:50)\r\n04. I'm In The Mood For Love ( 6:36)\r\n05. On Green Dolphin Street (10:47)\r\n06. Little Girl Blue (11:48)\r\n07. Autumn Leaves (11:04)\r\n\r\nTotal Time: 64:10\r\n\r\n\r\nPersonnel: \r\n- Joey DeFrancesco, organ \r\n- George Coleman, tenor saxophone\r\n- Jake Langley, guitar\r\n- Byron Landham, drums\r\n- Colleen McNabb, vocal (I'm In The Mood For Love)\r\n\r\n\r\nLabel: Concord Music Group\r\nRecording date: April 2006, recorded live at Yoshi's, Oakland, CA\r\nRelease date: 6th March 2007\r\n\r\n\r\nFormat: MP3 320 kbit/s. All songs are tagged by the book.\r\n\r\n--------\r\n\r\nReview by Thom Jurek\r\nRecorded off the soundboard during a four-night stand at the famed Oakland, CA, jazz spot Yoshi's in April of 2006, Hammond B-3 boss Joey DeFrancesco laid it down with saxophonist George Coleman sitting in with his trio (which also includes guitarist Jake Langley and drummer Byron Landham). Even though these cuts are pieced together from all four nights rather than taken from one continuous performance, their raw and genuine excitement is not diminished a bit by editing. The set opens with DeFrancesco introducing Coleman. He begins to play while strolling to the mike, playing all the way along. When he arrives, he elegantly wraps up his prelude and the band steams into a smoking rendition of &quot;Cherokee.&quot; Coleman's on fire yet fluid, wrapping the notes around the time signature and being on the dime throughout his solo. DeFrancesco's own solo is one of those rather amazing things that, 50 years after Jimmy Smith, you still can't wrap your head around: that this lightning-quick playing can be done on a Hammond! A long read of Lee Morgan's gorgeous &quot;Ceora&quot; is next, with DeFrancesco filling the pockets during Coleman's fine and empathetic solo, which engages the melody while simultaneously reinventing it. With the exception of &quot;Cherokee&quot; and &quot;I'm in the Mood for Love&quot; (with a guest vocal appearance by Colleen McNabb on the latter), which both come in at under seven minutes, the other cuts here all clock in at over ten, with &quot;Ceora&quot; being the longest at nearly 14. The other extended workouts include an exciting &quot;On Green Dolphin Street,&quot; with Coleman doing his best playing on record since he appeared in Cedar Walton's Eastern Rebellion outfit. His reach for a modal frame in the solo is breathtakingly unexpected. Another pair of standards close out the set in &quot;Little Girl Blue&quot; and &quot;Autumn Leaves.&quot; DeFrancesco is his typically dazzling, solidly rhythmic self, but Coleman is the true star of the evening, and it is obvious that the bandleader wants it that way. He was the one who heard these fine renditions, and in particular Coleman's stellar playing, and insisted the recording be released. This is one of first essential jazz purchases of 2007.\r\n\r\n--------\r\n\r\nL Hammond, The Pirate Bay, where you'll find more jazz organ","torrent":{"xt":"urn:btih:250d8261de703af055e9d06bf0b8aea3c99802a7","amp;dn":"Joey+DeFrancesco+-+Live+The+Authorized+Bootleg","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"250d8261de703af055e9d06bf0b8aea3c99802a7","infoHashBuffer":{"type":"Buffer","data":[37,13,130,97,222,112,58,240,85,233,208,107,240,184,174,163,201,152,2,167]},"announce":[],"urlList":[]}}