{"title":"La Reine Margot 1994 BRRip Sonata Premiere","uid":14585001,"size":1775806779,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:268bf2f599b717d61a3b68e849e3c4493e455f40&amp;dn=La+Reine+Margot+1994+BRRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kleen2","files":3,"time":1462913702,"description":"The historical novel by Alexandre Dumas was adapted for the screen with this lavish French epic, winner of 5 Césars and a pair of awards at the Cannes Film Festival. Isabelle Adjani stars as Marguerite de Valois, better known as Margot, daughter of scheming Catholic power player Catherine de Medici (Virna Lisi). Margot is an heiress to the throne during the late 16th century reign of the neurotic, hypochondriac King Charles IX (Jean-Hugues Anglade), a time when Protestants and Catholics are vying for political control of France. Catherine decides to make an overture of good will by offering up Margot in marriage to prominent Protestant Huguenot Henri of Navarre (Daniel Auteuil), although she also schemes to bring about the notorious St. Bartholomew's Day massacre of 1572, when tens of thousands of Protestants are slaughtered. The marriage goes forward but Margot doesn't love Henri and takes a lover, the soldier La Mole (Vincent Perez), also a Protestant from a well-to-do family. Murders by poisoning follow, as court intrigues multiply and Catherine's villainous plotting to place her son Anjou (Pascal Greggory) on the throne threatens the lives of La Mole, Margot and Henri.\r\n\r\n\r\nSubs srt: Portuguese / English","torrent":{"xt":"urn:btih:268bf2f599b717d61a3b68e849e3c4493e455f40","amp;dn":"La+Reine+Margot+1994+BRRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"268bf2f599b717d61a3b68e849e3c4493e455f40","infoHashBuffer":{"type":"Buffer","data":[38,139,242,245,153,183,23,214,26,59,104,232,73,227,196,73,62,69,95,64]},"announce":[],"urlList":[]}}