{"title":"9th Dawn II 2 RPG v1.30","uid":13232634,"size":70137805,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:27c53de5b85515f4b6e5da8f9fab5db212738d0d&amp;dn=9th+Dawn+II+2+RPG+v1.30&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Androider","files":1,"time":1452966101,"description":"Explore an expansive and rich world; venture through thick forests, ancient ruins, deep caverns, and besieged towns. \r\n\r\nFrom the southern sands of the frigid glaciers to the north, engage in battle with the terrifying monsters and other unsavoury figures that aim to stand in your way. \r\n\r\nCollect an enormous amount of items, loot, weapons and armour from a colossal variety of monsters. The people you meet, the decisions you make, and the adventures you share in will shape the future of the world in which you live.\r\n\r\nDelve once more into the rich world of Caspartia, to a time when when humanity faces its greatest threat. Set out into a world on a perilous journey to aid in the reclamation of the home and birthplace of a once glorious and thriving nation. \r\n\r\nFor many years now, your home and people have been subjected to the might and brutality of the Hydra Dragon, but time chooses no favourites. You stand now at the precipice of a new age, but it is your actions that will decide the fate of mankind, and whether or not the sun will rise once more and shine upon Caspartia.\r\n\r\nTake on carefully crafted puzzles with deadly moving platforms above great depths. Learn and cast mighty spells to manipulate your foes. Trade and bank your spoils from the battlefield to gain vast riches. \r\n\r\nControl the game with fluid mobile controls and a comfortable GUI to easily manage your inventory, spells, world map and quest journal in this fast paced game. Endure the dangers of the world and become a legend in Caspartia.\r\n\r\nMore info:\r\n  \nhttps://play.google.com/store/apps/details?id=com.valorware.ninthdawnii","torrent":{"xt":"urn:btih:27c53de5b85515f4b6e5da8f9fab5db212738d0d","amp;dn":"9th+Dawn+II+2+RPG+v1.30","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27c53de5b85515f4b6e5da8f9fab5db212738d0d","infoHashBuffer":{"type":"Buffer","data":[39,197,61,229,184,85,21,244,182,229,218,143,159,171,93,178,18,115,141,13]},"announce":[],"urlList":[]}}