{"title":"Persian Mirrors The Elusive Face of Iran : Sciolino, Elaine azw3","uid":13017009,"size":1591700,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29a8e9ebe26de57995abd93e1d2062ea4f6bb312&amp;dn=Persian+Mirrors+The+Elusive+Face+of+Iran+%3A+Sciolino%2C+Elaine+azw3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"heliiaruy","files":1,"time":1450301886,"description":"Paperback: 432 pages\r\nPublisher: Free Press (October 3, 2005)\r\n\r\nNo American reporter has more experience covering Iran or more access to the private corners of Iranian society than Elaine Sciolino. As a correspondent for Newsweek and The New York Times, she has reported on the key events of the past two decades. She was aboard the airplane that brought Ayatollah Ruhollah Khomeini to Tehran in 1979; she was there for the Iranian revolution, the hostage crisis, the Iran-Iraq war, the rise of President Mohammad Khatami, and the riots of the summer of 1999.\r\nIn Persian Mirrors, Sciolino takes us into the public and private spaces of Iran -- the bazaars, beauty salons, aerobics studios, courtrooms, universities, mosques, and the presidential palace -- to capture the vitality of a society so often misunderstood by Americans. She demystifies a country of endless complexity where, on the streets, women swathe themselves in black and, behind high walls, they adorn themselves with makeup and jewelry; where the laws of Islam are the law of the land, and yet the government advertises as tourist attractions the ruins of the pre-Islamic imperial capital at Persepolis and the synagogue where Queen Esther is said to be buried; and where even the most austere clerics recite sensual romantic poetry, insisting that it refers to divine, and not earthly, love. Iran is also a place with a dark side, where unpredictable repression is carried out, officially and unofficially, by forces intent on maintaining power and influence.\r\nSciolino deftly uses her travels throughout Iran and her encounters with its people to portray the country as an exciting, daring laboratory where experiments with two highly volatile chemicals -- Islam and democracy -- are being conducted.\r\nLike the mirror mosaics found in Iran's royal palaces and religious shrines, there is more to the whole of the country than the fragments revealed to outsiders. Persian Mirrors captures this elusive Iran. Sciolino paints in astonishing detail and rich color the surprising inner life of this country, where a great battle is raging, not for control over territory but for the soul of the nation.\r\n\r\n\r\nthanks control+c !    azw3 can be converted in Calibre to whichever format you prefer, or can be directly placed in a Kindle file directory. Having been told I was uploading &quot;useless&quot; azw3 files, I hope you take the time to read this, learn about Calibre, or shut the fuck up. Cheers. Enjoy","torrent":{"xt":"urn:btih:29a8e9ebe26de57995abd93e1d2062ea4f6bb312","amp;dn":"Persian+Mirrors+The+Elusive+Face+of+Iran+%3A+Sciolino%2C+Elaine+azw3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29a8e9ebe26de57995abd93e1d2062ea4f6bb312","infoHashBuffer":{"type":"Buffer","data":[41,168,233,235,226,109,229,121,149,171,217,62,29,32,98,234,79,107,179,18]},"announce":[],"urlList":[]}}