{"title":"Moonrise.Kingdom.2012.Criterion.1080p.BluRay.x264.DTS-SARTRE","uid":13060134,"size":5573322049,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:2b069d1151c36f659a93412d449fcec8d9956345&amp;dn=Moonrise.Kingdom.2012.Criterion.1080p.BluRay.x264.DTS-SARTRE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sartre7","files":22,"time":1450705812,"description":"Director/co-writer Wes Anderson teams with screenwriter Roman Coppola for this period comedy-drama set in the 1960s, in which a pair of young lovers (Jared Gilman and Kara Hayward) from an island off the New England coast head for the hills and throw their small town into a frenzy. Bruce Willis co-stars with Bill Murray, Edward Norton, and Frances McDormand.\r\n\r\n\r\n\r\nSTARS.........: Jared Gilman, Kara Hayward, Bruce Willis\r\nDIRECTOR......: Wes Anderson\r\nWRITERS.......: Wes Anderson, Roman Coppola\r\nGENRE.........: Adventure | Comedy | Drama\r\nRATING........: 7.8/10  222,808 votes\r\nMETASCORE.....: 84/100\r\nIMDB link.....: http://www.imdb.com/title/tt1748122/\r\nRUNTIME.......: 1h 34mn\r\nSIZE..........: 4.49GB\r\nVIDEO CODEC...: x264 (  )\r\nRESOLUTION....: 1920x1040p\r\nBITRATE.......: 6000 Kbps (3-pass)\r\nFRAMERATE.....: 23.976 fps\r\nAUDIO1........: English DTS 5.1 768kbps\r\nAUDIO2........: Commentary with Wes Anderson, Roman Coppola, Bill Murray, Edward Norton\r\nSOURCE........: Criterion Blu Ray\r\nSUBTITLES.....: ENG \r\nCHAPTERS......: Yes\r\nENCODED BY....: Sartre\r\nENCODE DATE...: 2015-12-17\r\n\r\n\r\n\r\n\r\nExtras\r\n\r\n- The Making of &quot;Moonrise Kingdom&quot;: this featurette is broken into four segments that chronicle different phases of the production history of Moonrise Kingdom.\r\n\r\n     1. Exploring the Set - Martin Scali, who was Wes Anderson's assistant on Fantastic Mr. Fox, shot this segment in Newport, Rhode Island, during the filming of Moonrise Kingdom. In French and English, with optional English subtitles where necessary. (18 min, 720p). \r\n\r\n     2. Storyboard Animatics and Narrator Tests -  A) Opening Sequence, B) Church Flashback, C) The Island of New Penzance, D) The Island of St. Jack Wood (9 min, 720p).\r\n\r\n     3. Auditions - screen tests with some of the child actors. In English, not subtitled. (5 min, 720p).\r\n\r\n     4. Miniatures - a look at the special effects that are used during the flooding sequence. (2 min, 720p).\r\n     \r\n- Welcome to New Penzance - raw footage from various locations on the fictional island where key sequences from the film were shot. In English, not subtitled. (4 min, 720p).\r\n\r\n- Set Tour with Bill Murray: Bill Murray introduces Wes Anderson's film and cast members on the sets in Newport, Rhode Island. In English, not subtitled. (3 min, 720p).\r\n\r\n- Benjamin Britten's &quot;Noye's Fludde&quot;: music extracts with archival photographs. 1958 photographs by Mark Kauffman courtesy of the LIFE Picture Collection/Getty. (2 min, 720p).\r\n\r\n- Eleven iPhone Videos by Edward Norton: presented here is a gallery of home movies which Edward Norton made during the filming of Moonrise Kingdom. Also included with the movies is a brand new introduction by the American actor, which was filmed exclusively for Criterion's Blu-ray release. In English, not subtitled. (21 min, 720p).\r\n\r\n- Animated Books: the narrator in Moonrise Kingdom, played by Bob Balaban, introduces shorts segments in which Suzy reads paragraphs from her six favorite books. In English, not subtitled. (5 min, 720p).\r\n\r\n- Cousin Ben: additional footage with Jason Schwartzman's character, Cousin Ben. In English, not subtitled. (2 min, 720p).\r\n\r\n- Trailer: original trailer for Moonrise Kingdom. In English, not subtitled. (2 min, 720p).\r\n\r\n- Commentary: in this brand new audio commentary, director Wes Anderson, co-writer Roman Coppola, Bill Murray, Edward Norton, Jake Ryan, and Peter Becker (Criterion) discuss how Moonrise Kingdom was shot in Rhode Island, the unique qualities of the different characters in the film, the intimate nature of the shooting process (as well as the decision to shoot on 16mm), the framing choices, how the title of the film was chosen, the evolution of the relationships between the adults (Bill Murray and Frances McDormand), etc. The commentary was recorded exclusively for Criterion in 2015.\r\n\r\n\r\n\r\n \nhttp://i.imgur.com/qDDj9M8.jpg \nhttp://i.imgur.com/UqJzeZI.jpg \nhttp://i.imgur.com/vXYLn0R.jpg","torrent":{"xt":"urn:btih:2b069d1151c36f659a93412d449fcec8d9956345","amp;dn":"Moonrise.Kingdom.2012.Criterion.1080p.BluRay.x264.DTS-SARTRE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b069d1151c36f659a93412d449fcec8d9956345","infoHashBuffer":{"type":"Buffer","data":[43,6,157,17,81,195,111,101,154,147,65,45,68,159,206,200,217,149,99,69]},"announce":[],"urlList":[]}}