{"title":"Nubiles-Porn - Hollie Mack, Karla Kush, Piper Perri (Schooled By","uid":13049715,"size":349717965,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:2b337c600145f422c22d42ecc720b48014cd7a92&amp;dn=Nubiles-Porn+-+Hollie+Mack%2C+Karla+Kush%2C+Piper+Perri+%28Schooled+By&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xxxlavalxxx","files":2,"time":1450608546,"description":"Piper Perri and Hollie Mack are hanging out by the pool with Logan Pierce when he confesses that he left his soccer stuff in their teacher's car and begs them to be on their best behavior when Karla Kush comes by to drop it off. When Karla comes in she peppers the girls with compliments and then asks to try on their bikinis. The girls retreat to the bathroom, and Karla comes in a few moments later to help them undress.After helping Hollie onto the bathroom counter, Karla tells them that since she's going to be their teacher net year she's going to start their lessons early. She shows Hollie how to play with her clit while pushing a finger into her twat, and then gives Piper pussy licking lessons with Hollie as the model. After a role reversal where Piper gets all the attention, Karla suggests that they take this out into the living room.Taking her time, Karla peels off her bra and thong to strip for Logan's pleasure. She then coaxes the girls into a lusty threesome that Logan must watch for a few minutes before he is allowed to join in. From there it's no holds barred pleasure for all four participants as Logan is schooled on the proper technique to make his partners moan with orgasmic pleasure.Happy to play stud, Logan doesn't stop pounding the girls' pussies until the moment that he can't hold back a second longer. Then, Karla works Logan's cock in a handjob for the last little bit of stimulation that he needs to cum all over Hollie's and Pipers' waiting faces.\r\nTags: Lingerie, Hardcore, Outdoors, High Heels, Stockings, Blowjob, Facial, Deep Throat, Pussy Licking, Girl-Girl-Girl-Boy\r\n \nhttp://imgdone.com/viewer.php?file=25834724337017649319.jpg\r\n \nhttp://imgdone.com/viewer.php?file=55093379089082024554.jpg","torrent":{"xt":"urn:btih:2b337c600145f422c22d42ecc720b48014cd7a92","amp;dn":"Nubiles-Porn+-+Hollie+Mack%2C+Karla+Kush%2C+Piper+Perri+%28Schooled+By","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b337c600145f422c22d42ecc720b48014cd7a92","infoHashBuffer":{"type":"Buffer","data":[43,51,124,96,1,69,244,34,194,45,66,236,199,32,180,128,20,205,122,146]},"announce":[],"urlList":[]}}