{"title":"Curso basico de cristianismo - Luigi Giussani","uid":13450082,"size":1516586,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b7568a731876f5dc573aef7fab5e363de1d8815&amp;dn=Curso+basico+de+cristianismo+-+Luigi+Giussani&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"70n01m0","files":1,"time":1454793965,"description":"En este Curso básico de cristianismo, Giussani resume el itinerario de su pensamiento y de su experiencia.\r\nEl sentido religioso, que da título al primer libro de este Curso, se identifica con la esencia misma de la racionalidad, y se sitúa en el nivel de la experiencia elemental de todo hombre, aquel en el que el yo se hace preguntas acerca del significado de la vida, de la realidad, de todo lo que sucede, hasta descubrir ese sentido de la dependencia original que es la mayor evidencia para todos los hombres. Un descubrimiento que exalta la razón y que abre a la hipótesis de la revelación, es decir, de que el Misterio desconocido tome la iniciativa y venga al encuentro del hombre.\r\nDe esto trata Los orígenes de la pretensión cristiana, el segundo libro del Curso: el cristianismo se presenta como respuesta imprevisible, y sin embargo plenamente razonable, al deseo del hombre de vivir descubriendo y amando su propio destino. En un determinado momento histórico un hombre se identificó a sí mismo con lo divino. «He querido expresar en él la razón por la que un hombre puede creer en Cristo: la profunda correspondencia humana y razonable de sus exigencias con el acontecimiento del hombre Jesús de Nazaret».\r\nPor qué la Iglesia concluye la trilogía del Curso básico de cristianismo: la palabra «Iglesia» indica el fenómeno histórico cuyo único significado consiste en ser para el hombre la posibilidad de alcanzar certeza sobre Cristo. Cristo, después de dos mil años, sigue alcanzando al hombre a través de una realidad que se ve, se siente, se toca: la compañía de los que creen en Él","torrent":{"xt":"urn:btih:2b7568a731876f5dc573aef7fab5e363de1d8815","amp;dn":"Curso+basico+de+cristianismo+-+Luigi+Giussani","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b7568a731876f5dc573aef7fab5e363de1d8815","infoHashBuffer":{"type":"Buffer","data":[43,117,104,167,49,135,111,93,197,115,174,247,250,181,227,99,222,29,136,21]},"announce":[],"urlList":[]}}