{"title":"Arne Dahl - Blindbock (Svensk Retail EPUB)","uid":13018439,"size":1074275,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b8e9fdb5c06cfcf4d2719511ad9bcdcee359cd2&amp;dn=Arne+Dahl+-+Blindbock+%28Svensk+Retail+EPUB%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1450315765,"description":"Författare: Arne Dahl\r\n       Titel: Blindbock (Opcop #3)\r\nUtgivningsår: 2013\r\n       Språk: Svenska\r\n        ISBN: 9789175032771\r\n      Format: Retail EPUB\r\n\r\nVilka är det egentligen som ligger bakom alla tiggare som sprider sig över Europa? Och vad har det för koppling till det sms som EU:s miljökommissionär får i limousinen hem från invigningsbanketten för Europols nya, pampiga högkvarter i Haag? Och till den tilltagande rasismen i Europa? För att inte tala om den döende mannen som släpper en mobiltelefon i en blind tiggares tiggarskål vid Hornstull i Stockholm?  \r\n\r\nDet är het sommar i Europa. Europol får information om att ligorna som hanterar Europas tiggare styrs centralt och har kopplingar till större människohandel. Sedan ett par veckor har Paul Hjelm och hans Opcop-grupp storövervakning på den misstänkta ledningen för kontinentens tiggarligor. Gruppen befinner sig i en utrymd våning på ena sidan av en kanal i Amsterdam och spanar på en lägenhet på den andra.\r\n\r\nJust vid den här tiden blir Europol större. Den före detta polisbyrån, numera EU-myndighet, flyttar till ett mäktigt nytt högkvarter i Haag. Samtidigt sker ett drastiskt genombrott i den hittills rätt tröstlösa övervakningen.\r\n\r\nOch uppenbarligen försöker någon dessutom pressa en av Europas högst uppsatta politiker, den franska EU-kommissionären Marianne Barrière, just som hon är på väg att lägga fram ett internationellt lagförslag som äntligen kommer att sätta Europa på rätt kurs igen. Paul Hjelm tvingas ta inofficiella vägar för att utreda utpressningen, inte alltid så vackra, och spåren leder mot Europas högerextrema miljöer. När Kerstin Holm kommer på att han har anlitat Gunnar Nyberg, före detta polis i A-gruppen, bosatt i Grekland, för ett uppdrag är det redan för sent. Nyberg har begett sig in i mörkrets hjärta","torrent":{"xt":"urn:btih:2b8e9fdb5c06cfcf4d2719511ad9bcdcee359cd2","amp;dn":"Arne+Dahl+-+Blindbock+%28Svensk+Retail+EPUB%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b8e9fdb5c06cfcf4d2719511ad9bcdcee359cd2","infoHashBuffer":{"type":"Buffer","data":[43,142,159,219,92,6,207,207,77,39,25,81,26,217,188,220,238,53,156,210]},"announce":[],"urlList":[]}}