{"title":"NHL Hockey Target Smash v1.6.0 mod [apkpita]","uid":14625231,"size":74321171,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:2d23817497c2976a5e9988a5ff1f7bd432c3ad10&amp;dn=NHL+Hockey+Target+Smash+v1.6.0+mod+%5Bapkpita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":1,"time":1463295227,"description":"Smash your way to the Stanley Cup® in a casual, fun, target shooting NHL hockey game! By shattering targets and achieving high scores you'll take down NHL opponents head-to-head as you play your way through multiple seasons. Along the way unlock an arsenal of pucks and sticks like The Reaper and the Frost Edge to dominate the competition. Snipe targets with a quick flick or blast through them with a powerful slap shot. Rack up points and bonuses to keep your goal streak alive over three periods. Create your own hockey legend playing for any of the 30 NHL teams. Dominate the league and lead your team to win the most coveted trophy in all of sports - the Stanley Cup®.\r\n\r\nSTART OF THE NEW SEASON FEATURES:\r\nDrop the puck and play hockey! A brand new season of the NHL is upon us and NHL Hockey Target Smash is ready with a brand new season of its own... complete with ice-shattering new features that will make the crowd go wild!\r\n\r\nNEW FEATURES:\r\n• Team Play\r\n• Bonus Game - Bullseye\r\n• Bonus game - Bottle Bash\r\n• Bonus game - Sharp Shot\r\n• The Coach\r\n\r\nTEAM PLAY!\r\nTeam Play redefines the game and is the heart of the new NHL Hockey Target Smash new season.\r\n\r\nJoin your favorite team with the brand new, revolutionary &quot;Team Play.&quot; Face off against other NHL teams in weekly seasons where every point counts.\r\n\r\nTeam Play provides a purpose for points. Join a team for the season and then every point you score in any regular season &quot;ladder game&quot; is added to the total points for that team.\r\n\r\nFor example: everyone that joins the Minnesota Wild will have their points added to the total pool points of the Wild at the same time that everyone that has joined the Chicago Blackhawks will have their points added to the point pool for the Blackhawks. We know which one to root for, right?\r\n\r\nAt the end of each one-week season, players get prizes for just being on a winning team or the MVPs get awesome prizes for making it onto Team and NHL MVP lists.\r\n\r\nTeam Play is available starting at the 13th regular game of Season 1.\r\n\r\nMORE BONUS GAMES!\r\nIn addition to Team Play, we also added to the lineup of our very popular Bonus Games. The team of Onslaught, Siege, and Hotshot are now joined on the ice by Bullseye, Bottle Bash, and Sharp Shot.\r\n\r\nTHE COACH!\r\nPlayers are now walked through the first season and into the start of Team Play by the Coach and his (sometimes) gruff comments.\r\n\r\nThe game includes:\r\n\r\n- All 30 NHL teams and 60 uniforms\r\n- Endless season, playoffs, and the Stanley Cup Final® game modes\r\n- Pick-up and play flick shooting controls\r\n- Create your own character, choose a team, name, number, and more\r\n- Keep you stick down and head up to shoot past goalies and defensemen\r\n- Unlock custom sticks, pucks, and item bundles\r\n- Google Quests, leaderboards and achievements\r\n\r\nWhat’s new:\r\nNHL Hockey Target Smash is meeting the challenge of the Stanley Cup® Playoffs with a brand new lineup! Huuuge changes will make the game faster, more challenging, more fun, and more fair -- all with an insane amount of stuff going on!\r\nWe've taken the incredibly successful Team Play feature to all new level that we now call Tournaments. Instead of only one week seasons there will now be 7-Day, 3-Day, and 1-Day Tournaments with a wide variety of prizes. Also look for the new &quot;Friends&quot; team!\r\n\r\nMod Info:\r\n1. Unlimited money\r\n2. Unlocked features\r\n\r\nRequirements: Android OS 4.0.3 and up","torrent":{"xt":"urn:btih:2d23817497c2976a5e9988a5ff1f7bd432c3ad10","amp;dn":"NHL+Hockey+Target+Smash+v1.6.0+mod+%5Bapkpita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d23817497c2976a5e9988a5ff1f7bd432c3ad10","infoHashBuffer":{"type":"Buffer","data":[45,35,129,116,151,194,151,106,94,153,136,165,255,31,123,212,50,195,173,16]},"announce":[],"urlList":[]}}