{"title":"Super Mp3 Download 5.1.1.8 + Patch","uid":13022191,"size":6450319,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2deaf2ab957b18209fe267b63514d0cb9ed21b9d&amp;dn=Super+Mp3+Download+5.1.1.8+%2B+Patch&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rubberboy37","files":1,"time":1450364507,"description":"Super MP3 Download is a tool that let's you listen and downloas MP3 songs from the online enviroment.\r\n\r\n\r\nYou should be careful when installing this software. Since it is an ad-supported application, Super MP3 Download offers to install the HOT MP3 Toolbar. The application features an intuitive interface with few options, so users of any experience level can easily handle it.\r\n\r\n\r\nAll you have to do is type in the name of the artist and/or song, hit the search button and the results will almost instandly appear. Yopu can viewe their title, lenght and popularity, but you can also download them by specifying the output file name and destination, bitrate and ID3 tags.\r\n\r\n\r\nFurthermore, you can view hot songs found on the USA Airplay Hot 100, as well as the current day's hits by categories. If you have any issues, you can view the online FAQ page.\r\n\r\n\r\nUnfortunately, the Free edition of Super MP3 Download does not allow you to use the advanced search or download more than one MP3 at a time (you have to purchase the Pro Edition, in this case). Plus, the volume is kind of low, even at it's maximum capacity.\r\n\r\n\r\nAn MP3 song takes several minutes to download, during which system memory is moderately used. If you add several tasks to the queue, each one of them automatically starts when the previous song has completed downloading.\r\n\r\n\r\nOverall, Super MP3 Download is a great tool for downloading MP3 songs from the internet, but it lacks any advanced functions and sometimes it freezes.\r\n\r\n\r\nFeatures:\r\n\r\n\r\nOver 100 million MP3 for free\r\n\r\nSuper MP3 Download is free to use. You can search and download over 100 million MP3 from the largest download network fast and FREE.\r\n\r\n\r\nBring you the hottest songs\r\n\r\nSuper MP3 Download recommends you the USA Airplay Hot 100 every week and lists the hottest songs across all genres, from Electronic to Religious, Mainstream to Indie, Hip-Hop to Classical, ect.\r\n\r\n\r\nListen to music online whitout limits\r\n\r\nAll with unlimited access to over 100 million songs, you can listen to music online for FREE and try the searched results to decide which one to download.\r\n\r\n\r\nAdvanced search\r\n\r\nSuper MP3 Download can search songs in tags, title, artist, album and edition. You can even search the live, piano, guitar or cover editions of your favorite somngs.\r\n\r\n\r\nVersion: 5.1.1.8\r\nRelease date: Dec 16, 2015\r\nOS: Windows 2000/XP/Vista/7 (32-bit and 64-bit)\r\nLanguage: English","torrent":{"xt":"urn:btih:2deaf2ab957b18209fe267b63514d0cb9ed21b9d","amp;dn":"Super+Mp3+Download+5.1.1.8+%2B+Patch","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2deaf2ab957b18209fe267b63514d0cb9ed21b9d","infoHashBuffer":{"type":"Buffer","data":[45,234,242,171,149,123,24,32,159,226,103,182,53,20,208,203,158,210,27,157]},"announce":[],"urlList":[]}}