{"title":"Hogarth to Cruikshank - Social change in Graphic Satire","uid":13298164,"size":48478549,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:316a45a1f99d8eb309f062cb1b721e1ebb0c2648&amp;dn=Hogarth+to+Cruikshank+-+Social+change+in+Graphic+Satire&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"STBGD","files":1,"time":1453673960,"description":"Hogarth to Cruikshank: Social Change in Graphic Satire\r\nWalker and Company | 1967 | English | 254 pages | PDF | 46.2 MB\r\n\r\nThe 18th century was the golden age of English satire. By 1725, Pope, Swift, Gay and Fielding had already established it as a literary genre, and with Hogarth's famous series it attained a graphic form able to represent and criticize the customs, fashions and social startifications of the era. Satirical prints were everywhere: pasted on street corners, in ale-houses, in gin-shops; papered on the walls of private houses (Hogarth's prints adorned the dining room of Mrs Thrale's house in Streatham); hired out for entertaining in circulating libraries. Today, the works that have survived give us a dramatic pictorial record of high life, low life and middle life in 18th and early 19th century England, and in particular chart the steady rise in the numbers, prestige and wealth of the middle classes. This collection of over 200 black and white and 16 color prints combines with Dorothy George's widely acclaimed commentary to form a vivid portrayal of shifting prejudices and passing sensations in a period of accelerating social change in conflict with the traditional expressions of conservatism. The three periods covered are the relatively stable age of Hogarth; the flourishing of English caricature headed by Rowlandson and Gillray; and the Regency period, from its beginnings in 1811 to the early 1830s and the introduction of the Reform Bill. First published in 1967 and now reprinted to celebrate the Tate Gallery's exhibition on &quot;Manners and Morals: Hogarth and the Rise of English Painting&quot;, Hogarth to Cruikshank will be welcomed by general readers and specialists alike","torrent":{"xt":"urn:btih:316a45a1f99d8eb309f062cb1b721e1ebb0c2648","amp;dn":"Hogarth+to+Cruikshank+-+Social+change+in+Graphic+Satire","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"316a45a1f99d8eb309f062cb1b721e1ebb0c2648","infoHashBuffer":{"type":"Buffer","data":[49,106,69,161,249,157,142,179,9,240,98,203,27,114,30,30,187,12,38,72]},"announce":[],"urlList":[]}}