{"title":"[XXXTREMECOMIXXX] Supergirl Takes A Pounding","uid":13476654,"size":256601673,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:336504b618e79442471aaeccc86295d04f69b05a&amp;dn=%5BXXXTREMECOMIXXX%5D+Supergirl+Takes+A+Pounding&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"xxxsunset","files":1,"time":1455016735,"description":"Screenshots: \nhttp://imgur.su/image/RDjQ\r\n\r\nSupergirl is corned in the lair of The Mosquito. She uses her super strength to throw a mattress at him, but he easily deflects it. They grapple with each other, until Supergirl gets the upper hand. But a few nifty moves and a well placed kick has her down and out. The Mosquito picks her up by the neck and dangles her in the air, slamming is head into hers.\r\n\r\nDazed and confused, he throws her on the mattress and strips her skirt and panties off before getting naked and fucking her hard, her legs in the air. He switches positions several times as she screams and groans, trying to overpower him. She threatens to use her super kegels in order to rip his dick off, but that only makes his dick harder!\r\n\r\nHe sits her up and rams his dick down her super throat before bending her over and fucking her from behind. He encourages her to use her super kegels again to harm him but it ends up making him cum a load deep in her pussy.\r\n\r\nHe grabs a pair of leather straps and wraps them around her arms. He strings her up on a hook with her hands above her and exacts his revenge: an intense tickling session! She giggles and laughs as he tickles her sensitive body, trapped forever in his clutches. With a nasty blow to the head he quiets her, for now","torrent":{"xt":"urn:btih:336504b618e79442471aaeccc86295d04f69b05a","amp;dn":"%5BXXXTREMECOMIXXX%5D+Supergirl+Takes+A+Pounding","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"336504b618e79442471aaeccc86295d04f69b05a","infoHashBuffer":{"type":"Buffer","data":[51,101,4,182,24,231,148,66,71,26,174,204,200,98,149,208,79,105,176,90]},"announce":[],"urlList":[]}}