{"title":"Kenny Hotz's Triumph of the Will Season 1 + Extras 720P","uid":13221138,"size":4844639332,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:34e6e6dfc761f98ca470f53677ade93643ff95d0&amp;dn=Kenny+Hotz%27s+Triumph+of+the+Will+Season+1+%2B+Extras+720P&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":12,"time":1452784393,"description":"Coming off the widely successful Kenny vs. Spenny, Kenny Hotz wanted to move forward with creating a series that had more meaning for him. He came up with the idea to tackle newsworthy issues that would be both appealing and have meaning for audiences. Kenny vs. Spenny was a show about two friends trying to win a competition, says Hotz. There were some moralistic values in it so it did have some meaning but Kenny Hotzs Triumph Of The Will has real heart. This show means something its about the world, capitalism, religion, peace, love. To help him move forward with the concept of the show, Kenny enlisted the help of friends and colleagues Jeff Kassel and Sebastian Cluer, who produce with Hotz. Kenny told us about an idea he had for a show that would tackle zeitgeisty ideas in a way that no one else was doing, recalls Kassel. Adds Cluer; Kenny has always been a seeker of the unusual. His love of throwing himself in the mix is the template for doing this show. Kenny just goes for it he throws himself into the fire and walks out holding the flames. Despite having a gorilla approach to the show, the team wanted a more sophisticated look. We put a lot of thought into lighting and mood because the cameras are solely on Kenny and his journey. We have to stay true to what hes doing but also create a story arch and make sure it flows, notes Cluer. We really wanted to create something that was instantly recognizable. I think all of the episodes have a very unique brand and look to them.\r\n\r\nEPISODE SYNOPSES\r\n\r\n101: Take My Mom...Please! Logline:\r\n\r\nKenny tries to get his old, long widowed Mother laid.\r\n\r\nSynopsis:\r\n\r\nKenny's mother has been a lonely widow for over twenty years and at the age of seventy-five, she is running out of time to find a man. Kenny loves his mom. Shes the best mom ever and he wants to give her the greatest gift anyone can give a mother, a boyfriend. Can he make her want to be loved again and then make her appealing enough to hook a man?\r\n\r\n102: Kennibal Logline:\r\n\r\nKenny tries to become a cannibal.\r\n\r\nSynopsis:\r\n\r\nIt seems the difference between famous and infamous are becoming more blurred these days, so Kenny searches for world recognition the easy way by doing something sensational: dining on human flesh. Cannibalism is regarded as the world's number one taboo and Kenny is going to break it, but who will he eat and can he avoid getting arrested?\r\n\r\n103: Children of Abraham Logline:\r\n\r\nKenny tries to get the Jewish community to build a Mosque for Muslims. Synopsis:\r\n\r\nKenny has had enough with all the strife between the Jewish and Muslim religion and he wants to offer an olive branch. He will try to rally the Jewish community to finance and build a Mosque for Muslims with no strings attached, but for this gift of peace to be given, he needs to find Muslims willing to receive it. Will Kenny bring the children of Abraham together, or will he only unite them in their condemnation of this well-intentioned act?\r\n\r\n104: Rags to Biches Logline:\r\n\r\nKenny tries to do what his grandfather did, go from rags to riches in the new world. Synopsis:\r\n\r\nKenny wants to see if the American Dream is alive and well and sets out to recreate it by being dropped off butt-naked and broke in the desert outside of Las Vegas. Kenny has to survive the journey and then thrive in this Land of Promise going from rags to riches, but first he better find some rags to wear so he doesn't get arrested for public indecency!\r\n\r\n105: Sowschwitz\r\n\r\nLogline: Kenny tries to stop eating his favorite food, pigs.\r\n\r\nSynopsis: Kenny has troubles reconciling his love for all things pork and his hate for industrial pig farming. After finding out that pigs are the 4th smartest animals, Kenny sets out to prove to himself and the world that pigs should not be eaten.\r\n\r\n106: The French Reconnection Logline: Kenny tries to overcome his teenage hatred for the people of France.\r\n\r\nSynopsis: After backpacking across Europe in his teens, Kennys experiences in France left him feeling bitter towards its people, finding them to be mega wieners. Kenny will go back to France to do everything in his power to like the French and overcome his own racism. Hey, they let Hitler in with open arms, if they just give him half the welcome, Kennys bound to love them","torrent":{"xt":"urn:btih:34e6e6dfc761f98ca470f53677ade93643ff95d0","amp;dn":"Kenny+Hotz%27s+Triumph+of+the+Will+Season+1+%2B+Extras+720P","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34e6e6dfc761f98ca470f53677ade93643ff95d0","infoHashBuffer":{"type":"Buffer","data":[52,230,230,223,199,97,249,140,164,112,245,54,119,173,233,54,67,255,149,208]},"announce":[],"urlList":[]}}