{"title":"The-Laura-Ingraham-Show-Podcast May 16 2016","uid":14634863,"size":34862517,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:354cab24298268690870da2bb6efec136bfa781e&amp;dn=The-Laura-Ingraham-Show-Podcast+May+16+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1463430231,"description":"Laura Ingraham Podcast May 16, 2016 MP3\r\n\r\nGuest Host Betsy McCaughey welcomes: Dr. Sam Clovis &quot;We're dealing with two candidates with relatively high negatives&quot;. Columnist John Fund on Trump Tax returns &quot;a ticking time bomb for the GOP&quot;. CNBC commentator Larry Kulow on Trump tax plan &quot;Nothing's been put on paper, the candidate, Mr Trump has not signed off on anything&quot;. Manhattan Institute scholar Heather McDonald on Police issues &quot;officers are facing extraordinary hatred&quot; \r\n\r\nTrump presidency would revive neutered Congress, restore power to the people\r\nCharles Hurt - Washington Times\r\nUnruly voters have elected an opportunistic showman as their presidential nominee. They were aided by infiltrators in the primary who were not even Republicans.\r\n\r\n\r\nTrump vs. Clinton, Beyond the Cage Match\r\nKarl Rove - Wall Street Journal\r\nThis presidential campaign is good at producing attention-grabbing train wrecks. Last week Hillary Clinton attacked Donald Trump as &quot;a loose cannon.&quot; In turn, Mr. Trump called Mrs. Clinton &quot;the total enabler&quot; of her husband's affairs, and then he suggested that America repudiate some of its national \r\n\r\n\r\nThe Federal Bullies Strike Again\r\nThe U.S. Department of Education will tell school districts Friday that federal law requires them to allow students to use restrooms and locker rooms &quot;consistent with their gender identity,&quot; escalating the pressure from the Obama administration on the contentious public debate over transgender rights.\r\n\r\n\r\nSen. Sessions: Election offers a simple choice\r\nJeff Sessions - USA Today\r\nFor the first time in a long time, this November will give Americans a clear choice on perhaps the most important issue facing our country and our civilization: whether we remain a nation-state that serves its own people, or whether we slide irrevocably toward a soulless globalism that treats humans as interchangeable widgets in the world market.\r\n \nhttp://www.lauraingraham.com/","torrent":{"xt":"urn:btih:354cab24298268690870da2bb6efec136bfa781e","amp;dn":"The-Laura-Ingraham-Show-Podcast+May+16+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"354cab24298268690870da2bb6efec136bfa781e","infoHashBuffer":{"type":"Buffer","data":[53,76,171,36,41,130,104,105,8,112,218,43,182,239,236,19,107,250,120,30]},"announce":[],"urlList":[]}}