{"title":"Rush Limbaugh - April 27, 2016 Full Podcast.mp3","uid":14461458,"size":96862297,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:363faa9715c46de40cadc2800aec56b3585dfe93&amp;dn=Rush+Limbaugh+-+April+27%2C+2016+Full+Podcast.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1461813867,"description":"Rush Limbaugh April 27, 2016 Podcast MP3\r\n\r\nStraightening Out What I Said About Unrest at a Contested Convention\r\n\r\nRUSH: I made a reference to what would happen at the convention if Trump gets close and whatever games are played to deny him the nomination, even if it's this delegate mechanism that Cruz is using.  I made an observation that's true. And that is, if the nomination is denied Trump, Trump supporters are gonna go nuts.  Now, it has been suggested that I was advocating or acknowledging that there's going to be a riot.  That's not what I meant... They discussed this on The Five, my contention here that there would be hell to pay from the from the Trump supporters.\r\n\r\nThe Trump Tsunami\r\n\r\nRUSH:  I clearly said on this program 24 hours ago that what was gonna happen yesterday and last night was not gonna shake anything up because it was already expected to happen. And that's not true.  This was a tsunami that happened yesterday.  It was incredible what happened here yesterday... Do you realize, folks, that Trump won every county in every state that was holding elections yesterday?  Every county in every state.  Nobody predicted, even the most favorable predictions, even the most supportive predictions, nobody came close, really, to what happened yesterday.\r\n\r\nTed Cruz Isn't Triumphing with Conservatism Because Presidential Elections Are Situational, Not Ideological\r\n\r\nRUSH: The reason that Cruz, as a conservative, is not triumphing in this has nothing to do with the fact that conservatism is a minority. It has nothing to do with the fact that people are not conservative.  That's what makes it intriguing.  Conservatism's not losing membership.  Conservatism is not weakening.  Conservatism's not disbanding.  That's not a factor here.  That's what makes the answer to the question, the question itself, so fascinating. \r\n\r\n\r\nAnalyzing Trump's Foreign Policy Speech\r\n\r\nRUSH:  Well, of course it's a different Trump.  What do you mean, &quot;Is it a different Trump doing the speech?&quot;  Of course it's different.  He's reading a teleprompter.  That doesn't mean it's bad.  Trump is trying to show different sides to different people, or else his advisors have decided it's time to demonstrate some credentials and some weight here on foreign policy.\r\n\r\nCruz's 13 Instances Where Trump and Hillary Agree\r\n\r\nRUSH: Thirteen specific instances Cruz says that Donald Trump and Hillary Clinton are identical, policy-wise. \r\n\r\n\r\n\r\nGOP Establishment Looks Third Party\r\nApril 27, 2016\r\n\r\nRUSH: The Republican establishment is convinced and many conservative intellectuals are convinced that Hillary will win in a landslide.  They're out there, they're looking at Trump's negatives, they're looking at Trump's unfavorables, they're looking at Trump's numbers with women, and they're saying, &quot;My God, even if these polls are wrong by 10 points, it's still a disaster.  It's  a disaster!&quot;  \r\n \nhttp://www.rushlimbaugh.com/","torrent":{"xt":"urn:btih:363faa9715c46de40cadc2800aec56b3585dfe93","amp;dn":"Rush+Limbaugh+-+April+27%2C+2016+Full+Podcast.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"363faa9715c46de40cadc2800aec56b3585dfe93","infoHashBuffer":{"type":"Buffer","data":[54,63,170,151,21,196,109,228,12,173,194,128,10,236,86,179,88,93,254,147]},"announce":[],"urlList":[]}}