{"title":"Dolares de Arena.2014.Sand Dollars.1280X720p.x264.Aac.EngFreSubs","uid":13033027,"size":2279036889,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:36e87244da6e106c2be0c9cc69992108f9d4b0d4&amp;dn=Dolares+de+Arena.2014.Sand+Dollars.1280X720p.x264.Aac.EngFreSubs&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makalakat","files":1,"time":1450454244,"description":"The romance of sand and the realism of dollars sit elegantly side by side in this thoughtful, subtle third feature by directing tandem Israel Cardenas and Laura Amelia Guzman. Playing out against a dreamy Caribbean backdrop, Sand Dollars is indeed about dreams, unpicking those of a gracefully aging lady and her young lover with a trembling delicacy and attentiveness. Its decision to prioritize truthfulness of observation over the merely dramatic means that it will be too languid for many, but Sand still deserves to wash ashore at the festival where Cardenas' and Guzman’s previous films have made their home.\r\n\r\nSand Dollars is set in Las Terrenas, where aging, wealthy tourist Anne (Geraldine Chaplin) is in an ambiguous relationship with local girl Noeli (Yanet Mojica), perhaps 50 years her junior. Ambiguous because while Anne is in love with Noeli, they are both aware that Anne’s money is what has held them together for three years. It’s a form of prostitution, but not exactly that, and the script is nicely delicate about the way it explores the uncertainties of their relationship. Noeli has a boyfriend, Yeremi (Ricardo Ariel Toribio) — she pretends to Anne that he's her brother — who hovers uneasily on the margins, assuming that Noeli’s only in it for the money.\r\n\r\nNeither knows much about the other, and it’s better that way. The money guarantees that Noeli gets her fantasy of a life in Paris while Anne gets her fantasy that this girl might actually love her, but things start to unravel when Noeli realizes she’s pregnant and her Parisian dream suddenly becomes closer.\r\n\r\nThe story advances subtly and in small, unexpected ways, cleverly challenging expectation stereotypes as it goes. Anne is wonderfully played by a Chaplin entirely unafraid of revealing Anne’s physical frailties, especially through some extended early scenes. Her memorable features are as expressive as they’ve ever been: Anne is indeed the pathetic, elderly colonialist, but she also has a celebratory spirit about her.\r\n\r\nIf Noeli is indeed digging for gold, then the audience understands exactly why, despite a (slightly flat) performance from Mojica which is almost wordless. And though Yeremi has the macho look his culture expects of him, like Noeli, he is just a typical, insecure kid.\r\n\r\nOften there’s the feel of intimate documentary about the dialogues, which appear to be partly improvised. This drive for authenticity means that several silences drag on too long, but as the camera lingers on the face of Chaplin, longing and hopeless before suddenly exploding into a radiant smile, or on the dancing body of Noeli, enjoying the movement but also the power it gives her, it’s worth it. Veteran singer Ramon Cordero tops and tails with a couple of lively pieces, including the appropriately and marvelously entitled bachata 'You Will Be the Cause of My Death'.\r\n\r\nJonathan Holland \nhttp://www.hollywoodreporter.com/","torrent":{"xt":"urn:btih:36e87244da6e106c2be0c9cc69992108f9d4b0d4","amp;dn":"Dolares+de+Arena.2014.Sand+Dollars.1280X720p.x264.Aac.EngFreSubs","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36e87244da6e106c2be0c9cc69992108f9d4b0d4","infoHashBuffer":{"type":"Buffer","data":[54,232,114,68,218,110,16,108,43,224,201,204,105,153,33,8,249,212,176,212]},"announce":[],"urlList":[]}}