{"title":"Die Lust Katzen XXX (2001) DVDRip","uid":13220695,"size":734009437,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:40554ed5f0e197c42ac7a2413e1fdb7bd3f808c4&amp;dn=Die+Lust+Katzen+XXX+%282001%29+DVDRip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"B01010000","files":3,"time":1452768171,"description":"................................................\r\n\r\nIf you like this torrent, please post a comment!\r\n\r\n....... ::::♥:::: .......\r\n\r\nScreens:  \nhttp://imgcool.net/?p=893965 \nhttp://imgcool.net/?p=196353\r\n\r\n\r\nCategory: Feature, Foreign, Straight, Anal, Oral, Big Tits, Compilation\r\n\r\nCast: Anita Blond, Dora Venter, Julia Taylor, Laura Angel, Madalina Ray, Philippe Deam, Richard Lengin, Hurst Borch\r\n\r\nDescription\r\nLaura angel Julia Taylor - the real goddess of modern porno, and not only European. A collection of excellent scenes involving them are called &quot;Horny kitty&quot; proves it very well. Julia Taylor is still inferior in the competition for the palm of the most passionate and unbridled woman to his colleague Laura. But, on the other hand, Julia was lucky with Directors - almost all scenes on this collection are taken from movies of Mario Salieri, and he is never uninteresting women; when he takes Julia Taylor, she shines brighter than all. Take a look at the eighth episode of the collection, where Julia works in tandem with marginal Dora Venter, to experience all of this hypnotism is not such a passionate actress.\r\nBut in Laura angel simply has everything that should be great porn stars. It is a bit too large body - but the way can be a large Greek sculpture. Laura angel in General is so good on screen that sometimes it seems the living embodiment of erotic comics, like Jessica from &quot;Who framed Roger rabbit&quot;. In this collection she has no bad scenes. Especially pay attention to how well-chosen oral episodes Laura that refute the stereotype about the inability of Europeans to do real on-screen blow job. In those scenes where near Laura angel appear unquestionably beautiful women - Anita Blond, Madalina Rai - this dark-haired Czech with slanted eyes they did not lose, because she's insanely charming, and incredibly sexy.\r\n\r\nRuntime: 01:27:20 h.\r\nLanguage: German","torrent":{"xt":"urn:btih:40554ed5f0e197c42ac7a2413e1fdb7bd3f808c4","amp;dn":"Die+Lust+Katzen+XXX+%282001%29+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40554ed5f0e197c42ac7a2413e1fdb7bd3f808c4","infoHashBuffer":{"type":"Buffer","data":[64,85,78,213,240,225,151,196,42,199,162,65,62,31,219,123,211,248,8,196]},"announce":[],"urlList":[]}}