{"title":"The Blues Brothers (Band) - Discography [FLAC]","uid":13239647,"size":5242001961,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:407028dd7bfc29672533401942fb7dfe9cac7490&amp;dn=The+Blues+Brothers+%28Band%29+-+Discography+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bluesmax","files":362,"time":1453042033,"description":"The Blues Brothers, formally, variously The Blues Brothers' Show Band and Revue and The Blues Brothers' Rhythm and Blues Revue, are an American blues and rhythm and blues revivalist band founded in 1976 by comedy actors Dan Aykroyd and John Belushi as part of a musical sketch on Saturday Night Live. \r\n\r\n\r\nThe Original Lineup:\r\n\r\n&quot;Joliet&quot; Jake E. Blues (John Belushi) – lead vocals\r\nElwood J. Blues (Dan Aykroyd) – harmonica, backing vocals\r\nSteve &quot;The Colonel&quot; Cropper – lead and rhythm guitar (of Booker T &amp; the M.G.'s)\r\nMatt &quot;Guitar&quot; Murphy – lead and rhythm guitar (Howlin' Wolf, other artists)\r\nDonald &quot;Duck&quot; Dunn – bass guitar (of Booker T &amp; the M.G.'s)\r\nMurphy &quot;Murph&quot; Dunne – keyboards (brought in for the film due to Paul Shaffer's commitment to perform with Gilda Radner in Gilda Live!, toured with the band in the summer of 1980)\r\nWillie &quot;Too Big&quot; Hall – drums, percussion (formerly of the Bar-Kays, Isaac Hayes' band)\r\nTom &quot;Bones&quot; Malone – trombone, trumpet, saxophone (Saturday Night Live Band and formerly Blood, Sweat &amp; Tears)\r\n&quot;Blue&quot; Lou Marini – saxophone (SNL Band and formerly Blood, Sweat &amp; Tears)\r\nAlan &quot;Mr. Fabulous&quot; Rubin – trumpet (SNL Band)\r\nSteve &quot;Getdwa&quot; Jordan – drums, percussion (SNL Band) (does not appear in movie)\r\nBirch &quot;Crimson Slide&quot; Johnson – trombone (does not appear in movie)\r\nPaul &quot;The Shiv&quot; Shaffer – keyboards, arranger (does not appear in first movie, but appeared in the 1998 sequel, Blues Brothers 2000)\r\nTom &quot;Triple Scale&quot; Scott – saxophone (L.A. Express) (does not appear in movie)\r\n\r\n\r\n\r\nThe Blues Brothers &amp; The Blues Brothers Band Discography\r\n\r\nNotes: Folders = CD's are sorted by year of original release. Info sheets (release, label, tracklist, personnel) &amp; logs are included\r\n\r\nThe original Blues Brothers never recorded an entire studio album.  \r\n\r\n\r\nThe Blues Brothers feat. Elwood &amp; &quot;Joliet&quot; Jake Blues:\r\n\r\n1978 - Briefcase Full Of Blues (Recorded live on September 9, 1978 at the Universal Amphitheater, Los Angeles, CA) \r\n\r\n1978 - Live at The Closing of Winterland, Winterland Arena, San Francisco, CA, USA (unofficial release)\r\n\r\n1980 - The Blues Brothers - Music from the Soundtrack\r\n\r\n1980 - Made in America (Recorded live July 26 - August 1, 1980 at Universal Amphitheatre, Los Angeles)\r\n\r\n1981 - The Best Of The Blues Brothers (including previously unreleased live versions of &quot;Everybody Needs Somebody to Love&quot;, &quot;Rubber Biscuit&quot;, and &quot;Expressway to Your Heart&quot;)\r\n\r\n1988 - Everybody Needs Blues Brothers (Compilation, includes some different versions)\r\n\r\n1992 - The Defenitive Collection (Compilation, includes some different versions)\r\n\r\n1995 - The Very Best Of (Compilation)\r\n\r\n2000 - The Blues Brothers Complete (including one track not availaible on other albums/compilations: Excusez moi mon chérie)\r\n\r\n\r\nThe Blues Brothers Band with Eddie Floyd &amp; Larry Thurston as vocalists:\r\n\r\n1990 - Live In Montreux (Recorded live on July 12, 1989 at the Montreux Casino, Switzerland)\r\n\r\n1992 - Red, White And Blues (the only real studio album; Elwood Blues – harmonica, vocals on one track)\r\n\r\n\r\nBlues Brothers &amp; Friends - feat. Elwood (aka Dan Akroyd), Brother Zee (Jim Belushi) &amp; Eddie Floyd as vocalists:\r\n\r\n1997 - Live From Chicago's House of Blues (recorded live on  October 1, 1996; special guests Joe walsh, Billy Boy Arnold, Sam Moore &amp; Charlie Musselwhite)\r\n\r\n\r\nBlues Brothers feat. Elwood &amp; &quot;Mighty&quot; Mack McTeer (aka John Goodman) &amp; Buster Blues (aka J. Evan Bonifant) &amp; Cab Blues (aka Joe Morton) as vocalists:\r\n\r\n1998 - Blues Brothers 2000 - Original Motion Picture Soundtrack (also feat. Junior Wells, Koko Taylor, Erykah Badu, B.B. King, Bo Diddley, Isaac Hayes,  Dr. John, Eric Clapton, Steve Winwood, Charlie Musselwhite, Jimmy Vaughan...)\r\n\r\n\r\nThanks to all op's for your contributions. In Blues We Trust - maxblues","torrent":{"xt":"urn:btih:407028dd7bfc29672533401942fb7dfe9cac7490","amp;dn":"The+Blues+Brothers+%28Band%29+-+Discography+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"407028dd7bfc29672533401942fb7dfe9cac7490","infoHashBuffer":{"type":"Buffer","data":[64,112,40,221,123,252,41,103,37,51,64,25,66,251,125,254,156,172,116,144]},"announce":[],"urlList":[]}}