{"title":"Real Adventures Vol 137","uid":13347270,"size":1468567995,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:4091714ca854285377e34b945a6aecf10c05ec95&amp;dn=Real+Adventures+Vol+137&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"ImgSnaps","files":9,"time":1454058942,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/FY1\r\n \nhttp://imgsnaps.com/image/FY2\r\n \nhttp://imgsnaps.com/image/FYO\r\n\r\nDescription:\r\n\r\nTitle: Real Adventures Vol 137\r\nStudio: Dreamgirls\r\nRelease Date: 2011\r\nDirector: Not Available\r\nStarring: Lexi\r\nCategories: Amateur Public Exhibitionism Outdoors Parties Clubs Pro.Amateur Blonde Group Brunette Oral Cunnilingus Strip.Tease Modeling Posing Tit.Sucking Girl.On.Girl Lesbian Toy Solo Masturbation\r\nMovie Info: Get ready for latest and greatest edition of Real Adventures yet! Real Adventures 137 takes you all across this great country of ours in search of the craziest adventures, awesome parties and of course...smoking hot women flashing in public! This edition of Real Adventures is hosted by a petite blonde named Lexi. Lexi is a slender and athletic girl with adorable and sexy small tits with perky nipples that just scream pinch me. Lexi also possesses an incredible ass that she loves to show off in public and it is a wonderful thing to see her bent over.\r\n\r\nWe start off Real Adventures 137 with an outrageous spring break trip in Key West where we have 2 awesome DreamGirls strip down and drive and ride around the streets naked and flashing everyone on the road. They flash their tits and asses to everyone and even find time to kiss and lick each other as they go. We then head to South Padre Island for a Wild Wet T-shirt contest and we stick around to see some club girls flash for our cameras.\r\n\r\nIt's then Party Cove as we show you girls that love to dance naked on boat tops. It's then back to Key West and then to Bourbon Street and Mardi Gras for more tits on the street. We then go behind the scenes to see a hot girl flash in public and wrap up Real Adventures 137 with Lexi getting herself off with a pink vibrator","torrent":{"xt":"urn:btih:4091714ca854285377e34b945a6aecf10c05ec95","amp;dn":"Real+Adventures+Vol+137","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4091714ca854285377e34b945a6aecf10c05ec95","infoHashBuffer":{"type":"Buffer","data":[64,145,113,76,168,84,40,83,119,227,75,148,90,106,236,241,12,5,236,149]},"announce":[],"urlList":[]}}