{"title":"Stargate Atlantis - Season 05 - Episodes 1 thru 10","uid":14624342,"size":9470065969,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:47299978a3e97954b4b157354bc43314fa806ef8&amp;dn=Stargate+Atlantis+-+Season+05+-+Episodes+1+thru+10&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":24,"time":1463284282,"description":"Stargate Atlantis - Season 05 - Episodes 1 thru 10\r\n\r\n\r\nSeason four premiered in the USA on September 28, 2007,[4] and in the UK on October 9, 2007. The writers stated that season 4 would take the series in a new direction. As the 4th season begins where season 3 ended, the future seems bleak: Weir is incapacitated and the senior members of the expedition have suffered multiple injuries. With the city damaged, running out of power and drifting in space, cut off from Earth, the Atlantis expedition raids Asuras to obtain a ZPM and is able to travel to a nearby planet. Weir is captured by the Asurans and Colonel Samantha Carter joins as a regular and acts as the expedition leader.[5] She appears in the episode &quot;Lifeline&quot; after helping to find and land Atlantis on its new home planet; she is then ordered back to the SGC. In episode 3, under the IOA's orders, Carter returns to Atlantis as the new \r\n\r\n\r\nleader of the expedition after Atlantis lands. The season focuses on the main antagonists: the Asurans and the Wraith, as well as the pregnancy of Teyla Emmagan. The Asuran base code is reprogrammed by McKay, leading the nanobots to fulfill the purpose for which the Ancients created them: to wipe out the Wraith. Midway through the season, they are seemingly destroyed, and the remaining episodes concentrate mainly on Michael's efforts against both humans and the other Wraith.\r\n\r\nIn the fifth season, Richard Woolsey replaces Carter as the leader of the expedition. Teyla, who was held captive by Michael, gives birth to Torren John and escapes with her team, before they are able to cripple Michael. Eventually, he invades Atlantis with a commandeered Puddle Jumper to take Torren and destroy Atlantis but, thanks to the efforts of Sheppard, Teyla, and McKay, Michael is finally killed. The season also introduces a group of rogue Asgard, who unlike their Ida counterparts, actually experiment on humans to prolong their lives, and steal a device known as &quot;The Attero device&quot; to destroy the Wraith, though the side effect is that any Stargate activated after the device has been turned on will explode. The device is eventually destroyed. With the Attero device, Michael and the Hoffan drug, the Wraith have become weakened, and are no longer the power of the galaxy they once were; this gives the humans of the Pegasus galaxy freedom enough to establish a coalition. McKay falls in love with Keller, who eventually reciprocates his feelings, and they become romantically involved. In the season finale (also the series finale), &quot;Enemy at the Gate&quot;, Todd the Wraith alerts Atlantis to the fact that an underling wraith possesses a Hive Ship powered by a ZPM. In the process of trying to retrieve the ZPM and disable the Hive, the Atlantis team is present when the Hive receives a communication sent from an alternate reality giving away Earth's location. The Hive disables both the Daedalus and the Apollo, then heads straight to Earth. Thanks to the efforts of the expedition, the ship is finally destroyed over Earth, and Atlantis lands in the Pacific Ocean near the Golden Gate Bridge in San Francisco.\r\n\r\nCast[edit]","torrent":{"xt":"urn:btih:47299978a3e97954b4b157354bc43314fa806ef8","amp;dn":"Stargate+Atlantis+-+Season+05+-+Episodes+1+thru+10","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47299978a3e97954b4b157354bc43314fa806ef8","infoHashBuffer":{"type":"Buffer","data":[71,41,153,120,163,233,121,84,180,177,87,53,75,196,51,20,250,128,110,248]},"announce":[],"urlList":[]}}