{"title":"Synchronous Generators, 2nd Edition [2015] [PDF]","uid":13246031,"size":13869689,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47880e66b5a201edc5e1d25cf6dc3d59d1334b4f&amp;dn=Synchronous+Generators%2C+2nd+Edition+%5B2015%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoctDeath","files":2,"time":1453105203,"description":"Title: Synchronous Generators \r\nSeries: Electric Generators Handbook \r\nAuthor: Ion Boldea \r\nFormat: PDF \r\nHardcover: 498 pages \r\nPublisher: CRC Press; 2 edition (October 5, 2015) \r\nLanguage: English \r\nISBN: 9781498723565 \r\n\r\n\r\nSynchronous Generators, the first of two volumes in the Electric Generators Handbook, offers a thorough introduction to electrical energy and electricity generation, including the basic principles of electric generators. The book devotes a chapter to the most representative prime mover models for transients used in active control of various generators. Then, individual chapters explore large- and medium-power synchronous generator topologies, steady state, modeling, transients, control, design, and testing. Numerous case studies, worked-out examples, sample results, and illustrations highlight the concepts.\r\n\r\nFully revised and updated to reflect the last decade’s worth of progress in the field, this Second Edition adds new sections that:\r\n\r\n- Discuss high-power wind generators with fewer or no permanent magnets (PMs)\r\n- Cover PM-assisted DC-excited salient pole synchronous generators\r\n- Present multiphase synchronous machine inductances via the winding function method\r\n- Consider the control of autonomous synchronous generators\r\n- Examine additional optimization design issues\r\n- Illustrate the optimal design of a large wind generator by the Hooke–Jeeves method\r\n- Detail the magnetic equivalent circuit population-based optimal design of synchronous generators\r\n- Address online identification of synchronous generator parameters\r\n- Explain the small-signal injection online technique\r\n- Explore line switching (on or off) parameter identification for isolated grids\r\n- Describe synthetic back-to-back load testing with inverter supply\r\n\r\nThe promise of renewable, sustainable energy rests on our ability to design innovative power systems that are able to harness energy from a variety of sources. Synchronous Generators, Second Edition supplies state-of-the-art tools necessary to design, validate, and deploy the right power generation technologies to fulfill tomorrow's complex energy needs","torrent":{"xt":"urn:btih:47880e66b5a201edc5e1d25cf6dc3d59d1334b4f","amp;dn":"Synchronous+Generators%2C+2nd+Edition+%5B2015%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47880e66b5a201edc5e1d25cf6dc3d59d1334b4f","infoHashBuffer":{"type":"Buffer","data":[71,136,14,102,181,162,1,237,197,225,210,92,246,220,61,89,209,51,75,79]},"announce":[],"urlList":[]}}