{"title":"ITV.Doc.The.Nations.Favourite.Bond.Song.EN.SUB.WEBRIP.[MPup]","uid":13029140,"size":785451194,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4df4b5bdf099bed8df639c27b17bed5a8de2c6f3&amp;dn=ITV.Doc.The.Nations.Favourite.Bond.Song.EN.SUB.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":2,"time":1450434845,"description":"ITV.Documentaries.2015.12.17.The.Nations.Favourite.Bond.Song.EN.SUB.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\nSize: 896x504\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\n[img]http://extraimago.com/images/2015/12/18/cea3ff511b5af37b757b08be2e9cf59c.jpg[/img]\r\n\r\nFor over 50 years, the James Bond films have provided us with some of the most memorable and exciting songs in movie history.\r\n \r\nThis 90 minute special tells the stories behind 20 of the very best as it counts down to The Nation’s Favourite Bond Song - which has come out on top in an exclusive ITV poll of viewers.\r\n \r\nAlong the way, the documentary celebrates some of the most popular Bond themes from across the decades – from early classics like From Russia With Love and Goldfinger, to more recent chart smash hits including A View To A Kill and Die Another Day.\r\n \r\nThe programme features interviews with those who have written songs for a whole host of Bond films - including Sir Paul McCartney &amp; Wings, Duran Duran and a-ha as well as lyricists like Leslie Bricusse (You Only Live Twice, Goldfinger) and Don Black (Diamonds Are Forever, Thunderball), as the show reveals how these famous 007 anthems propelled their way onto the big screen.\r\n \r\nPlus, with contributions from Sam Smith and Spectre producers Barbara Broccoli and Michael G Wilson, the programme hears how - after more than 50 years - Bond only recently got its first ever UK number one record with Smith’s Writing’s On The Wall.\r\n \r\nThere’s stories from inside the studio from those involved in the recording of these Bond classics, such as Vic Flick (guitarist on the famous James Bond theme), and Paul Epworth (co-writer and producer of Adele’s Oscar-winning hit, Skyfall).\r\n \r\nAnd a whole host of stars reveal their own personal favourite Bond songs - from Jonathan Ross, Piers Morgan, Moby and Jools Holland - to some of Bond’s biggest stars, including Sir Roger Moore, Honor Blackman, Joanna Lumley, Britt Ekland, and Naomie Harris","torrent":{"xt":"urn:btih:4df4b5bdf099bed8df639c27b17bed5a8de2c6f3","amp;dn":"ITV.Doc.The.Nations.Favourite.Bond.Song.EN.SUB.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4df4b5bdf099bed8df639c27b17bed5a8de2c6f3","infoHashBuffer":{"type":"Buffer","data":[77,244,181,189,240,153,190,216,223,99,156,39,177,123,237,90,141,226,198,243]},"announce":[],"urlList":[]}}