{"title":"All about the troll JuniusThaddeus aka Michealdsuarez","uid":14484313,"size":5115977,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4f3c1f8ef15bccbaa5b244eed767fff5cea2adf6&amp;dn=All+about+the+troll+JuniusThaddeus+aka+Michealdsuarez&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JuniusThaddeus","files":1,"time":1462050349,"description":"Torrent contains a document about JuniusThaddeus and his trolling, images showing him promoting his amateur porn on breeding.zone (a site where gays who have fetishes of bareback anal sex and spreading AIDS on post regularly on) and an amateur porn video of him showing him being bareback fucked.\r\n\r\nAbout JuniusThaddeus:\r\n\r\nJuniusThaddeus (aka Michaeldsuarez) is an ex-user of Wikipedia who got banned after his cyber-stalking and obsessive trolling on Encyclopedia Dramatica was discovered. With a long and pathetic internet history going all the way back to 2006, Michael D Suarez started his stalking and trolling at the young age of 17. The year is now 2016 and Michael still continues to troll, making him 27 at the time of typing this. Anyone else by that age would have achieved something and would have something resembling a real life but Michael is still a basement dweller living with his parents, his trolling obsession is the reason he lives.\r\nMichael clearly suffers from many mental issues, we can guess he also has low self esteem in real life (hence his desire to escape into fantasy RPG's which he wrote about so much and the internet of course which he uses so much) and an inflated ego but the major issue he has is internet addiction disorder. Michael clearly suffers from a superiority complex too and made it his goal to rise through all Wikias possible.\r\n\r\nAt some point in his pathetic cyber-life, Michael had some disputes with some other users on Wikipedia (one of whom led to Michael being perma IP banned from Wikipedia, a rare occurrence indeed but we'll get to that in a minute) who managed to slip around Wikipedia's policies to troll Michael. Michael did what any typical butthurt Wikipedian would do in response: he ran to Encyclopedia Dramatica and made an entire page dedicated to his nemesis (Fæ) which was later discovered by Wikipedia's admins leading to Michael's perma IP ban from the wiki. This wasn't a first as Michael had done this before against other people he hated.\r\nMichael's obsession of Wikipedia didn't stop however as he kept using his talk page to moan about his ban. This led to one mod just removing this feature so his account couldn't do anything.\r\n\r\nStill butthurt at Fae, Michael spent over three years on the Fae's Encyclopedia article, updating it all the way into 2014 whilst in denial that he was mentally ill as he wrote the next wall of text about his nemesis. Michael took Wikias very seriously to the point where he always wanted to get his way and stormed off in a strop to Encyclopedia when he didn't. A hypocrite who condemned trolls on Wikipedia but was a troll off-site, Michael will forever be remembered as an incredible hypocritical moron.\r\n\r\nMichael's problem wasn't his trolling of Fae (who himself was a troll and dishonest person) but his harassment towards people of religion as well as the abuse of his privileges on Wikipedia to harass anyone who did not share his own views. The &quot;Fae Controversy&quot; simply reveals that Michael is clearly mentally ill like many of these internet atheists who take e-drama so seriously, the stalking and harassment of Fae is exactly what Michael did to anyone else, including the religious, just for something as simple as disagreeing with him and his atheist beliefs.\r\n\r\nMichael has taken to uploading pornography of himself being bareback anal fucked. He himself posted this porn on breeding.zone, a site for gays who have a fetish for spreading AIDS and/or HIV. It’s clear from his trolling and this, that he’s a sick fuck in need of some mental help","torrent":{"xt":"urn:btih:4f3c1f8ef15bccbaa5b244eed767fff5cea2adf6","amp;dn":"All+about+the+troll+JuniusThaddeus+aka+Michealdsuarez","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f3c1f8ef15bccbaa5b244eed767fff5cea2adf6","infoHashBuffer":{"type":"Buffer","data":[79,60,31,142,241,91,204,186,165,178,68,238,215,103,255,245,206,162,173,246]},"announce":[],"urlList":[]}}