{"title":"Earl Mindel PHD Healing Power Negative Ions","uid":14462433,"size":27607654,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5010d83cbb85ca8f92e300fc07649bb1b028d514&amp;dn=Earl+Mindel+PHD+Healing+Power+Negative+Ions&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1461820903,"description":"Coast to Coast April 25, 2015 - Earl Mindel Phd herbalist - Negative Ions\r\nHealth Power of Negative Ions\r\n\r\n\r\nDate:\tMonday - April 25, 2016\r\n\r\nHost:\tGeorge Noory\r\nGuests:\tEarl Mindell, Elaine Kuzmeskus\r\n\r\nIn the first half, registered pharmacist, master herbalist, and author Earl Mindell, PhD, discussed the healing power of negative ions, as well as the importance of vitamin and mineral supplementation. Negative ions first became known to the public in 1900, when the young engineering genius Nikola Tesla published an article about the work he'd been doing with his new invention, the Tesla Coil, in which he was able to send the current through his own body without harm, Mindell cited. In the 1930s, the scientist Clarence Hansell followed up on Tesla's work, and found that negative ions not only give people a sense of well-being, and energy, but also help against allergies, binding the pollutants and pollen in the air. Negative ions are produced in abundance in waterfalls, ocean waves, and are present in fresh air, Mindell noted.\r\n\r\nMindell said he gets negative ions by wearing a bracelet that contains rare earths that interact with the skin, though people can also use air ionizers. Interestingly, some models of Toyota's Camry have been equipped with an ion producing technology, as well as Russian submarines, he reported. Among the supplements Mindell highlighted were Vitamin D3, Coenzyme Q10 (especially important if one is taking statin drugs), and Vitamin E (use a combination of tocopherols and tocotrienols). He was critical of the typical American diet, which is too heavy in salt, sugar, and white flour, and advised consumers to read the labels when shopping","torrent":{"xt":"urn:btih:5010d83cbb85ca8f92e300fc07649bb1b028d514","amp;dn":"Earl+Mindel+PHD+Healing+Power+Negative+Ions","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5010d83cbb85ca8f92e300fc07649bb1b028d514","infoHashBuffer":{"type":"Buffer","data":[80,16,216,60,187,133,202,143,146,227,0,252,7,100,155,177,176,40,213,20]},"announce":[],"urlList":[]}}