{"title":"[NubileFilms] - Kendall Kayden, Kimmy Granger - (Three Way Fanta","uid":13036620,"size":300271230,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:538a6a0e1be4fb2ca4bb099e7a354305ae02831b&amp;dn=%5BNubileFilms%5D+-+Kendall+Kayden%2C+Kimmy+Granger+-+%28Three+Way+Fanta&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kuzili1","files":1,"time":1450484761,"description":"Kendall Kayden &amp; Kimmy Granger – Three Way Fantasy\r\nReleased: December 18, 2015\r\n\r\nVan Wylde knows that he is one lucky man when Kendall Kayden and Kimmy Granger strut up to him in full-on seduction mode. Their bras are easily removed as Van exchanges kisses with Kendall and then Kimmy. Once the girls are both topless, they sink to their knees in front of Van and go to work pulling out his dick for a shared double blowjob that only gets him hotter and hornier as they take turns deep throating him. Taking things to the bedroom, the girls have Van take a seat so that they can put on a show for him. After enjoying a searing kiss, Kimmy presses Kendall onto the bed so that she can rub her lover’s clit over her panties thong. Loving what she finds, Kimmy peels Kendall’s thong off and then settles in for a luxurious pussy licking that is augmented by two fingers pushed deep into Kendall’s greedy twat. Although Van enjoys his voyeurism, he desperately wants to join in. Approaching the bed from behind Kimmy, he slides her thong down her legs and off so that he can take the lusty coed from behind. Getting her pussy pounded doesn’t stop Kimmy from feasting on Kendall’s snatch; if anything, Kimmy is even more enthusiastic about putting her talented mouth to work for her lover’s pleasure. Switching things up, Kimmy adjusts her position so that she is seated atop Kendall’s face with her pussy in the perfect position to be eaten out. That leaves Kendall’s twat wide open for Van to press himself inside for his and Kendall’s deep pleasure, and the takes full advantage with long thrusts of his hips. The trio shifts into a similar position, only with Van lying on the bed with his body available for Kimmy’s and Kendall’s pleasure. Kimmy puts her lusty mouth back to work, bending nearly double to give Van a blowjob. Meanwhile, Kendall plops her puss atop Van’s mouth and then bends forward to buy her face in Kimmy’s snatch so that the lovers create a triangle of oral pleasure that is only broken when Kimmy turns around and sinks down until her sheath is fully impaled by her lover’s shaft. After taking a few moments to get her booty into the proper rhythm, Kimmy goes to town bouncing atop Van’s member while Kendall leans forward to caress her hands all over Van’s dick and Kimmy’s tight ass to increase both of their pleasure. The moment Kimmy’s twat starts throbbing with ecstasy, the lovers switch it up again so that Kendall is on her hands and knees taking a doggy style pussy pounding while Kimmy watches and masturbates with the help of Van’s fingers. Although Van could eagerly continue to please his two coeds all day, his endurance is only so good. He reaches the end of his limit just as he pulls out of Kendall’s snatch. Aiming his cock, he explodes all over Kendall’s ass and puss so that Kimmy can lap up his seed while sending a few final shivers of pleasure through her lover at the touch of her tongue on Kendall’s sensitive twat.\r\n\r\nFile size                                : 286 MiB\r\nDuration                                 : 25mn 12s\r\nBit rate                                 : 1 464 Kbps\r\nWidth                                    : 960 pixels\r\nHeight                                   : 540 pixels\r\nDisplay aspect ratio                     : 16:9\r\n\r\n\r\nTo avoid fakes, ALWAYS check that the torrent was added by kuzili1\r\n\r\n       \nhttp://extratorrent.cc/\r\n       \nhttp://extratorrent.cc/torrent/4600418/\r\n\r\nScreens...\r\n\r\n \nhttp://imgfapper.com/img-567495f4759b7.html","torrent":{"xt":"urn:btih:538a6a0e1be4fb2ca4bb099e7a354305ae02831b","amp;dn":"%5BNubileFilms%5D+-+Kendall+Kayden%2C+Kimmy+Granger+-+%28Three+Way+Fanta","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"538a6a0e1be4fb2ca4bb099e7a354305ae02831b","infoHashBuffer":{"type":"Buffer","data":[83,138,106,14,27,228,251,44,164,187,9,158,122,53,67,5,174,2,131,27]},"announce":[],"urlList":[]}}