{"title":"Max Safir - Bäste herrn... (Svensk Retail EPUB)","uid":13018604,"size":10002543,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5450d63b01b9bf99a63989bc9e25e033ca20f9ec&amp;dn=Max+Safir+-+B%26auml%3Bste+herrn...+%28Svensk+Retail+EPUB%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1450317472,"description":"Författare: Max Safir\r\n       Titel: Bäste herrn, låt mig få leva\r\nUtgivningsår: 2012\r\n       Språk: Svenska\r\n        ISBN: 9789186683108\r\n      Format: Retail EPUB\r\n\r\nNär Max var ung pojke hämtades han och hans bror av tyska SS-män i sitt hem i Kielce, Polen, och tillsammans med många andra judiska pojkar fördes de till arbetsläger i Cieszanów. Senare hamnade Max i tvångsarbetsläger i Starachowice, vidare förintelselägret Auschwitz-Birkenau och tvingades i krigets slutskede gå en dödsmarsch till det ökända koncentrationslägret Mauthausen i Österrike. Mer än sex och ett halvt år efter krigets utbrott befriades Max slutligen av amerikanska soldater i underlägret Ebensee. Han vägde då endast 24 kilo.\r\n\r\nEfter befrielsen försökte Max ta sig till det dåvarande brittiska mandatet Palestina, men hamnade i ännu ett läger på Cypern. Han upplevde senare staten Israels födelse och deltog i självständighetskriget 1948.\r\n\r\nBoken beskriver på ett levande sätt Max resa, från livet som barn i en stad i Polen till nazisternas koncentrations-, arbets- och förintelseläger och vidare fram till befrielsen samt tiden därefter. Boken innehåller även ett stort antal fördjupningstexter som ger historiska fakta kring kriget och Förintelsen. Detta tillsammans med en stark överlevnadsberättelse gör boken intressant att läsa för alla och mycket lämplig att använda i kampen mot antisemitism och främlingsfientlighet","torrent":{"xt":"urn:btih:5450d63b01b9bf99a63989bc9e25e033ca20f9ec","amp;dn":"Max+Safir+-+B%26auml%3Bste+herrn...+%28Svensk+Retail+EPUB%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5450d63b01b9bf99a63989bc9e25e033ca20f9ec","infoHashBuffer":{"type":"Buffer","data":[84,80,214,59,1,185,191,153,166,57,137,188,158,37,224,51,202,32,249,236]},"announce":[],"urlList":[]}}