{"title":"OSForensics 3.2.1003","uid":13052480,"size":54722665,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:562f87e729ad1ead7cb4674cf933e2032ea8400d&amp;dn=OSForensics+3.2.1003&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eden31","files":1,"time":1450633124,"description":"OSForensics 3.2.1003\r\n\r\nAttention!!! cet outil n'est à mettre qu'entre des mains expertes tant les fonctionnalités sont puissantes et est EXCLUSIVEMENT EN ANGLAIS\r\n\r\n\r\nOSForensics est un outil très puissant permettant de vous prendre pour Les Experts(sans les blagues mal traduites). Utilisé par la police pour récupérer des preuves dans un ordinateur, vous pourrez l'utiliser à la fois pour vérifier les informations que votre PC laisserait filtrer ou pour ausculter un ordinateur cible.\r\n\r\nAttention, ce liciel n'est pas à mettre entre toutes les mains! Malgré son interface bon enfant, il s'agit, en effet, d'un puissant outil de recherche et d'investigation utilisé par la police ou les professionnels de la restauration de fichier. OSForensics va scanner votre ordinateur ou celui que vous voudrez en vue d'en extraire les informations pertinentes : mot de passe (site ou documents), activité récente, fichiers supprimés ou avec une extension ne correspondant pas, etc. En plus de toutes ces fonctionnalités, le logiciel permet de créer un index des fichiers et des e-mails pour retrouver en un instant les éléments en rapport avec tel ou tel sujet. Il analyse le contenu du disque par secteur et fouille même dans la mémoire. Pour cette dernière option, il faudra bien sûr agir sur un ordinateur qui n'a pas été éteint ou redémarré, c'est pour cela que OSForensics propose de se placer sur une clé USB pour s'installer sur un PC &quot;à chaud&quot;. Notons aussi la possibilité de faire un cliché des partitions du disque pour observer les changements dans le temps ou créer une image du disque pour l'exporter et l'analyser tranquillement plus tard.\r\n\r\nSource : Les dossiers du pirate informatique\r\n\r\nToutes les infos virustotal etc : https://www.virustotal.com/fr/file/51f3ef56371a520b6d479ab83eaeddc377cb8c257435cefce4c3b80af0bf3611/analysis/\r\n\r\n\r\n\r\nen taille réelle ici : http://image.noelshack.com/fichiers/2015/51/1450599290-ss-2015-12-20-at-09-13-41.png\r\n\r\nSeule limitations de cette version : 200,000 items indexés et pas de support en ligne. Je ne ferai pas de support pour l'exploitation du logiciel tant l'éventail des possibilités est grand! Et encore une fois à réservers aux utilisateurs avancés et anglophones!!!","torrent":{"xt":"urn:btih:562f87e729ad1ead7cb4674cf933e2032ea8400d","amp;dn":"OSForensics+3.2.1003","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"562f87e729ad1ead7cb4674cf933e2032ea8400d","infoHashBuffer":{"type":"Buffer","data":[86,47,135,231,41,173,30,173,124,180,103,76,249,51,226,3,46,168,64,13]},"announce":[],"urlList":[]}}