{"title":"Tellurite Glasses Handbook - Physical Properties and Data 2nd ed","uid":14598516,"size":39216334,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:569730962ad6b744dc5dd08f6b7e4f289867a4d6&amp;dn=Tellurite+Glasses+Handbook+-+Physical+Properties+and+Data+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1463018950,"description":"Tellurite Glasses Handbook - Physical Properties and Data 2nd ed - Raouf A. H. El-Mallawany (CRC, 2012).pdf\r\n\r\nISBN 978-1-4398-4984-2\r\n\r\nTellurite Glasses Handbook: Physical Properties and Data, Second Edition covers the current dominant physical properties of this prototype glass system. Focusing on thermal, elastic, acoustic, electrical, and optical properties, this second edition incorporates the latest scientific data and up-to-date applications of tellurite glass.\r\n\r\nNew Topics in the Second Edition\r\n\r\nNanocomposites\r\nThree-dimensional structural models\r\nNovel glass-forming systems\r\nInnovative ways to combine all physical properties simultaneously, creating new points for research\r\n\r\nAddressing the knowledge gap among physicists, chemists, and material scientists in their understanding of tellurite glasses’ properties, this edition gathers essential thermal, mechanical, electrical, and optical data in one source. It emphasizes the physics and technology of twenty-first century processing, fabrication, and behavior of tellurite glass and glass-ceramic materials. It is the first and only comprehensive source of physical constants and properties of these unique noncrystalline solids.\r\n\r\nAfter an introductory chapter on the composition of tellurite glasses, the book explores elastic, acoustic, thermal, electrical, and optical properties. Each chapter includes basic theories on a particular physical property, related experimental techniques, and representative data. The book uniquely presents a compilation of scientific data from the last 60 years as well as practical and strategic applications based on the properties of tellurite glasses","torrent":{"xt":"urn:btih:569730962ad6b744dc5dd08f6b7e4f289867a4d6","amp;dn":"Tellurite+Glasses+Handbook+-+Physical+Properties+and+Data+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"569730962ad6b744dc5dd08f6b7e4f289867a4d6","infoHashBuffer":{"type":"Buffer","data":[86,151,48,150,42,214,183,68,220,93,208,143,107,126,79,40,152,103,164,214]},"announce":[],"urlList":[]}}