{"title":"Fundamental Principles of Polymeric Materials 3rd ed","uid":14591650,"size":10830953,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:57d2491545ddaac6411a3633acffcfc577024648&amp;dn=Fundamental+Principles+of+Polymeric+Materials+3rd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1462989238,"description":"Fundamental Principles of Polymeric Materials 3rd ed - Christopher S. Brazel, Stephen L. Rosen (Wiley, 2012).pdf\r\n\r\nISBN 978-0-470-50542-7\r\n\r\nNew edition brings classic text up to date with the latest science, techniques, and applications\r\n\r\nWith its balanced presentation of polymer chemistry, physics, and engineering applications, the Third Edition of this classic text continues to instill readers with a solid understanding of the core concepts underlying polymeric materials. Both students and instructors have praised the text for its clear explanations and logical organization. It begins with molecular-level considerations and then progressively builds the reader's knowledge with discussions of bulk properties, mechanical behavior, and processing methods.\r\n\r\nFollowing a brief introduction, Fundamental Principles of Polymeric Materials is divided into four parts:\r\n\r\nPart 1: Polymer Fundamentals\r\n\r\nPart 2: Polymer Synthesis\r\n\r\nPart 3: Polymer Properties\r\n\r\nPart 4: Polymer Processing and Performance\r\n\r\nThoroughly Updated and Revised\r\n\r\nReaders familiar with the previous edition of this text will find that the organization and style have been updated with new material to help them grasp key concepts and discover the latest science, techniques, and applications. For example, there are new introductory sections on organic functional groups focusing on the structures found in condensation polymerizations. The text also features new techniques for polymer analysis, processing, and microencapsulation as well as emerging techniques such as atom transfer radical polymerization.\r\n\r\nAt the end of each chapter are problems—including many that are new to this edition—to test the reader's grasp of core concepts as they advance through the text. There are also references leading to the primary literature for further investigation of individual topics.\r\n\r\nA classic in its field, this text enables students in chemistry, chemical engineering, materials science, and mechanical engineering to fully grasp and apply the fundamentals of polymeric materials, preparing them for more advanced coursework","torrent":{"xt":"urn:btih:57d2491545ddaac6411a3633acffcfc577024648","amp;dn":"Fundamental+Principles+of+Polymeric+Materials+3rd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57d2491545ddaac6411a3633acffcfc577024648","infoHashBuffer":{"type":"Buffer","data":[87,210,73,21,69,221,170,198,65,26,54,51,172,255,207,197,119,2,70,72]},"announce":[],"urlList":[]}}