{"title":"The-Laura-Ingraham-Show-Podcast-April 27 , 2016","uid":14455895,"size":33618252,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5c7efc5e77be12fcdb58c97fe05119af7ed517c9&amp;dn=The-Laura-Ingraham-Show-Podcast-April+27+%2C+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1461793835,"description":"Laura Ingraham Podcast April 27,2016\r\n\r\nByron York: 'Trump has moved the GOP base tremendously; he has the most powerful message' Carlson: GOP Elites Want Hillary \r\n\r\nGuest Lineup\r\nByron York - Chief Political Correspondent, Washington Examiner\r\nTucker Carlson - Editor in Chief, Daily Caller\r\nNayla Rush - Senior Researcher at the Center for Immigration Studies\r\n\r\nCarlson: GOP Elites Want Hillary\r\n\r\n\r\nWhat Trump Saw and Cruz Did Not\r\nWilliam Kristol - The Weekly Standard\r\nHere is the bulk of an April 24 memorandum from Rich Danker, a bright young conservative operative who ran the Lone Star Committee, an independent expenditure effort on behalf of Ted Cruz. Danker's insights go beyond his analysis of the 2016 Republican race, and are a helpful guide to any independent candidacy that may be necessary if Trump prevails. Danker has given permission for this part of his memorandum (his analysis of the race) to be reproduced.Trump passes Romney's popular vote total, will break Republican record\r\nWith his five blowout wins Tuesday night, Donald Trump has passed Mitt Romney's popular vote total from four years ago and is on a trajectory that could land him more Republican votes than any presidential candidate in modern history - by a lot.\r\n\r\n\r\nCarlson: GOP Elites Want Hillary\r\n\r\nTrump's Sweep a Humiliating Defeat for Elites\r\n\r\nWashington Post:\r\nDonald Trump’s sweeping victories Tuesday night move the Manhattan billionaire a step closer to winning the RepuByron York: 'Trump has moved the GOP base tremendously; he has the most powerful message'blican nomination for president and to pulling off the most improbable political feat in modern American history. But Trump’s story is about more than a first-time candidate’s stunning rise. It is also about the humiliating defeat suffered by an increasingly isolated political and media class who still do not understand the causes and scope of Trump’s populist revolt.\r\n \nhttp://www.lauraingraham.com/b/Trumps-Sweep-a-Humiliating-Defeat-for-Elites/108254759700515483.html\r\n\r\nCruz Made a Mistake Getting in Bed With Establishment\r\nJeffrey Lord - The American Spectator\r\nI confess I am astounded. Having written some columns in favor of a Trump-Cruz ticket, knowing that one primary after another has anti-Establishment candidates Donald Trump and Ted Cruz collectively racking up as much as 80% of the vote, it certainly seemed crystal clear what Republican voters were saying.\r\n\r\nCartels Help Terrorists in Mexico Get to U.S. to Explore Targets; ISIS Militant Shaykh Mahmood Omar\r\nMexican drug traffickers help Islamic terrorists stationed in Mexico cross into the United States to explore targets for future attacks, according to information forwarded to Judicial Watch by a high-ranking Homeland Security official in a border state. Among the jihadists that travel back and forth through the porous southern border is a Kuwaiti named Shaykh Mahmood Omar Khabir, an ISIS operative who lives in the Mexican state of Chihuahua not far from El Paso, Texas. Khabir trained hundreds of Al Qaeda fighters in Pakistan, Afghanistan and Yemen and has lived in Mexico for more than a year, according to information provided by JW's government source.\r\n\r\nKasich's Indiana allies rebel against Cruz pact\r\nJohn Kasich may have agreed to cede Indiana to Ted Cruz as part of a coordinated strategy to stop Donald Trump, but Kasich's top backers in the state say they're frustrated and confused by the tactical maneuvering - and they have no plans to play along","torrent":{"xt":"urn:btih:5c7efc5e77be12fcdb58c97fe05119af7ed517c9","amp;dn":"The-Laura-Ingraham-Show-Podcast-April+27+%2C+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c7efc5e77be12fcdb58c97fe05119af7ed517c9","infoHashBuffer":{"type":"Buffer","data":[92,126,252,94,119,190,18,252,219,88,201,127,224,81,25,175,126,213,23,201]},"announce":[],"urlList":[]}}