{"title":"Labrador - The Story of the World's Favourite Dog (2015) Gooner","uid":14639437,"size":4180715,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5cd51bcf6ff344134cfcd8be059c9fa82f862150&amp;dn=Labrador+-+The+Story+of+the+World%27s+Favourite+Dog+%282015%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1463496721,"description":"Labrador - The Story of the World's Favourite Dog (2015).epub Gooner\r\n\r\nPublisher: William Collins; 1st Edition edition (8 Oct. 2015)\r\nLanguage: English\r\nISBN-10: 0007549016\r\nISBN-13: 978-0007549016\r\n\r\nA social history of Labradors, and how they have become the world’s most beloved dogs, by writer, presenter and long-time dog lover Ben Fogle, whose beloved black Labrador, Inca, famously accompanied him on numerous journeys and adventures.\r\n\r\nLabradors are the most popular breed of dog in the world. Not only a great family companion, they also excel at hunting, tracking, retrieving, guiding and rescuing. But where did the breed originally come from? How did it develop? When did black, yellow and chocolate Labradors first appear? Did they really all come from Labrador in Canada and are they really all related to just one dog?\r\n\r\nIn this first history of the Labrador, Ben Fogle goes in search of what makes Labradors so special. Their extraordinary companionship, intelligence, work ethic and loyalty is captured by Ben as he weaves the story of the breed into his own story of his beloved Inca.\r\n\r\nBen visits Canada, discovers hair-raising stories of early Labrador exploits and uncovers stories of RNIB Labradors and Labradors at war, Labradors as working dogs and every other manifestation of the Labrador’s character. Exploring their origin, early characteristics, their use as gun dogs, as therapy dogs, as police dogs, as search and rescue dogs and last – and absolutely not least – as family pets, Ben tells the story of a dog breed which has captured our imagination and love for hundreds of years","torrent":{"xt":"urn:btih:5cd51bcf6ff344134cfcd8be059c9fa82f862150","amp;dn":"Labrador+-+The+Story+of+the+World%27s+Favourite+Dog+%282015%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cd51bcf6ff344134cfcd8be059c9fa82f862150","infoHashBuffer":{"type":"Buffer","data":[92,213,27,207,111,243,68,19,76,252,216,190,5,156,159,168,47,134,33,80]},"announce":[],"urlList":[]}}