{"title":"Sweet Daisy Haze - Puppet Mommy [480p]","uid":13457982,"size":193839499,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:620544cfea74410de89500cf4ad058e569eafc75&amp;dn=Sweet+Daisy+Haze+-+Puppet+Mommy+%5B480p%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxsunset","files":1,"time":1454863762,"description":"Screenshots: \nhttp://imgur.su/image/7Id3\r\n\r\n Having studied methods and subliminal messaging for years, and tired of his sexy mother's domineering ways, you, over months, slowly implants subconscious suggestion after suggestion into his mother. Finally, you are at the point where with the right command phrase (&quot;puppet mommy&quot;), you can literally tell her what to do, say, feel, or think. If you wants, you can even retain complete control over her body or parts of her body while permitting her to think and speak for herself. You then uses this control to take out his frustrations on his mother after she makes the mistake of shrilly chewing you out really bad one Sunday afternoon for now doing his chores. She begins to berate you, but You stops her in her tracks by speaking &quot;puppet mommy&quot;. She immediately freezes, standing at attention, arms relaxed at her sides, staring blankly off into nothing, awaiting commands from her master's voice, her son. You commands her to kneel, and suck him, to fuck her face on his cock like a machine. After some of this, you commands her to assume the persona of a mother who believes her only job is to get her son to orgasm in her asshole and will do anything to ensure that happens. So she assumes a cheery, slutty, butt-slut-mommy persona and immediately bends over and begs him to sodomize her. She continues the dirty talk and then you commands her to ride you anal cowgirl, with an A2M relube in between. During some riding the son thinks it will be interesting to retain control over his mother's body, but to allow his mother's actual persona to emerge only to give her awareness of the sodomy she is receiving and physically participating in. She speaks her mind as to how he could do this, weeping, sobbing, unable to comprehend how she cannot make her body obey. Apologizing for everything, for her bad behavior She is terrified, helpless, and compelled to continue to ride her ass up and down her son's cock. Eventually, her pleading becomes tiresome and you turns back on the slutty anal mommy persona, who carries on with the anal, the extreme dirty talk, and eagerness to get her son to come in her ass. You cum in her ass, she gladly cleans you with her mouth. Thanks you for letting her get him off with her butt. You turns back on the real mom persona to let sink in what she has just done. And leaves her in shock at what she has just done","torrent":{"xt":"urn:btih:620544cfea74410de89500cf4ad058e569eafc75","amp;dn":"Sweet+Daisy+Haze+-+Puppet+Mommy+%5B480p%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"620544cfea74410de89500cf4ad058e569eafc75","infoHashBuffer":{"type":"Buffer","data":[98,5,68,207,234,116,65,13,232,149,0,207,74,208,88,229,105,234,252,117]},"announce":[],"urlList":[]}}