{"title":"Star Chindy SciFi Roguelike v2.3.6 full","uid":13308896,"size":281586114,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:636d504322e03c13fe76b23a052f45293d6766b1&amp;dn=Star+Chindy+SciFi+Roguelike+v2.3.6+full&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tiropitaki","files":2,"time":1453761920,"description":"Star Chindy is a Sci-Fi Roguelike that offers ship-to-ship battle and tactical squad combat.\r\n\r\n★Synopsis★\r\nThe year is 2315. Mankind encounters a mechanical alien species called the Mechrons. This highly advanced species decimates the humans. However, on the brink of total annihilation, they mysteriously vanish from the system. To investigate and eliminate the threat, an organization called the Star League is formed. You are the decorated war hero, Chindy Ashford. Your mission is to search and destroy the Mechrons at all cost.\r\n\r\nFeatures\r\n※ Sci-Fi Roguelike\r\n- Thrilling space combat. A single mistake can prove fatal and end your game!\r\n※ A story with 5 chapters\r\n- Star Chindy is a roguelike with a rich story. Defeat powerful enemies in each chapter for the future of humanity.\r\n※ More than 200 random events\r\n- You will face various situations as you navigate space. You can encounter dangerous asteroid fields, space faring merchants, daring pirates, and mysterious aliens. Blast your way out or strike up a bargain!\r\n※ Space tactical squad combat and ship-to-ship battles\r\n- Experience real-time ship-to-ship battles and turn-based squad combat. Show the might of the human race against the Mechrons!\r\n※ 30+ units and ships\r\n- Star Chindy offers more than 30 types of units and spaceships. You can hire mercenaries at space stations or capture ships in your travels. Form a powerful fleet!\r\n※ 90+ items for units and ships\r\n- Loot awesome items from fallen enemies! Loot or buy items to fully equip your ships and crew. Customize their performance and tactics as you see fit!\r\n※ 110+ research projects\r\n- Your units and ships can be upgraded through research. Choose the best research and training while managing your resources!\r\n\r\n*Ship battle have a autopilot function on top right.\r\n1. Recommended for players who are familiar with Sci-Fi, RTS, turn-based strategy and roguelike games. \r\n2. Star Chindy may be difficult for casual players.\r\n3. Devices with 1.5GB RAM or more are recommended (Galaxy S4 LTE or better).\r\n4. Cloud save will be supported in the future.\r\n5. Game content is continuously added (as of Oct. 23rd).\r\n\r\nFAQ\r\n1. What is a Roguelike?\r\n- A single player game which resets entirely upon the death of the protagonist.\r\n\r\n2. Can this game run on my device?\r\n- In order to play Star Chindy smoothly, a device with 1.5GB RAM or more is recommended.\r\n\r\n3. How do I get a refund?\r\n- You can receive a refund within 2 hours of purchase. Refund is not available after 2 hours.\r\n\r\n4. How do I play the suppression fire tutorial?\r\n- Tap the Suppression, aim at the target, set half ammunition in the lower menu, and then tap OK. Do the same for the other target.\r\n\r\n5. What happens to my save data if I switch devices?\r\n- Currently, game data of Star Chindy is stored on the device, and cannot be transferred to a different device. Cloud save will be supported in the future.\r\n\r\n6. Recommand\r\n- People who want to battle with spaceship and sci-fi soldier.\r\n- People who want to play with missile, cannon and laser.\r\n- People who want to play turn-based battle or RTS(Real time strategy) game.\r\n- People who want to find PC quality game in mobile platform.\r\n- People who want to find a game with keyword like sci-fi, spaceship, squad, roguelike, fleet, turn-based, rts, space, singleplay, scenario, paid-game.\r\n\r\nWhat’s new:\r\n# Fixed App #\r\n- Fixed bug : Infinity mode research.\r\n\r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play.\r\nRequired Android O/S : 4.0+","torrent":{"xt":"urn:btih:636d504322e03c13fe76b23a052f45293d6766b1","amp;dn":"Star+Chindy+SciFi+Roguelike+v2.3.6+full","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"636d504322e03c13fe76b23a052f45293d6766b1","infoHashBuffer":{"type":"Buffer","data":[99,109,80,67,34,224,60,19,254,118,178,58,5,47,69,41,61,103,102,177]},"announce":[],"urlList":[]}}