{"title":"My Guantanamo Diary - Mahvish Rukhsana Khan","uid":13479881,"size":4170590,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:656d68b2467f3cd1a809d6d0e8d1131bfb82b894&amp;dn=My+Guantanamo+Diary+-+Mahvish+Rukhsana+Khan&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1455051781,"description":"Mahvish Khan is the only Afghan-American to walk into Guantanamo of her own accord. This unique book is her story, and the story of the men she grew to know uniquely well inside the cages of Guantanamo. Mahvish Khan is an American lawyer, born to immigrant Afghan parents. She was outraged that her country, the USA, seemed to have suspended its tradition of equality for all under the law with regard to those imprisoned at Guantanamo Bay in Cuba, and so she volunteered to translate for the lawyers - including British lawyer and founder of Reprieve Clive Stafford Smith - acting pro bono for the prisoners. Because she spoke their language, understood their customs and brought them Starbucks chai, the closest available drink to the kind of tea they would drink at home, they quickly befriended her, offering fatherly advice as well as a uniquely personal insight into their plight, and that of their families thousands of miles away at home. Some at Guantanamo are terrorists who deserve to be convicted and sentenced as such. Some are paediatricians and school teachers. We cannot tell the difference until we see them as individuals with their own unique stories. They deserve that much. No other writer has had access to the detainees. This book is a testament to their captivity. It documents the voices of men who have been tortured and held in a black hole of indefinite detention without legal recourse for years. It shows who they are and also allows readers to see that these men are more similar to us than they are different","torrent":{"xt":"urn:btih:656d68b2467f3cd1a809d6d0e8d1131bfb82b894","amp;dn":"My+Guantanamo+Diary+-+Mahvish+Rukhsana+Khan","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"656d68b2467f3cd1a809d6d0e8d1131bfb82b894","infoHashBuffer":{"type":"Buffer","data":[101,109,104,178,70,127,60,209,168,9,214,208,232,209,19,27,251,130,184,148]},"announce":[],"urlList":[]}}