{"title":"MenOnEdge--MoE-40098 Brandon Blake HD","uid":14478547,"size":1543439567,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:670b53c3584fd580d3a52021c81720e32274c647&amp;dn=MenOnEdge--MoE-40098+Brandon+Blake+HD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":1,"time":1461973412,"description":"Cancelled Birthday Party Becomes a Messy Edging Party\r\n\r\nApr 26, 2016 - Performers: Brandon Blake \r\n\r\n\r\nHD MP4 only.\r\n\r\n\r\nBranden Forrest waits at the bar to surprise Sebastian Keys for his birthday. As the night winds down, Sebastian never shows up, so Forrest starts flirting with the hot guy tending drinks, Brandon Blake. With nothing else to do for the night, Forrest offers to show Brandon offers a bigger tip if he demonstrate little thing or two about edging for the bartender. Brandon agrees and spreads his muscled arms across the bar, held down tight with ropes while Forrest strips his body. With a blindfold over his eyes. Brandon's senses are left to focus on the slightest sensations running down his cock as Forrest brings him to the edge of cumming. Forrest takes Brandon to the back of the bar and secures his torso from the ceiling. With no control over his body, Brandon twists against the ropes and pleads for an orgasm, but Forrest only intensifies the pleasure. He rocks Brandon's prostate with a dildo as Brandon swings in the air. Forrest ties Brandon back down to a table and gives Brandon a sensuous blowjob. Van finally arrives with Sebastian's cake -- but learning that Sebastian won't make it -- decides to put the cake to use. They spread the cake's creamy icing all over Brandon's body while he takes messy edge after messy edge. Brandon finally blows his load, the cum thickly garnishing the sticky mess all over his muscles. Van and Forrest won't let Brandon off so easily; at Brandon's first sigh of relief, they torment the stud with a wild tickling.\r\n\r\nScreens \nhttp://www.menonedge.com/site/shoot.jsp?shootId=40098\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttps://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:670b53c3584fd580d3a52021c81720e32274c647","amp;dn":"MenOnEdge--MoE-40098+Brandon+Blake+HD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"670b53c3584fd580d3a52021c81720e32274c647","infoHashBuffer":{"type":"Buffer","data":[103,11,83,195,88,79,213,128,211,165,32,33,200,23,32,227,34,116,198,71]},"announce":[],"urlList":[]}}