{"title":"Bio-Based Polymers and Composites","uid":14630950,"size":67381522,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:678b80ba8004f1a625671684409c77cbd56a60c3&amp;dn=Bio-Based+Polymers+and+Composites&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1463360637,"description":"Bio-Based Polymers and Composites - R. P. Wool, X. S. Sun (Elsevier, 2005).pdf\r\n\r\nISBN 0127639527\r\n\r\nBio-Based Polymers and Composites is the first book systematically describing the green engineering, chemistry and manufacture of biobased polymers and composites derived from plants.\r\n\r\nThis book gives a thorough introduction to bio-based material resources, availability, sustainability, biobased polymer formation, extraction and refining technologies, and the need for integrated research and multi-disciplinary working teams. It provides an in-depth description of adhesives, resins, plastics, and composites derived from plant oils, proteins, starches, and natural fibers in terms of structures, properties, manufacturing, and product performance. This is an excellent book for scientists, engineers, graduate students and industrial researchers in the field of bio-based materials.\r\n\r\n* First book describing the utilization of crops to make high performance plastics, adhesives, and composites\r\n* Interdisciplinary approach to the subject, integrating genetic engineering, plant science, food science, chemistry, physics, nano-technology, and composite manufacturing.\r\n* Explains how to make green materials at low cost from soyoil, proteins, starch, natural fibers, recycled newspapers, chicken feathers and waste agricultural by-products","torrent":{"xt":"urn:btih:678b80ba8004f1a625671684409c77cbd56a60c3","amp;dn":"Bio-Based+Polymers+and+Composites","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"678b80ba8004f1a625671684409c77cbd56a60c3","infoHashBuffer":{"type":"Buffer","data":[103,139,128,186,128,4,241,166,37,103,22,132,64,156,119,203,213,106,96,195]},"announce":[],"urlList":[]}}