{"title":"The-Laura-Ingraham-Show-Podcast  May 17 2016","uid":14640729,"size":33382106,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:68bb1fdfa3d87a67e7a134fe579c6c9f9d66a5e2&amp;dn=The-Laura-Ingraham-Show-Podcast++May+17+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1463518380,"description":"Laura Ingraham podcast May 17,2017\r\nMP3\r\n\r\nGuest Lineup\r\nJudge Richard Posner - Judge of the U.S Court of Appeals for the Seventh Circuit &amp; Senior Lecturer at the University of Chicago Law School\r\nRaymond Arroyo\r\nGov. Greg Abbott (R-TX)\r\n\r\nTrump closing gap with Clinton, poll shows\r\nDonald Trump is closing in on Hillary Clinton's narrow lead in a general election matchup, a new national poll released Tuesday finds. The NBC News/SurveyMonkey online tracking poll found that Clinton holds a 3-point lead over the presumptive GOP nominee. Last week, the same poll had Clinton ahead by 5 points.\r\n\r\n\r\n\r\n\r\n\r\nPoll: Dems want Sanders as Clinton's VP\r\nDemocratic voters want Hillary Clinton to make Bernie Sanders her running mate, according to a new poll. hirty-six percent say they'd like the Vermont senator to be Clinton's VP, a Rasmussen Reports survey released Tuesday found.\r\n\r\nWhile many Republicans inside Washington see House Speaker Paul Ryan as the leader of the Republican Party, voters see things differently.\r\n\r\nA majority of Republican and Republican-leaners who say they are registered to vote trust Donald Trump over Ryan to lead the GOP, according to results from the most recent election tracking poll.\r\n\r\nNearly six in 10 trust the presumptive Republican nominee to lead the Republican Party over the House speaker, while nearly four in 10 trust the speaker more.\r\n\r\n\r\n\r\n\r\n&quot;It's a suicide mission,&quot; said the Republican Party Chairman.\r\n\r\nReince Priebus was commenting on a Washington Post story about Mitt Romney and William Kristol's plot to recruit a third-party conservative candidate to sink Donald Trump.\r\n\r\nSeveral big-name Republican &quot;consultants&quot; and &quot;strategists&quot; are said to be on board. Understandably so, given the bucks involved.\r\n\r\nWith the kind of cash that sloshes around in a presidential campaign, there should be no shortage of super PAC parasites at the enlistment office.\r\n\r\n \nhttp://www.lauraingraham.com/","torrent":{"xt":"urn:btih:68bb1fdfa3d87a67e7a134fe579c6c9f9d66a5e2","amp;dn":"The-Laura-Ingraham-Show-Podcast++May+17+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68bb1fdfa3d87a67e7a134fe579c6c9f9d66a5e2","infoHashBuffer":{"type":"Buffer","data":[104,187,31,223,163,216,122,103,231,161,52,254,87,156,108,159,157,102,165,226]},"announce":[],"urlList":[]}}