{"title":"WebYoung - Diva, Jenny - Fantasies Come True HD 1080p","uid":13335863,"size":998936749,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:6ac9f3226a0e9845706fa740a4dfe419a5886ad0&amp;dn=WebYoung+-+Diva%2C+Jenny+-+Fantasies+Come+True+HD+1080p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ElitePorn","files":1,"time":1453987351,"description":"WebYoung - Diva, Jenny - Fantasies Come True HD 1080p\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\nDiva and Jenny have been best friends since primary school. Diva invited Jenny to come keep her company for the weekend while Diva's parents are out of town. Being typical teens they watch the most horrifying movie Diva can find. And of course, at the climax of the film's reign of terror, Diva spills her tea everywhere, and requires a moment to clean herself up. Jenny has always had a bit of a thing for Diva. In fact, you could call it a huge crush. Jenny thinks about Diva at home in bed while she's falling asleep. She dreams of the day she'll finally get to kiss her lifelong crush. But there's something bittersweet about living most of your young life with such a secret. Especially when you're led to believe that the other doesn't feel the same way. But, Diva is a smart girl.\r\n\r\nWhen Diva comes back to the couch in just a towel they begin caressing one another, and Jenny's fantasies have just begun to come true. They kiss gently at first, and then more passionately as they both realize what they've been missing all these years. Neither can believe that their fantasies have finally come true. Jenny sucks on Diva's tits, and then Jenny reveals her own for Diva's warm mouth. The passion in the room forces the heat to rise, as they continue to make out, as if they've never had a chance. Diva helps Jenny out of her dress, while kissing Jenny's soft supple breasts. After they heap themselves panty-clad across the couch, Jenny is already writhing under Diva's mouth, against her wet panties. A buildup of hundreds of fantasies about Diva has left Jenny hornier than she could ever have imagined. Diva doesn't hesitate to kiss and lick at Jenny's shaved pussy, using her fingers to help coax jenny slowly toward the orgasm of a lifetime. Diva eats at Jenny's pussy like a soft juicy peach in summer, and Jenny just can't handle it anymore. Jenny takes control, lying Diva back against the couch, and quickly finding a place between Diva's sacred legs. Having the chance to worship Diva for real, doesn't faze Jenny, as she inserts two fingers, and laps at Diva like she's always dreamed. In moments Diva is breathing heavier and letting squeaks and moans emanate from her diaphragm. Finally Jenny's precision g-spot fingering, and expert tongue have brought Diva close to bliss. Jenny places herself behind Diva, spooning her to get access to Diva's mouth. While kissing Jenny continues to finger Diva giving her the juicy orgasm of a lifetime.\r\n\r\nJenny Feeds Diva a taste of her own pussy, before climbing to mount Diva's face, so that Diva can use her warm expert mouth and tongue to lap at Jenny's tender enflamed pussy until her moans and breaths quicken and crescendo accelerating to the point where Jenny is in a version of heaven she created years ago while masturbating to this exact moment, which has finally, after years of fantasy come true.\r\n\r\nScreenshots:\r\n~~~~~~~~~~~~ \nhttp://picturescream.asia/soft/GAC\r\n \nhttp://picturescream.asia/soft/GAS\r\n \nhttp://picturescream.asia/soft/GAU\r\n \nhttp://picturescream.asia/soft/GAb\r\n \nhttp://picturescream.asia/soft/GAk\r\n\r\n\r\nVideos Info:\r\n~~~~~~~~~~~~\r\nSize: 952 MB\r\nDuration: 19:28 min \t\r\nResolution: 1920x1080\r\n\r\n\r\nShow Your Appreciation - BitCoin: 1JxUQqRrvGC6txChvaZEbqSSsq9wtswoto","torrent":{"xt":"urn:btih:6ac9f3226a0e9845706fa740a4dfe419a5886ad0","amp;dn":"WebYoung+-+Diva%2C+Jenny+-+Fantasies+Come+True+HD+1080p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ac9f3226a0e9845706fa740a4dfe419a5886ad0","infoHashBuffer":{"type":"Buffer","data":[106,201,243,34,106,14,152,69,112,111,167,64,164,223,228,25,165,136,106,208]},"announce":[],"urlList":[]}}