{"title":"True Anal (Mike Adriano, Evil Angel) 540p 2016","uid":13322368,"size":2893499323,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:6b06e3b3d3a4a2e2524b99333c52145c4531fc0e&amp;dn=True+Anal+%28Mike+Adriano%2C+Evil+Angel%29+540p+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"roflcopter2110","files":5,"time":1453872706,"description":"Anally obsessive director Mike Adriano uses his perverse imagination and giant cock to defile the mouths and assholes of beautiful, young porn starlets. Fans of nasty rectal gaping, ass-to-mouth sucking, hard, wet deep-throat blow jobs and lewd pools of drool can always get their fetish fixes in Mike's intense, POV-style gonzo sessions. 'True Anal' features a mess of this kind of action as some of the sexiest all-natural bitches in the industry get their buttholes rudely transformed! Amara Romani and 18-year-old Holly Hendrix share the director's enormous, throbbing member in an eye-watering double blow job and wicked threesome of rectal reaming and ass-to-mouth flavor. Gorgeous, sweet Mandy Muse spreads her plush, jiggling ass cheeks, bouncing her phat caboose on his thick pole. Petite, fishnet-clad Latina hoochie Vicki Chase slobbers and gags on Mike's meat. After he pumps her tight rectum, Vicki's gaping, hungry asshole consumes an entire cupcake! Exotic, racy beauty Jynx Maze takes a serious face fucking and rides Mike's shaft until her oiled-up sphincter gapes widely\r\n\r\nAmara Romani, Holly Hendrix, Mandy Muse, Vicki Chase, Jynx Maze\r\n\r\nVideo Quality: WEB-DL Video Format: MP4 Video codec: H.264 / AVC Audio Codec: AAC Video: MPEG4 Video (H264) 960x544 (16: 9) 29.97fps 1800 kbps Audio: AAC Stereo 44.1 KHz, 192 Kbps","torrent":{"xt":"urn:btih:6b06e3b3d3a4a2e2524b99333c52145c4531fc0e","amp;dn":"True+Anal+%28Mike+Adriano%2C+Evil+Angel%29+540p+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b06e3b3d3a4a2e2524b99333c52145c4531fc0e","infoHashBuffer":{"type":"Buffer","data":[107,6,227,179,211,164,162,226,82,75,153,51,60,82,20,92,69,49,252,14]},"announce":[],"urlList":[]}}