{"title":"Worlds.Sneakiest.Animals-3.Eps-w.subs--BBC-2016-720p","uid":13228373,"size":3175636317,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:6cd3ecdf02c19ff6bc3c25b2b0e6c1e2c66f6017&amp;dn=Worlds.Sneakiest.Animals-3.Eps-w.subs--BBC-2016-720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"uggauga","files":6,"time":1452901711,"description":"\nWorld's Sneakiest Animals\r\n\r\nBBC (2015/2016)\r\n\r\nChris Packham meets the animals using devious tactics and sneaky tricks to survive.\r\n \nhttp://www.bbc.co.uk/programmes/b06twzh9\r\n_______________________________________\r\n\r\n1280x720 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!\r\n_______________________________________\r\n\r\nStaying Alive\r\nEpisode 1 of 3\r\nChris Packham meets the animals using devious tactics and sneaky tricks to survive. New, groundbreaking science reveals astonishing visual trickery, from illusionist zebras to vanishing geckos and shape-shifting cuttlefish. Meet the mischievous mimics, from snakes to baby birds disguised as caterpillars, and a lioness who looks like a male lion. The world's ultimate con artists rely on sneaky strategies, even against their own kind - meet the monkey that cheats its own family and the lizard that fakes its own death. These animals really will do everything it takes to stay alive.\r\n\r\nThe Hunger Game\r\nEpisode 2 of 3\r\nChris Packham meets a host of animals that use deceptive tactics to find food. New science reveals that some trick their prey, like the manipulative mantis that looks like a flower, and killer whales that set traps using sound.\r\nOthers cheat each other - sea otters demand ransoms after kidnapping each other's pups. And in our parks, grey squirrels are at war - stealing raids can only be foiled by a devious sleight of hand.\r\nSome fool other species for food - meet the drongo, an African bird running a false protection racket, and monkeys who steal valuables from humans and then barter for their return. These animal liars, cheats and hustlers really will stop at nothing to get a meal.\r\n\r\nSex, Lies and Dirty Tricks\r\nEpisode 3 of 3\r\nChris Packham meets a host of animals using devious tactics to win a mate and raise a family.\r\nNew science reveals bower birds and fiddler crabs using optical illusions to impress a female, whilst a male topi antelope fakes danger to give him an edge. Meet cross-dressing cuttlefish and marsh harriers as they sneak past dominant males to mate incognito.\r\nAnimal family life is no more honest, with chicks blackmailing their own parents and the honeyguide bird duping another species into raising its chick. It is sex, lies and families faking it in the world of sneaky animals - they really will stop at nothing to succeed","torrent":{"xt":"urn:btih:6cd3ecdf02c19ff6bc3c25b2b0e6c1e2c66f6017","amp;dn":"Worlds.Sneakiest.Animals-3.Eps-w.subs--BBC-2016-720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cd3ecdf02c19ff6bc3c25b2b0e6c1e2c66f6017","infoHashBuffer":{"type":"Buffer","data":[108,211,236,223,2,193,159,246,188,60,37,178,176,230,193,226,198,111,96,23]},"announce":[],"urlList":[]}}