{"title":"Canada - A People's History","uid":13475119,"size":11302779193,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:74465767f39ac78edf3442d7e1e66be623ffe870&amp;dn=Canada+-+A+People%27s+History&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"7436746","files":18,"time":1455000769,"description":"http://www.imdb.com/title/tt0264228/\r\n\r\nA dramatized comprehensive survey of the history of Canada.\r\n \nhttp://www.wikiwand.com/en/Canada:_A_People%27s_History\r\n\r\nCanada: A People's History is a 17-episode, 32-hour documentary television series on the history of Canada. It first aired on CBC Television from October 2000 to November 2001. The production was an unusually large project for the national network, especially during budget cutbacks. The unexpected success of the series actually led to increased government funding for the CBC. It was also an unusual collaboration with the French arm of the network, which traditionally had autonomous production. The full run of the episodes was produced in English and French. The series title in French was Le Canada: Une histoire populaire. In 2004, OMNI.1 and OMNI.2 began airing multicultural versions, in Chinese, Greek, Hindi, Italian, Polish, Portuguese, and Russian.\r\n\r\nThe producers intended to make this a dramatic history of the Canadian people; as much as possible, the story was told through the words of the people involved, from great leaders and explorers to everyday people of the land at the time. The documentary makes effective use of visuals, transitions, and dramatic music from or evocative of the eras being covered. In the first season, actors representing historical figures spoke their words, while later seasons used voiceovers over photographic images and film or, when available, original recordings of the subject","torrent":{"xt":"urn:btih:74465767f39ac78edf3442d7e1e66be623ffe870","amp;dn":"Canada+-+A+People%27s+History","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74465767f39ac78edf3442d7e1e66be623ffe870","infoHashBuffer":{"type":"Buffer","data":[116,70,87,103,243,154,199,142,223,52,66,215,225,230,107,230,35,255,232,112]},"announce":[],"urlList":[]}}