{"title":"Brian McDone Mystery Series - Bryan Casey","uid":13337167,"size":1064889,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7539d667934c8f653d2d89444407332877429378&amp;dn=Brian+McDone+Mystery+Series+-+Bryan+Casey&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":9,"time":1453996081,"description":"01. Dying Eyes [Brian McDone Mystery, #1] - Ryan Casey\r\n\r\nimage\r\n\r\nWhat secrets hide behind dying eyes?\r\n\r\nWith the Christmas and New Year chaos out of the way, it's time for the Preston Police Department to put their feet up and return to normality.\r\n\r\nBut for Detective Brian McDone, there is no respite from the frenzy. An unidentified young woman is found brutally murdered in a seedy section of the city, her body laced with bruises, her sharp fingernails digging into her palms. Her eyes are staring up at something in pure fear.\r\n\r\nNobody knows who she is.\r\n\r\nAs Brian and his team begin to piece together the clues, the answers lead him to places he would least expect. The further Brian digs, one question soon becomes apparent: who can he trust? The answer, it seems, may be life-threatening.\r\n\r\nThe first in a new police procedural series from British author Ryan Casey, Dying Eyes is a dark urban detective mystery packed with suspense, and a twisting, turning plot sure to please fans of crime thrillers.\r\n\r\n&quot;With twists and turns aplenty, the story is both riveting and horrifying, and it is well-worth reading and re-reading.&quot; - T.A. Dean\r\n\r\n\r\n\r\n02. Buried Slaughter [Brian McDone Mystery, #2] - Ryan Casey\r\n\r\nimage\r\n\r\nSome secrets are better left undiscovered.\r\n\r\nTwo years after the shocking events of the Nicola Watson case, Brian McDone's life is finally back on track. He's working in the lower ranks of the police department, but his personal life and mental stability are stronger and more important to him than ever.\r\n\r\nThat is until news breaks of a series of brutal, ritualistic murders in the idyllic Lancashire countryside. Seven bodies are found, decapitated, bones stripped of flesh, heads piled on top of one another. The police are clueless. Brian is intrigued. Too intrigued.\r\n\r\nAs Brian grows obsessed with the case, he finds himself drawn out of his peaceful life and into the dangerous depths of the investigation. In a race against time, Brian must put all he cares about on the line, as he faces a ruthless, cunning and methodical serial killer who isn't afraid to make things personal.\r\n\r\nThe second in the crime thriller series from author Ryan Casey, Buried Slaughter is a dark detective mystery with complex characters and a twisting, thrilling plot.\r\n\r\n\r\n\r\n03. Nameless Kill [Brian McDone Mystery, #3] - Ryan Casey\r\n\r\nimage\r\n\r\nA shocking murder. A terrifying secret...\r\n\r\nBrian McDone is ready for a break. He's exhausted in his new Detective Inspector role, worried about his distant work partner, and he keeps on getting irritating pains in his chest. All he needs is a holiday.\r\n\r\nBut the killers of Preston have other ideas. A dead girl is found face down in a stream with her hands and ankles bound. Creepy antlers and disturbing clothing cling to her head, as flies swarm her naked skin.\r\n\r\nNobody knows her name.\r\n\r\nAs Detective Inspector Brian McDone digs deeper into the harrowing mystery, he discovers a sequence of shocking and horrifying revelations and secrets. Secrets that don't just threaten the lives of others, but the life of McDone himself.\r\n\r\nThe third book in the Brian McDone crime thriller series from author Ryan Casey, Nameless Kill is a mystery full of dark drama and edge-of-your-seat suspense. If you enjoy gritty British crime thrillers and complex characters, then Nameless Kill will be right up your street","torrent":{"xt":"urn:btih:7539d667934c8f653d2d89444407332877429378","amp;dn":"Brian+McDone+Mystery+Series+-+Bryan+Casey","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7539d667934c8f653d2d89444407332877429378","infoHashBuffer":{"type":"Buffer","data":[117,57,214,103,147,76,143,101,61,45,137,68,68,7,51,40,119,66,147,120]},"announce":[],"urlList":[]}}