{"title":"Asspirations #3.mp4","uid":14452598,"size":3454053126,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:75834ee402fb32832f1deba5bb774efd59fed791&amp;dn=Asspirations+%233.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Programsmith","files":1,"time":1461764245,"description":"Gallery and Description:\r\n \nhttp://naughtygate.net/img-5720a42354cce.html\r\n\r\n \nhttp://naughtygate.net/img-5720a4235b578.html\r\n\r\n\r\nProduction year: 2016\r\nCountry: USA\r\nGenre: Anal, Big Butt, Facial, BJ, Threesome, Outdoor, Gonzo\r\nDuration: 4:25:02\r\nEnglish language\r\n\r\nStudio: Brazzers\r\n\r\nStarring: Gracie Glam, AJ Applegate, Savannah Fox, Franceska Jaimes, London Keyes, Missy Martinez, Syren De Mer.\r\n\r\nDescription: Franceska Jaimes has one of the nicest asses on the planet. So who better to pound that juicy booty into the next century than the wild man himself Nacho Vidal. Nacho covers her juicy curves with oil and fingers her wet pussy until she's squirting all over the place! Last time on Filthy Fuck, Jordan Ash and his girlfriend AJ decided to try out having a threesome, and now that blonde bombshell AJ Applegate has had a chance to test out sexy slut Savannah fox for herself, it's finally time for her boyfriend Jordan Ash to get the threesome of his dreams! Gracie Glam is a slutty schoolgirl. She hikes up her skimpy little plaid skirt to show off her juicy butt, and goes on a hunt for the biggest cock she can find after class. This time, Keiran Lee shows up packing a fat cock and a bottle full of oil, ready to get the party started. Syren De Mer is one of the horniest MILF. She is so damn cock crazy that one dick is not enough to satisfy her. In fact, not even two cocks can please this busty babe. That's why we sent Jessy Jones, Danny D, and Clover over to give her a heaping helping of man meat deep in every one of her holes. No one makes their phat booties clap like Missy Martinez, so we invited her out to get fucked hard by Mick Blue's big fat cock. She started out with a sexy striptease, once his dick was rock hard, Missy dropped to her knees to suck that big dick, and then take it all the way to the base in her tight little asshole.\r\n\r\nVideo quality: DVDRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 720x404 29.97fps 1606kbps\r\nAudio: AAC 48000Hz stereo 126kbps","torrent":{"xt":"urn:btih:75834ee402fb32832f1deba5bb774efd59fed791","amp;dn":"Asspirations+%233.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75834ee402fb32832f1deba5bb774efd59fed791","infoHashBuffer":{"type":"Buffer","data":[117,131,78,228,2,251,50,131,47,29,235,165,187,119,78,253,89,254,215,145]},"announce":[],"urlList":[]}}