{"title":"THE WALKING DEAD: NO MANS LAND","uid":13463041,"size":26877141,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:75b32f267f77f19f8a7fc1b7510346d61181ef1b&amp;dn=THE+WALKING+DEAD%3A+NO+MANS+LAND&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"iammadhav","files":1,"time":1454900165,"description":"The Walking Dead meets XCOM in fantastic new game tied to AMC show .\r\n\r\nStay human and survive in the official game of AMC's The Walking Dead.\r\n\r\nStrike the walking dead , flesh hungry walkers with Daryl Dixon. Do you have what it takes to stay alive and kill?\r\n\r\nThe Walking Dead: No Mans Land is a thrilling, action buster RPG game where tactical choices and skills make a difference between life and death .The one and only super, Daryl Dixon, will teach you how to kill and survive but do not forget ,in the end you are on your own.\r\n\r\nFIGHT through hordes of walkers and kill the bonies in tactical turn-based bloody killing.\r\n\r\nTRAIN your surviver group for killings.\r\n\r\nUPGRADE your weapon to the most powerful rocket launchers and guns.\r\n\r\nCHOOSE who lives and who dies after all you've been trained to lead and kill and keep your people safe.\r\n\r\nHUNT walkers and bonies in terminus,prisons,buildings and other familiar locations from AMC's the walking dead .\r\n\r\nJOIN other players in deadly weekly challenges for exclusive rewards.\r\n\r\n&quot;Throw in some pretty swish graphics , never seen before animations and blood splatters and you have one of the best and most carefully fleshed out zombie games ever you or anyone would play on mobile .It looks magnificent and plays great too.&quot;-Pocketgamer\r\n\r\n&quot;Each aspect of survival on AMC's the walking dead has been parallel to the series official mobile game, subtitled no mans land .&quot;-Mashable\r\n\r\n&quot;Imagine your favourite mobile base-building strategy game, mix in a dash of XCOM, and then paint on a fresh coat of AMC's The Walking Dead.&quot;-Gamezebo\r\n\r\nWhat are you waiting now ? you've got the best killing , zombie game right here go on and download it right away to experience the powerful THE WALKING DEAD: NO MANS LAND","torrent":{"xt":"urn:btih:75b32f267f77f19f8a7fc1b7510346d61181ef1b","amp;dn":"THE+WALKING+DEAD%3A+NO+MANS+LAND","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75b32f267f77f19f8a7fc1b7510346d61181ef1b","infoHashBuffer":{"type":"Buffer","data":[117,179,47,38,127,119,241,159,138,127,193,183,81,3,70,214,17,129,239,27]},"announce":[],"urlList":[]}}