{"title":"Formula1.2016.Russian.Grand.Prix.Qualifying.720p.HDTV.x264","uid":14491974,"size":4350491949,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:7615880eec5aca44b065380812ba706d16b2fb8c&amp;dn=Formula1.2016.Russian.Grand.Prix.Qualifying.720p.HDTV.x264&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MaxPowah","files":2,"time":1462110031,"description":"Sochi\r\n\r\n\r\nThe Sochi circuit, located in the Black Sea resort of the same name, is the first purpose-built Formula One facility in Russia and hosted the country's inaugural Grand Prix in October 2014, in the same year that the city also stages the Winter Olympics. \r\n\r\nSochi's Formula One relationship formally began in October 2010, when an agreement to host a Grand Prix was signed between race promoters OJSC Center Omega and the Formula One group of companies, with the support of the Russian government and in the presence of Vladimir Putin.\r\n\r\nConstruction of the 5.848-kilometre, 55,000-capacity circuit came under the design supervision of renowned architect Hermann Tilke. The track is integrated into the Olympic Park infrastructure, with facilities located in close vicinity to the Olympic Park railway station and to the roads which connect the Olympic venues with Sochi International Airport.\r\n\r\nThe track width varies from 13 metres at its narrowest point to 15 metres at the start-finish line. The circuit, which runs in a clockwise direction, consists of 12 right- and six left-hand corners, and combines both high-speed and technical sections. On their first visit to the track, Formula One cars reached 332 km/h on the 650-metre straight between the first and second turns, with Lewis Hamilton averaging 213 km/h as he claimed pole for Mercedes","torrent":{"xt":"urn:btih:7615880eec5aca44b065380812ba706d16b2fb8c","amp;dn":"Formula1.2016.Russian.Grand.Prix.Qualifying.720p.HDTV.x264","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7615880eec5aca44b065380812ba706d16b2fb8c","infoHashBuffer":{"type":"Buffer","data":[118,21,136,14,236,90,202,68,176,101,56,8,18,186,112,109,22,178,251,140]},"announce":[],"urlList":[]}}