{"title":"La Regina Delle Nevi (1957), [H264 - Ita Aac]- 1' doppiaggio ori","uid":13237994,"size":250751064,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7899aca3efc1cf4303aebb5981a1af0a86bbe2d8&amp;dn=La+Regina+Delle+Nevi+%281957%29%2C+%5BH264+-+Ita+Aac%5D-+1%27+doppiaggio+ori&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"foll01","files":1,"time":1453030417,"description":"La Regina Delle Nevi (1957), [H264 - Ita Aac]- 1' doppiaggio originale -versione estesa- \r\n\r\nTRAMA\r\n\r\nGerda e Kai sono due bambini, vicini di casa ed amici per la pelle; però, durante una tempesta di neve, il piccolo Kai viene colpito da una scheggia di ghiaccio che porta in sé una maledizione. Il maleficio, opera della leggendaria e maligna Regina delle nevi, gela il cuore di Kai, rendendolo a tratti cattivo ed insensibile; a peggiorare la situazione, la Regina rapisce il bambino e lo conduce nel suo irraggiungibile palazzo di ghiaccio. Gerda, convinta di poter salvare il suo amichetto, decide di partire per raggiungerlo, pur sapendo che più passa il tempo e più la maledizione si impadronirà di Kai. Ma il viaggio è lungo e tortuoso; per poter arrivare fino alla dimora della Regina, Gerda è costretta a vagare tra luoghi impervi e inospitali, arrivando ad affrontare un ostacolo dietro l'altro, riuscendo però, grazie alla sua forza di volontà e all'aiuto di altre persone, a raggiungere il palazzo di ghiaccio. È talmente grande la bontà d'animo di Gerda che la Regina, mossa a compassione, libera Kai dalla maledizione e lo lascia libero di tornare a casa insieme alla sua amica.\r\nIl primo doppiaggio italiano del film venne eseguito dall'ARS presso la SID e diretto da Anton Giulio Majano su dialoghi di Renato Cominetti.\r\nIl film venne ridoppiato alla fine degli anni ottanta per l'uscita in VHS. Il nuovo doppiaggio venne eseguito presso la Cinefonico Dodi e diretto da Rosalba Oletta.\r\nL'edizione DVD del film include invece un ulteriore doppiaggio, eseguito originariamente alla fine degli anni novanta per la serie TV americana Storie della mia infanzia (trasmessa in Italia su RaiSat Ragazzi), che includeva il film diviso in tre episodi. Tuttavia il film venne incluso nella serie con diversi tagli e una differente colonna sonora (il DVD dura infatti 50 minuti). Il doppiaggio venne eseguito dalla D4 e diretto da Luigi Brunamonti su dialoghi di Rino Bolognesi. \r\n\r\nRELEASE ORIGINAL FOR MORE INFO\r\n \nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=430046","torrent":{"xt":"urn:btih:7899aca3efc1cf4303aebb5981a1af0a86bbe2d8","amp;dn":"La+Regina+Delle+Nevi+%281957%29%2C+%5BH264+-+Ita+Aac%5D-+1%27+doppiaggio+ori","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7899aca3efc1cf4303aebb5981a1af0a86bbe2d8","infoHashBuffer":{"type":"Buffer","data":[120,153,172,163,239,193,207,67,3,174,187,89,129,161,175,10,134,187,226,216]},"announce":[],"urlList":[]}}