{"title":"Oil Spill Impacts - Taxonomic and Ontological Approaches","uid":14638248,"size":17729114,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b91283fd0ccd436e3e8cf83754dbaf36d05cb36&amp;dn=Oil+Spill+Impacts+-+Taxonomic+and+Ontological+Approaches&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1463482448,"description":"Oil Spill Impacts - Taxonomic and Ontological Approaches - Yejun Wu (CRC, 2016).pdf\r\n\r\nISBN 978-1-4987-1215-6\r\n\r\nStarting with the 2010 Gulf of Mexico Deepwater Horizon oil spill incident, Oil Spill Impacts: Taxonomic and Ontological Approaches chronicles a timeline of events that focus on the impact of oil spills and provides an understanding of these incidents using a number of approaches. The book includes an interdisciplinary oil spill taxonomy, an oil spill topic map, and highlights information–organization tools, such as indexes, taxonomies, and topic maps that can be used to connect information resources with concepts of interest.\r\n\r\nThe topic map combines the function of ontology with the function of organized information resources, and contains thousands of concepts and their relationships extracted from approximately 300 documents stemming from various academic conference presentations, journal articles, news reports, and web pages.\r\n\r\nDivided into four parts, the book begins with a brief introduction of the Gulf of Mexico Deepwater Horizon oil spill events followed by a breakdown of the taxonomy concepts distributed into categories and their subcategories. The book then describes the oil spill topic map separated by concepts, relationships, and references.\r\n\r\nThis interdisciplinary reference provides to its readers:\r\n\r\nThe perspective of multiple disciplines instead of just one discipline\r\nAn indication of the most important topics in the oil spill domain\r\nDeveloped research in the oil spill and oil drilling areas\r\nA broad and detailed view of oil spill issues\r\n\r\nThe book serves students, teachers, and researchers interested in oil spill issues, oil spill incidents, and addresses their impacts that involve coastal and marine environmental sciences, biological sciences, chemistry, disaster management, geology, sociology, and government policy","torrent":{"xt":"urn:btih:7b91283fd0ccd436e3e8cf83754dbaf36d05cb36","amp;dn":"Oil+Spill+Impacts+-+Taxonomic+and+Ontological+Approaches","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b91283fd0ccd436e3e8cf83754dbaf36d05cb36","infoHashBuffer":{"type":"Buffer","data":[123,145,40,63,208,204,212,54,227,232,207,131,117,77,186,243,109,5,203,54]},"announce":[],"urlList":[]}}