{"title":"Rush Limbaugh - May 12, 2016 Full Podcast.mp3","uid":14608490,"size":100965248,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7b9b9d83050105541f4150829214144f54efb285&amp;dn=Rush+Limbaugh+-+May+12%2C+2016+Full+Podcast.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1463114175,"description":"Rush Limbaugh - May 12, 2016 Full Podcast\r\n\r\n\r\nOn Thursday, Mark sat in the Attila the Hun Chair at EIB Northern Command. Check out Mark's Stack for links, audio clips and more. Rush returns for Open Line Friday!\r\n\r\n&quot;There's no way to make everybody happy. Everybody's got a different point of view.&quot; \r\n\r\n-Mark Belling\r\n\r\nJoint Statement from Ryan and Trump on Unity \r\n\r\n&quot;What the people critical of Trump have to realize, and I'm one of them, is that there is something about Donald Trump's message that deeply resonated with millions and millions of Americans. That slogan he has, it's the best slogan that I've seen a politician come up with, maybe ever. Make America Great Again. There's so much in there. It implies that right now we're not great. And I think whether you support Trump or oppose Trump, if you're a conservative, you have to agree with that.&quot; - Mark Belling \r\n\r\nStar Parker of CURE on Civil Rights:\r\n\r\n&quot;When you consider the struggles and problems that African Americans faced in this country, not allowed to vote, prior to that being enslaved, being sent to lousy schools in the South, when you try to say that that is on the same level as somebody who is describing themselves as being of a new gender not being able to use the bathroom, it's an indication that we're a country that has really, really gone off the beam.&quot; - Mark Belling\r\n\r\n \r\n\r\n\r\nTrump and Middle Class America:\r\n\r\nThe fact is that seven-and-a-half years into the Obama presidency we seem to, if anything, be headed toward a new recession. Retail sales appear to be plummeting. That ought to be on the left. I don't know if Trump's the right vehicle to tap into it, and I don't know that Trump is offering any solutions to it. But he's hit on something that's out there. That there are a lot more people struggling, I think, than maybe most of us are aware of.&quot; - Mark Belling\r\n \nhttp://www.rushlimbaugh.com/daily/2016/05/12/guest_host_mark_belling\r\n \nhttp://www.rushlimbaugh.com/","torrent":{"xt":"urn:btih:7b9b9d83050105541f4150829214144f54efb285","amp;dn":"Rush+Limbaugh+-+May+12%2C+2016+Full+Podcast.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b9b9d83050105541f4150829214144f54efb285","infoHashBuffer":{"type":"Buffer","data":[123,155,157,131,5,1,5,84,31,65,80,130,146,20,20,79,84,239,178,133]},"announce":[],"urlList":[]}}