{"title":"Road Runner &amp; Wile E Coyote S01e07-10 + sigla ROTHEANIMAL","uid":13238264,"size":438700504,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7c4278e714a400d3868b1f2fd738f9748970660a&amp;dn=Road+Runner+%26amp%3B+Wile+E+Coyote+S01e07-10+%2B+sigla+ROTHEANIMAL&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"foll01","files":5,"time":1453032341,"description":"Road Runner &amp; Wile E Coyote S01e07-10 + sigla, [TVrip - DivX - Ita Mp3] By-Rotheanimal\r\n\r\nTRAMA\r\n\r\n.:Wile E. Coyote e Road Runner sono i due personaggi animati creati da Chuck Jones nel 1948 per la Warner Bros.\r\n\r\nWile E. Coyote (conosciuto in Italia anche come Vilcoyote o Vile il Coyote e spesso chiamato erroneamente Willy o Willie a causa dell'assonanza col nome originale) e il Road Runner (Beep Beep o Bip Bip) sono personaggi delle serie Looney Tunes e Merrie Melodies della Warner Bros prodotte a partire dagli anni quaranta. Il primo cartoon dedicato esclusivamente ai due personaggi risale al 1949 con l'episodio Fast and Furry-ous.\r\n\r\nIl Coyote è impegnato nel maniacale, e mai fruttuoso, inseguimento del Road Runner; molti credono che si tratti di uno struzzo (tanto che nei vecchi doppiaggi italiani e fumetti veniva chiamato Bip-Bip lo struzzo corridore), in realtà si tratta di un uccello dei deserti americani il cui nome scientifico è Geococcyx californianus, appartenente alla famiglia dei cuculidi e chiamato volgarmente Roadrunner (corridore della strada).\r\n\r\nIl Road Runner è la preda agognata da Wile E. Coyote: famoso per la sua rapidità, nonostante gli innumerevoli e sempre più ingegnosi tentativi di cattura riesce puntualmente a sfuggire, in modo anche irridente, al suo cacciatore. Le sfide fra i due protagonisti si risolvono, quindi, sempre a favore del velocissimo e astuto pennuto dai colori sgargianti.\r\n\r\nIl cartone è ambientato nelle gole della Monument Valley dove Wile E. Coyote sperimenta di tutto per catturare Beep Beep, servendosi molto spesso di strani arnesi, regolarmente difettosi o d'uso impossibile, forniti dalla ACME Inc., azienda fittizia ideata dal regista Chuck Jones e che, nei disegni animati dei Looney Tunes fornisce strambe attrezzature di alta tecnologia sia a Wile E. Coyote che ad altri personaggi.\r\n\r\nPuntualmente il coyote cade vittima del suo stesso ingegno e, spesso, le sue avventure si concludono con l'inevitabile volo in una gola del canyon oppure con l'investimento del malcapitato da parte di un treno o di un camion. Riesce a catturare l'odiato nemico nell'ultimo episodio, anche se una vistosa differenza d'altezza (Wile minuscolo contro un enorme Beep Beep) lascerà capire che le avventure non sono ancora finite.\r\n\r\nLe modalità di espressione dei due personaggi sono estremamente semplici: il Road Runner emette solo il suono &quot;bii-bip&quot;, mentre il coyote si esprime con cartelli estemporanei.:.\r\n\r\nRELEASE ORIGINAL FOR MORE INFO\r\n \nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=455327","torrent":{"xt":"urn:btih:7c4278e714a400d3868b1f2fd738f9748970660a","amp;dn":"Road+Runner+%26amp%3B+Wile+E+Coyote+S01e07-10+%2B+sigla+ROTHEANIMAL","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c4278e714a400d3868b1f2fd738f9748970660a","infoHashBuffer":{"type":"Buffer","data":[124,66,120,231,20,164,0,211,134,139,31,47,215,56,249,116,137,112,102,10]},"announce":[],"urlList":[]}}