{"title":"Battlestar Galactica fanedit Finale Chronological 1080p 6ch x265","uid":13449263,"size":2191875546,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:7e3d2873e02c40ee7e976e05412d25e3a61229e2&amp;dn=Battlestar+Galactica+fanedit+Finale+Chronological+1080p+6ch+x265&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bsg4you","files":5,"time":1454782079,"description":"Battlestar.Galactica.fanedit.Finale.Chronological.1080p.6ch.x265.HEVC\r\n  http://www.imdb.com/title/tt0993920/  \r\n\r\nBattlestar.Galactica.fanedit.Daybreak1.Before.The.Fall.1080p.6ch.x265.HEVC.mkv\r\nBattlestar.Galactica.fanedit.Daybreak2.Battle.Of.The.Colony.1080p.6ch.x265.HEVC.mkv\r\n\r\nTHIS TORRENT USES X265 HEVC (High Efficiency Video Coding) VIDEO\r\nPLEASE USE A PLAYER THAT SUPPORTS X265 HEVC VIDEO LIKE VLC, POTPLAYER, ETC\r\n\r\nTHIS SHARE IS A FANEDIT OF THE 2009 BATTLESTAR GALACTICA FINALE\r\nONE PART HAS THE CAPRICA FLASHBACKS AND THE OTHER HAS THE FINAL BATTLE\r\nPART1 HAS SOME 360P DELETED SCENES MIXED WITH THE 1080P MATERIAL\r\n\r\nBattlestar Galactica Daybreak Part1 Before The Fall fanedit\r\nversion3 50min03sec Handbrake0.10.2.7286 698,782,931bytes\r\nvideo: 1920x1080 HEVC crf=24.50 preset=medium (video ~1603Kbps)\r\naudio: 6-channel surround HE-AAC 256Kbps\r\n\r\nBattlestar Galactica Daybreak Part2 Battle Of The Colony fanedit\r\nversion3 1hr47min57sec Handbrake0.10.2.7286 1,492,974,781bytes\r\nvideo: 1920x1080 HEVC crf=25.00 preset=medium (video ~1585Kbps)\r\naudio: 6-channel surround HE-AAC 256Kbps\r\n\r\nThis is a x265 HEVC video, HE-AAC audio encode of the fanedits of the Battlestar Galactica finale s4e19 Daybreak, the 150 minute extended Blu-Ray version.\r\n\r\nThe 2 parts of the fanedit are Daybreak Part1 Before The Fall and Daybreak Part2 Battle Of The Colony. Before The Fall has all the flashbacks in s4e19 Daybreak from about 2 years before the fall of the Twelve Colonies right up to the mini-series Night. Before The Fall also includes s4e19 Daybreak, Night Part1 mini-series, and The Plan deleted scenes. The Battle Of The Colony is made up from the non-flashback portions of s4e19 Daybreak.\r\n\r\nDaybreak Part1 Before The Fall:\r\n* s4e19 Daybreak (150 minute extended Blu-Ray version), flashbacks\r\n* s4e19 Daybreak, 360p deleted scene flashbacks\r\n* s0e01 Night1 mini-series, 360p deleted scenes before the fall of the Twelve Colonies\r\n* s5e00 The Plan, one scene that was supposed to be a Daybreak flashback\r\n\r\nDaybreak Part1 Before The Fall scenes are collected and ordered by character:\r\n00.00-10.05 Laura Roslin\r\n\r\n10.06-20.40 Kara &quot;Starbuck&quot; Thrace and Lee &quot;Apollo&quot; Adama\r\n\r\n20.41-22.11 Sam Anders\r\n\r\n22.12-29.39 William Adama, Saul Tigh and Ellen Tigh\r\n* the scene with Ellen arriving at the bar was last in the broadcast but is placed when it happened\r\n\r\n29.40-30.22 Tory Foster and John Cavil with Boomer very briefly at the start\r\n\r\n30.23-38.47 Sharon &quot;Boomer&quot; Valerii, Galen Tyrol, Karl &quot;Helo&quot; Agathon and Cally Henderson\r\n* the Boomer and Gina Six clip is from the movie The Plan though it was originally shot as a flashback for s4e19 Daybreak\r\n* Boomer landing hard is a deleted scene from the mini-series, s0e01 Night; some blue screen is visible though unfinished special effects were removed\r\n* The Boomer and Chief &quot;I'm a very bad pilot&quot; scene is also from the mini-series and was included since it occurred during the s4e19 Daybreak flashbacks\r\n\r\n38.48-50.03 Gaius Baltar and Caprica Six\r\n* the last scene has the last 25 seconds of &quot;The Shape Of Things To Come&quot; added on at the end\r\n\r\nDaybreak Part2 Battle Of The Colony:\r\n* There are no s4e19 Daybreak deleted scenes that are not flashbacks so Battle Of The Colony is all 1080p.\r\n\r\nDaybreak Part2 Battle Of The Colony has 3 other changes in addition to removing the flashbacks:\r\n1) Removed 3 pieces of Starbuck dialog just before and during the climactic confrontation between Athena and Boomer:\r\n* &quot;Company let's move!&quot; 2.5 seconds\r\n* &quot;All right, this is really touching, can we get the hell out of here?&quot; 2.5 seconds\r\n* &quot;Eh, can we not tell her the plan?&quot; 1.5 seconds\r\n\r\n2) Removed the following 3 clips from the very end of s4e19 Daybreak:\r\n* The robot montage with Jimi's Watchtower playing, 35 seconds\r\n* Head Six and Head Baltar walking away on the busy city side walk, 12.5 seconds\r\n* The credits, 4.25 minutes\r\n\r\n3) Added a new ending that starts just after Head Baltar says &quot;silly me ... silly, silly me&quot;:\r\n* A 7 minute montage of upbeat clips set to Jimi Hendrix's version of All Along the Watchtower\r\n\r\nPlease check out other releases of Battlestar Galactica, Gotham, MST3K, Rifftrax, DC Comics, documentaries, Star Trek Enterprise and more at:\r\n  https://thepiratebay.se/user/bsg4you/  \r\n  https://kat.cr/user/bsg4you/uploads/  \r\nand leave any corrections, criticism, comments and requests.\r\n\r\nThanks, bsg4you","torrent":{"xt":"urn:btih:7e3d2873e02c40ee7e976e05412d25e3a61229e2","amp;dn":"Battlestar+Galactica+fanedit+Finale+Chronological+1080p+6ch+x265","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e3d2873e02c40ee7e976e05412d25e3a61229e2","infoHashBuffer":{"type":"Buffer","data":[126,61,40,115,224,44,64,238,126,151,110,5,65,45,37,227,166,18,41,226]},"announce":[],"urlList":[]}}