{"title":"LesbianPickups 001 - Saskia 1080p","uid":14633480,"size":1543999944,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:7f68cbfa31cef51f59cf6f33e11ce6d87e40e9c5&amp;dn=LesbianPickups+001+-+Saskia+1080p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"distinc","files":2,"time":1463397270,"description":"...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=5958550037\r\n \nhttp://imagedisco.net/?g=1758911186\r\n\r\nPlot:\r\n\r\nHey guys &amp; girls and welcome to my brand new site Lesbian pickups! I always dreamed of making site like this one and now my wish has finally became a reality! Girls are my passion and since I am also of the faire gender, I dare say I know how to make them leave satisfied. When my friend from Bitch Stop (not very flattering name, but OK…) showed me his dream job, I knew I must do exactly the same thing. And it was easy – all I had to do was grab a camera and head into the streets, picking up any girl I want. Of course you need that little special feel for it – you can’t just pick any girl at random and hope she will put out. You have to think and look for signs that girl may enjoy a little bit of harmless lesbian fun. Even then you strike out a lot no matter how good you look (and I dare say I’m pretty hot), because some girls will play hard to get. My first catch, however, did not. This smoking hot brunette I noticed sitting on nearby town square seemed very lonely and confused, so I took my shot. She told me she was looking for job, but could not find anything, so I offered her something else completely. I just couldn’t do it any more subtle, because looking at her amazing body and sexy face I just wanted to see her naked and on all four. She took it surprisingly well and soon enough I already fondled her wonderful breasts. Then I took her to my place and you can imagine what followed. But I have something better for you, than just your imagination – I can show you everything in my video! Have fun and I hope to see you next time!","torrent":{"xt":"urn:btih:7f68cbfa31cef51f59cf6f33e11ce6d87e40e9c5","amp;dn":"LesbianPickups+001+-+Saskia+1080p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f68cbfa31cef51f59cf6f33e11ce6d87e40e9c5","infoHashBuffer":{"type":"Buffer","data":[127,104,203,250,49,206,245,31,89,207,111,51,225,28,230,216,126,64,233,197]},"announce":[],"urlList":[]}}