{"title":"[NubileFilms] Kimmy Granger, Riley Reid - Feb 7, 2016 [1080p]","uid":13458229,"size":2481559047,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:812a26d8f59040bc17560a91064376589d8a66a9&amp;dn=%5BNubileFilms%5D+Kimmy+Granger%2C+Riley+Reid+-+Feb+7%2C+2016+%5B1080p%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xxxsunset","files":1,"time":1454866088,"description":"Screenshots: \nhttp://imgur.su/image/7AF1\r\n\r\nHow To Please You\r\nKimmy Granger &amp; Riley Reid\r\n\r\nWalking hand in hand, Kimmy Granger and Riley Reid head to the couch where they can exchange searing kisses as they work each other to ecstatic heights. Before a single bra or pair of panties comes off, Riley settles between Kimmy's legs and suckles her clit over the fabric. Kimmy can't help but unclasp her bra to massage her tits as her lover gets her all wound up.\r\n\r\nReturning the favor, Kimmy presses her mouth to Riley's twat that is still covered by her sheer panties. Once they are both completely topless, they spend plenty of time exploring each other's small boobs with their hands and their mouths as they let their passion gradually continue to build.\r\n\r\nWhen Riley finally slips Kimmy's thong down her legs, the blonde's bare pussy is already wet and ready for loving. Riley can't wait to dive in and enjoy every moment of lapping her tongue up and down her woman's bare slit as she feasts on Kimmy's creamy twat. She even takes the time to lick at Kimmy's anus to enhance her woman's pleasure a hundredfold.\r\n\r\nWith her body throbbing in enjoyment of Riley's ministrations, Kimmy eventually decides to turn the tables. After rolling Riley's panties off, Kimmy puts her hands and mouth to work licking and finger fucking Riley's landing strip pussy while also stimulating her ass. She takes her time, making sure that she leaves no part of Riley's cooch unlicked and untouched until Riley is gasping and moaning her orgasmic bliss.\r\n\r\nNow that they've each had a warmup climax, Riley goes back to work bringing Kimmy joy. Pushing two fingers deep into Kimmy's creamy snatch, she brings her lover's passion back to a fever pitch without letting her cum.\r\n\r\nNot to be outdone, Kimmy is eager to once again press her mouth to Riley's twat. Now that she has Riley where she wants her, Kimmy won't stop until her woman has once again come undone. When Kimmy immediately pulls out a little vibrator and uses it to tease Riley's rock hard nipples and gushing pussy, Riley can barely contain her moans of sexual need.\r\n\r\nAs Riley basks in the afterglow of her climax, Kimmy continues to tease her with the vibrator. Eventually she snatches the toy away and urges Kimmy to climb on top of her in a position that gives Riley a face full of Kimmy's pussy that she can finger and fondle with the toy while still letting Kimmy enjoy playing with Riley's tender twat if she's so inclined.\r\n\r\nAlthough they have both enjoyed multiple orgasms, neither girl is quite satisfied yet. Seating themselves side by side on the couch, Kimmy and Riley each reach down to rub their snatches in just the way they like. The self-stimulation is good, but what's even better is the way they work each other's twats in tandem until they are both gasping with the force of their final climax of the afternoon","torrent":{"xt":"urn:btih:812a26d8f59040bc17560a91064376589d8a66a9","amp;dn":"%5BNubileFilms%5D+Kimmy+Granger%2C+Riley+Reid+-+Feb+7%2C+2016+%5B1080p%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"812a26d8f59040bc17560a91064376589d8a66a9","infoHashBuffer":{"type":"Buffer","data":[129,42,38,216,245,144,64,188,23,86,10,145,6,67,118,88,157,138,102,169]},"announce":[],"urlList":[]}}