{"title":"Rook and Ronin Series - J. A. Huss","uid":13035178,"size":2656105,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:876f1ad058b343b178d535718bd11db43012f724&amp;dn=Rook+and+Ronin+Series+-+J.+A.+Huss&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":24,"time":1450472835,"description":"01. Tragic [Rook and Ronin, #01] - J. A. Huss\r\n\r\nimage\r\n\r\nRook Walsh is TRAGIC\r\n\r\nBecause life so far – just sucks. Some girls get parents. Rook got the foster care system. Some girls get Prince Charming. Rook got an abusive frog. Some girls get lucky…\r\n\r\nRook got a second chance.\r\n\r\nAnd she took it. Because when fate throws you a bone – you grab it with both hands and run.\r\n\r\nAntoine Chaput knows the minute he spies Rook in his photography studio that she’s got The Look. The dark and desperate look he must have to land the exclusive TRAGIC media contract.\r\n\r\nRook is paired up with top model, Ronin, and he’s everything her abusive ex-boyfriend wasn’t. Patient, gentle, happy, attentive, and sexy! He knows exactly what to do to make Rook blush for Antoine’s camera.\r\n\r\nRook’s luck changes in an instant and suddenly she’s the darling of the modeling world. It’s a dream job to go with a dream guy and all she has to do is look pretty and follow directions. But there’s always a price to pay – and Rook is about to get the bill.\r\n\r\n\r\n\r\n02. Manic [Rook and Ronin, #02] - J. A. Huss\r\n\r\nimage\r\n\r\nTRAGIC is over and Rook is ready for the future--Spencer Shrike and the STURGIS contract!\r\n\r\nIt's three months of body art modeling! That means three months of Spencer Shrike's paintbrush all over her body, three months in front of Antoine's camera, and three months of twenty-four-hour filming for Spencer's Biker Channel reality show.\r\n\r\nWait a minute... what reality show? Maybe she should've read that STURGIS contract a little closer? ;)\r\n\r\nSure, Rook's bank account is overflowing, but Ronin is angry, Clare is trying to escape rehab, Antoine is a worried mess, and Elise is just trying to hold everyone together. Rook's new family is about to fall apart before she even gets the chance to enjoy it.\r\n\r\n\r\n\r\n03. Panic [Rook and Ronin, #03] - J. A. Huss\r\n\r\nimage\r\n\r\nRook is chasing her dream—film school and a chance at a life beyond the one she ran from six months ago. But before she can become the girl she wants to be, she must deal with the girl she left behind.\r\n\r\nRonin is also chasing his dream—a family of his own and a life away from erotic modeling. And he too, has a past he’s trying to forget. A past that makes Rook question everything about their life together.\r\n\r\nLies, secrets, and shocking truths will rock the foundation Rook and Ronin have built. Can they put the past behind them and move forward together? Or is this just another too good to be true relationship that will crash and burn in the end?\r\n\r\n04. Happily Ever After [Rook and Ronin, #3.5] - J. A. Huss\r\n\r\nimage\r\n\r\n&quot;A little Christmas present for the #fans. No mystery, no killing, no twists, no guns. But I promise--you will smile the entire time.&quot; ~ JA Huss\r\n\r\nLife in Rook &amp; Ronin's world has been bliss for fifteen years. Rook, Veronica, and Ashleigh are still BFF's raising their kids together. Ronin, Spencer, and Ford have managed to go legit and stay out of trouble. And they have a pack of kids running around the eight thousand square foot Vail mansion they all share for the holidays--begging for gifts, and fun, and love.\r\n\r\nBut every HEA has problems.\r\n\r\nFive is fifteen and getting ready to go off to college. He's put it off as long as he could in order to stay close to Princess Shrike, but his stay of execution is over and in three weeks he's off to Oxford. But Five can't leave until he gets the only thing he's ever wanted. The heart of his Princess.\r\n\r\nFord and Ashleigh never had any more children after Five. And now that Kate is sixteen, Ashleigh is out of her head with desire for just one more chance to have a baby in the house.\r\n\r\nRook and Ronin have two beautiful daughters, but Sparrow is growing up too. And she just got a job offer that has Ronin crazed with paternal worry.\r\n\r\nAnd Spencer is the father of a fifteen-year-old princess who looks way too much like her Bombshell mother for his comfort level.\r\n\r\nJoin the whole Rook &amp; Ronin gang for a Team Christmas you will never forget","torrent":{"xt":"urn:btih:876f1ad058b343b178d535718bd11db43012f724","amp;dn":"Rook+and+Ronin+Series+-+J.+A.+Huss","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"876f1ad058b343b178d535718bd11db43012f724","infoHashBuffer":{"type":"Buffer","data":[135,111,26,208,88,179,67,177,120,213,53,113,139,209,29,180,48,18,247,36]},"announce":[],"urlList":[]}}