{"title":"Unveil v22.01.2016","uid":13308503,"size":466643220,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8931db652f32394b151437c466756762011d80a9&amp;dn=Unveil+v22.01.2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dauphong","files":1,"time":1453754078,"description":"Survival in it's purest form. Within the richest Simulation of Nature ever delivered.\r\nStay alive\r\nFrom Energy, Hydration, and Body Temperature management, outsmart nature and adapt to the ever changing weather, climate conditions, landscape and depleting resources.\r\nA world yours to experiment in\r\nUnveil runs the deepest simulation of nature ever created for a game. From full weather cycle, body temperature, air dissipation, fire combustion, heat, photons, you name it.\r\nLearn more at unveilgame.com\r\n- Features overview\r\n- List of features in Early Access version\r\nWhat makes it unique\r\n\r\n    This is a simulator. No survival-coated game mechanics and that's it. The world is connected and reactive. What you do, and how you do it, matters.\r\n    Pure survival in nature. No zombies. No terror. You wouldn't believe how hard and how much there is to surviving in nature alone.\r\n    Real life reasoning. Instead of thinking in game mechanics, you think on what you would do in such situation in real life. Simulation will take it from there.\r\n    Scenario diversity. Whether you always dreamed of surviving in a tropical island, the cold mountains or desert, there is a location with it's own resources, topography, climate conditions and events, handcrafted just for you.\r\n    Goal diversity. Each scenario comes with it's own goals, or none. Survive for as long as you can? Check. Reach where no one else dares? Check. Make it out alive to the rescue crew? Check. \r\n\r\nEnergy, Body Temperature and Hydration\r\nStay alive and healthy with proper Energy management, Body Temperature preservation and Rehydration. Survive by trapping, fishing, gathering, collecting, crafting and exploring, and by even more ways if you are creative enough.\r\nSimulation recreates a true model of nature\r\nFrom full weather cycle, body temperature, air dissipation, fire combustion, heat, photons, Unveil runs the deepest simulation of nature ever created. The details of it are even more impressive. In example:\r\n\r\n    Sweating, bathing or rain, will moist your skin, enabling dissipation to occur, cooling your body off, relative to ambient temperature, wind speed and humidity.\r\n    A campfire in a closed environment raises ambient temperature.\r\n    An open container, put under the rain, can collect rain water. \r\n\r\nCrafting\r\nCrafting isn't the focus of the game, however it is required to build some essential components to survive, or recycle existing items:\r\n\r\n    Build your own tools with whatever you can find, as there is more than one way to make each, with different quality results.\r\n    Make various weareables, which can protect you from rain, ambient humidity, wind speed, sun rays, or keep your body temperature higher.\r\n    Be creative and find new uses to items that look obsolete. It's what survival is about.\r\n    Cook at fire to make certain food edible, or get special benefits from them.\r\n    Build traps to capture wildlife.\r\n    Erect small bridges, or drop down a vine to climb back up, wherever it makes sense to open your way through the wild farther than you should. \r\n\r\nCurrently in Beta\r\n\r\n    Simulation engine is almost done.\r\n    Some Scenarios are created, but many more need to be designed and tested.\r\n    Many items are already available.\r\n    Graphics are placeholders. The game will get custom character, item and world/environment graphics made.\r\n    Already sports over 8 hours of unique gameplay (without counting it's replayability) with the content available","torrent":{"xt":"urn:btih:8931db652f32394b151437c466756762011d80a9","amp;dn":"Unveil+v22.01.2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8931db652f32394b151437c466756762011d80a9","infoHashBuffer":{"type":"Buffer","data":[137,49,219,101,47,50,57,75,21,20,55,196,102,117,103,98,1,29,128,169]},"announce":[],"urlList":[]}}