{"title":"The atheist troll Arzock","uid":13228840,"size":9978489,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8a9ab41d00901b78adf9c1c036bcca0dc7029010&amp;dn=The+atheist+troll+Arzock&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dakilukker","files":1,"time":1452911605,"description":"An interesting story, concerning an atheist troll who has been banned from numerous forums. He's dedicated so many years of his life to trolling on gaming forums as well as harassing the religious and I found it interesting because I see so many atheists who are obsessive over religion with a seemingly uncontrollably anger towards it like this guy. These same atheists profess to be &quot;free of religion&quot; but when we examine their long history of trolling on the internet (as documented with this particular atheist) it seems they aren't free of religion at all and that their hatred of it, in fact, has taken over their lives.\r\n\r\nI find it especially amusing when so many of these atheists even troll the web looking for specific torrents, articles, videos or blogs just mentioning religion so they can troll on them. I have even seen this on this very site.\r\n\r\nIt's ironic and sad.\r\n\r\nThis torrent file already exists on other sites but I've updated it so it contains images with forum members mentioning Arzock's constant trolling and an image showing his recent trolling.\r\n\r\n\r\nAll of these files are contained in the WinRAR folder.\r\n\r\n\r\nOriginal torrent file description was:\r\n\r\n&quot;Arzock was nothing more than a 12 year old atheist troll on a gaming forum who got banned. Asides from ending up banned from the unofficial Elder scrolls pages (http://forums.uesp.net/viewtopic.php?f=28&amp;t=15028) arzock was also banned from Fable's official forum thanks to the trolling efforts of a user known as &quot;Thekingoftheguild&quot; who was nothing more than a non-religious theist who satirized religion alongside atheism. \r\n\r\nArzock continues to troll the uesp forums and has been doing so since 2008. However, each time, he keeps getting caught out by its users who spot out his spelling and grammar and childish behavior which hasn't changed even after 6 years (making him 18 at the time of typing this).\r\n\r\nBack in 2014, Arzock returned to the UESP forums once again, this time posting comments that hinted towards himself being depressed and hating himself. (http://forums.uesp.net/viewtopic.php?f=22&amp;t=9380&amp;start=3775) See the post from &quot;ThomasArzock&quot; further down the page. In this post he states &quot;I despise religion because this priest mocked my beliefs once when I told him that I believe the universe created itself from nothing and I really hate Churches. I love Skyrim because it allows me to escape from the real world and my stupid family.&quot;\r\n\r\nIncluded in this torrent file is a movie mentioning Arzock's trolling, images showing members of the UESP forum discussing Arzock's ban and return where he is annoying people, an image showing Arzock's new &quot;self-loathing&quot; trolling and finally another movie titled &quot;How Arzock was Destroyed&quot; made by one of the trolls who trolled Arzock on the Lionhead forum and got him banned there.\r\n\r\nAt some point, an atheist troll with a persecution complex from YouTube named kookyinc started defending Arzock for some reason. There's a video of him and his trolling included in this torrent file too.&quot;","torrent":{"xt":"urn:btih:8a9ab41d00901b78adf9c1c036bcca0dc7029010","amp;dn":"The+atheist+troll+Arzock","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a9ab41d00901b78adf9c1c036bcca0dc7029010","infoHashBuffer":{"type":"Buffer","data":[138,154,180,29,0,144,27,120,173,249,193,192,54,188,202,13,199,2,144,16]},"announce":[],"urlList":[]}}