{"title":"Prison Architect update 2b repack Mr DJ","uid":13049099,"size":284566100,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8c7f5292503ac983440d56bb98557fa5110e6a92&amp;dn=Prison+Architect+update+2b+repack+Mr+DJ&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rock840","files":2,"time":1450604008,"description":"Title: Prison Architect\r\n Genre: Indie, Simulation, Strategy\r\n Developer: Introversion Software\r\n Publisher: Introversion Software \r\n Release Date: 6 Oct, 2015\r\n\r\nAbout This Game\r\n\r\nBuild and manage a Maximum Security Prison. As the sun casts it’s early morning rays on a beautiful patch of countryside the clock starts ticking. You’ve got to crack on and build a holding cell to detain the job­ lot of maximum security prisoners that are trundling to your future prison on their yellow bus. As your workmen lay the last brick you don’t have a moment to let them rest as they need to get started on the first proper cell block so you can make room for the next prisoner intake. Once they’ve all got a place to lay their weary heads the fun can really start.\r\n\r\n You’ll need a canteen, infirmary and a guard room, oh, and don’t forget to plumb in a toilet, or things will get messy, but what about a workout area? Or solitary confinement cells? Or an execution chamber?\r\n\r\n Inspired by Dungeon Keeper, Dwarf Fortress and Theme Hospital and with over 1 million players having spent time inside, Prison Architect is the world’s best lock-­em-­up.\r\n\r\n System Requirements\r\n\r\n Minimum:\r\n OS:XP\r\n Processor:Intel Core2 Duo 2.4Ghz or Higher / AMD 3Ghz or Higher\r\n Memory:4 GB RAM\r\n Graphics:Nvidia 8600 / Radeon equivalent (2009 era)\r\n Hard Drive:300 MB HD space\r\n\r\n Update 2 Change List\r\n Women's Prisons\r\n You can now choose the gender of your prisoners in the &quot;New Prison&quot; screen. Female prisoners have different needs and behave differently than male prisoners.\r\n\r\n Children Some female prisoners are mothers of young babies (less than two years old) and are entitled to look after their baby during their stay in your prison. This requires some new facilities - often called &quot;MBUs (Mother and Baby Units)&quot;\r\n Family Cell A new type of cell for mothers with babies only. Similar to a normal cell, but also requires a Cot and an integrated Shower. Nb these cells will never be assigned to female prisoners without babies.\r\n Nursery A shared room for all mothers to live in, typically isolated from the rest of the prison. Mothers will spend much of their time in this room with their babies. Requires cots and play mats for the babies.\r\n\r\n Mothers will eat their meals in this room, so it also requires a serving table, benches etc. Your kitchens will be assigned to cook meals for the nurseries as if they were canteens.\r\n\r\n = Modding API (continued)\r\n• Added world and world cell data variables to the scripting API. This includes getting the size of the world, time index, etc. Setting these variables, however, is currently unsupported.\r\n\r\n• A new interface scripting API has been included as well. Mods can now add, remove, and change buttons in the BiographyWindow (shown when you select a non-prisoner object in the world), with callbacks to it's script.\r\n\r\n• Modding in escape mode has also been improved by allowing player interaction on scripted objects. A callback to the script is given when the player is close to an object and interacts with it.\r\n\r\n - General performance enhancements, especially to laundry system.\r\n\r\n - New Translations: Danish, Dutch, Hungarian, Thai\r\n\r\n - Bug Fixes:\r\n• Needs.txt not loaded in correct order when using mods\r\n\r\n• 0010162: [Gameplay] Surrendering in escape mode causes insane amounts of rep points / surrendering doesn't work\r\n\r\n• 0010309: [Control &amp; User Interface] [Prison Architect] Crash when opening confidential informant window\r\n\r\n\r\n**INSTALL INSTRUCTIONS:\r\n\r\nOpen Prison Architect.exe , wait for a bit for the self extractor to open, specify the directory where u want to extract the game folder, open the extracted folder and play.....\r\n OR\r\nExtarct it yourself using 'WinRAR'\r\n\r\nAlways open the game using run as administrator\r\n\r\nCheck my FB page for more :\r\nMr DJ repacks","torrent":{"xt":"urn:btih:8c7f5292503ac983440d56bb98557fa5110e6a92","amp;dn":"Prison+Architect+update+2b+repack+Mr+DJ","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c7f5292503ac983440d56bb98557fa5110e6a92","infoHashBuffer":{"type":"Buffer","data":[140,127,82,146,80,58,201,131,68,13,86,187,152,85,127,165,17,14,106,146]},"announce":[],"urlList":[]}}