{"title":"The Green Archer (1940) Old Time Serial (OTS)","uid":13452750,"size":3155199699,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8d5c2dcff20c092ba6a7336aa679a45027adc73e&amp;dn=The+Green+Archer+%281940%29+Old+Time+Serial+%28OTS%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MikeyMoMo","files":16,"time":1454815291,"description":"From 1940, in 15 episodes of glorious Black and White comes Columbia's 12th serial of 57 total (following 1940's &quot;Deadwood Dick&quot; and ahead of 1941's &quot;White Eagle&quot;) is another of director's James Horne's &quot;classics&quot; where he evidently figured that the same reactions that served him well in Laurel and Hardy films would work well in action serials where he has all hands, heroes and villains alike, doing some kind of over-the top &quot;take&quot;, no matter the situation. \r\n\r\nThis loose adaptation of an Edgar Wallace story finds Michael Bellamy (Kenne Duncan in his Kenneth Duncan period) inheriting Garr Castle, but his brother, Abel Bellamy (James Craven, as usual making Oil-Can Harry look smooth), has him imprisoned unjustly and moves into the castle himself. When Michael's wife, Elaine Bellamy (Dorothy Fay), fails to return after visiting Abel, her sister Valerie Howett (Iris Meredith), accompanied by their father, Parker Howett (Forrest Taylor) and private detective Spike Holland (Victor Jory, who even when playing the lead hero gets a villain's name), rent an adjoining estate, determined to investigate the case. Abel is afraid they will discover his association with a gang of jewel thieves and desperately - with Horne directing and Craven emoting, desperate is the only word - tries to have them all killed, and anybody else that might be standing around wondering how ten henchmen could fit in a six-passenger car. Each attempt is thwarted by the sudden appearance of the mysterious Green Archer, who is always there with his deadly bow and arrows whenever needed. It takes Abel most of the 15 chapters before he succeeds in capturing Spike, Valerie and Mr. Howett, but the shadow of the Green Archer's feathered Robin-Hood cap is on one of the walls of Garr Castle, and moving in.\r\n- Written by Les Adams","torrent":{"xt":"urn:btih:8d5c2dcff20c092ba6a7336aa679a45027adc73e","amp;dn":"The+Green+Archer+%281940%29+Old+Time+Serial+%28OTS%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d5c2dcff20c092ba6a7336aa679a45027adc73e","infoHashBuffer":{"type":"Buffer","data":[141,92,45,207,242,12,9,43,166,167,51,106,166,121,164,80,39,173,199,62]},"announce":[],"urlList":[]}}