{"title":"The-Laura-Ingraham-Show-Podcast APRIL 26 ,  2016","uid":14445050,"size":34220949,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8e0d9179f97fc1ccc84b0c374bf44ba5edbcbb8c&amp;dn=The-Laura-Ingraham-Show-Podcast+APRIL+26+%2C++2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1461712786,"description":"Laura Ingraham Podcast MP3 APRIL 26 , 2016\r\n\r\nLarry Sabato - Director of the Center for Politics, University of Virginia on Cruz/Kasich deal: &quot;you simply can't tell them to switch to a candidate they don't know from one that they like&quot; \r\n\r\nGuest Lineup\r\nLarry Sabato - Director of the Center for Politics, University of Virginia\r\nAnn Corcoran - Founder, Refugee Resettlement Watch\r\n\r\nCartels Help Terrorists in Mexico Get to U.S. to Explore Targets; ISIS Militant \r\n\r\nHillary Hits Trump On Wealth, Private Jet\r\nHillary Clinton cast Donald Trump as out of touch with the United States while campaigning Monday in Delaware, arguing that the Republican front-runner flies into states, gives speeches and then returns to the lap of luxury without listening to voters' problems.\r\n\r\nCruz-Kasich Pact Quickly Weakens\r\nThe temporary alliance between Senator Ted Cruz and Gov. John Kasich of Ohio, formed to deny Donald J. Trump the Republican presidential nomination, was already in danger of fraying to the point of irrelevance on Monday, only hours after it was announced to great fanfare.\r\n\r\n\r\nShaykh Mahmood Omar\r\nMexican drug traffickers help Islamic terrorists stationed in Mexico cross into the United States to explore targets for future attacks, according to information forwarded to Judicial Watch by a high-ranking Homeland Security official in a border state. Among the jihadists that travel back and forth through the porous southern border is a Kuwaiti named Shaykh Mahmood Omar Khabir, an ISIS operative who lives in the Mexican state of Chihuahua not far from El Paso, Texas. Khabir trained hundreds of Al Qaeda fighters in Pakistan, Afghanistan and Yemen and has lived in Mexico for more than a year, according to information provided by JW's government source.\r\n\r\n\r\nCruz/Kasich pact Quickly Weakens\r\nThe temporary alliance between Senator Ted Cruz and Gov. John Kasich of Ohio, formed to deny Donald J. Trump the Republican presidential nomination, was already fraying almost to the point of irrelevance on Monday, only hours after it was announced to great fanfare.\r\n\r\n\r\nHow Gerald Ford beat Ronald Reagan at the last contested GOP convention\r\nCraig Shirley - The Washington Post\r\nForty years ago, Ronald Reagan and Gerald Ford came to a final showdown at the Republican National Convention in Kansas City, Mo. It was the first time since 1948 that no one knew heading into the convention who the nominee would be.\r\n\r\nTonights Primary: Trump, Clinton Aim For Sweep\r\nDonald Trump is aiming for a sweep of all five Northeastern states holding primaries Tuesday, including Pennsylvania, with his rivals pinning their hopes of stopping the Republican front-runner on a fragile coordination strategy in the next rounds of voting.\r\nGoogle\n\r\n\r\n\r\nKASICH: 'I'm not out to stop Trump'\r\nSpeaking to TODAY by telephone, Ohio Gov. John Kasich says, &quot;I'm not out to stop Donald Trump; I'm out to stop Hillary Clinton,&quot; and cites polls that say he can defeat Clinton and Trump cannot. He says his supposed alliance with Ted Cruz is &quot;a matter of resources&quot; and that he doesn't &quot;tell voters what to do,&quot; and he &quot;doesn't understand&quot; what's so confusing about their agreement.\r\n\r\nWhy the Ted Cruz-John Kasich alliance seems destined to fail\r\nChris Cillizza - The Washington Post\r\nWhile most of the country - including me - was watching the season six premiere of &quot;Game of Thrones,&quot; the campaigns of Ted Cruz and John Kasich announced a major strategic alliance. Kasich would stop campaigning in - and trying to win - Indiana's primary May 3. Cruz would do the same in Oregon on May 17 and New Mexico on June 7.\r\nGoogle","torrent":{"xt":"urn:btih:8e0d9179f97fc1ccc84b0c374bf44ba5edbcbb8c","amp;dn":"The-Laura-Ingraham-Show-Podcast+APRIL+26+%2C++2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e0d9179f97fc1ccc84b0c374bf44ba5edbcbb8c","infoHashBuffer":{"type":"Buffer","data":[142,13,145,121,249,127,193,204,200,75,12,55,75,244,75,165,237,188,187,140]},"announce":[],"urlList":[]}}