{"title":"Burn This Book - Fernando Suarezserna - PDF + mobi + epub","uid":13498405,"size":22611119,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e1e8f87e681df01a98733a0f110f48af1a6fa3e&amp;dn=Burn+This+Book+-+Fernando+Suarezserna+-+PDF+%2B+mobi+%2B+epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fersuarez","files":4,"time":1455175714,"description":"Contains epub + mobi + PDF file of the book &quot;Burn This Book&quot;\r\n\r\nYou can find the book description and images at: \nhttp://www.manvsoffice.com\r\n\r\n\r\n\r\n\r\nHere's the book description:\r\n-------------------------\r\n\r\n\r\nWhy do I keep talking about my projects and dreams, but can’t manage to do them?\r\n\r\nI’ve been there, I know what it’s like. It destroys our self-esteem, our productivity, and our ability to dream. Have no fear. You can do it. And it will not be as hard as you may think.\r\n\r\nBurn This Book covers my entire journey: my most personal stories, the eureka moments that lead on how I placed my life in order, and the correct questions to ask so you can place yours in order as well.\r\n\r\nHave you ever seen people who seem to excel at every aspect of life? People who seem to be great professionals, to live a healthy life and to have great relationships. How do these successful people achieve such results?\r\n\r\nIn brief, they do it the old-fashioned way: with hard work and self-discipline.\r\n\r\nEveryone knows that exercise keeps us healthy, yet most people don’t do it. Smokers know that smoking is harmful, but they don’t stop. Why? Because information alone doesn’t result in change. In school they teach us that knowledge is power, but knowledge is not power. It is in the actions one takes with their knowledge that power is found.\r\n\r\nThis book isn’t meant to be just another feel-good piece that is skimmed and placed on the shelf. I want you to read it, mark it, write down the ideas that you want to implement and act. Then you won’t need this book anymore. Throw it away. Burn it.\r\n\r\nIt’s not that knowledge is bad; knowledge is good, but applied knowledge is better.\r\n\r\nBurn This Book is a narrative non-fiction that follows a simple format: Story-Lesson-Call to action. It is about self-esteem confidence and the practical pursuit of happiness.\r\n\r\nI believe that self-esteem building, and therefore, happiness, relies in doing what we love. Either by applying creativity in business or in your personal life, when creativity is understood as an action (and not as a synonym of imagination) it plays a key role in personal fulfillment.\r\n\r\nWhatever your vision of success is, Burn This Book will help you get there.\r\n\r\nSpeaker and strategist Fernando Suarezserna presents the simple program Burn This Book. In a nutshell: you’ll learn how to focus your creative-self in order to reach your goals.\r\n\r\nWritten by Fernando Suarezserna. Designed by Andrés Salazar Ruiz Velasco","torrent":{"xt":"urn:btih:8e1e8f87e681df01a98733a0f110f48af1a6fa3e","amp;dn":"Burn+This+Book+-+Fernando+Suarezserna+-+PDF+%2B+mobi+%2B+epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e1e8f87e681df01a98733a0f110f48af1a6fa3e","infoHashBuffer":{"type":"Buffer","data":[142,30,143,135,230,129,223,1,169,135,51,160,241,16,244,138,241,166,250,62]},"announce":[],"urlList":[]}}