{"title":"Die Hard Pentalogy DvDrip NL Collected By Jeffrey","uid":13017757,"size":5035897696,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8f465cc9fba5ce15821217fc143d012ebe1f6d42&amp;dn=Die+Hard+Pentalogy+DvDrip+NL+Collected+By+Jeffrey+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gljeffrey45","files":5,"time":1450311469,"description":"Die Hard Pentalogy DvDrip NL Collected By Jeffrey \r\n\r\nDie Hard 1 (1988)DvDrip NL By Jeffrey \r\n\r\nVerenigde Staten \r\nActie / Thriller \r\n131 minuten \r\n\r\ngeregisseerd door John McTiernan \r\nmet Bruce Willis, Alan Rickman en Bonnie Bedelia \r\n\r\nDe enige reden waarom de New Yorkse agent in Los Angeles zit, is dat hij de kerst bij zijn kinderen wil zijn. Hij bevindt zich op een feestje van het werk van zijn ex-vrouw als een stel Duitse terroristen controle over de wolkenkrabber neemt om een kluis met zeven sloten te openen. Door zijn verdekte positie weet hij de groep gijzelaars te ontlopen om zo de terroristen uit te schakelen en hun plan te saboteren. \r\n\r\nNL Subs \r\nAVI \r\n\r\nDie Hard 2 Die Harder (1990)DvDrip NL By Jeffrey \r\n\r\nVerenigde Staten \r\nActie / Thriller \r\n124 minuten \r\n\r\ngeregisseerd door Renny Harlin \r\nmet Bruce Willis, Bonnie Bedelia en William Atherton \r\n\r\nAls de agent John McClane weer eens voor kerst in Washington is, ziet hij iets vreemds op de luchthaven. Hij grijpt in en ontdekt dat het om zeer zware jongens gaat, al weet hij niet wat ze van plan zijn. Als de politie eenmaal doorheeft dat hij gelijk heeft is het al te laat. Terroristen hebben de luchthaven en de toestellen in de lucht in hun macht en in één van die toestellen zit John's vrouw. Hij tracht verborgen te blijven, de terroristen uit te schakelen en zeker niet makkelijk dood te gaan, net als vorig jaar. \r\n\r\nNL Subs \r\nAVI \r\n\r\nDie Hard 3 With A Vengeance (1995)DvDrip NL By Jeffrey \r\n\r\nVerenigde Staten \r\nActie / Thriller \r\n131 minuten \r\n\r\ngeregisseerd door John McTiernan \r\nmet Bruce Willis, Samuel L. Jackson en Jeremy Irons \r\n\r\nOp een publieke plek in New York vindt een explosie plaats, die opgeëist wordt door een man die zich Simon noemt en alleen met John McClane wil praten. McClane is een zwaar alcoholistische agent die z'n badge niet meer heeft, maar alleen als hij de opdrachten van Simon uitvoert zullen de explosies stoppen. \r\n\r\nNL Subs \r\nAVI \r\n\r\nDie Hard 4 Live Free Or Die Hard (2007)DvDrip NL By Jeffrey \r\n\r\nVerenigde Staten / Verenigd Koninkrijk \r\nActie / Thriller \r\n128 minuten \r\n\r\ngeregisseerd door Len Wiseman \r\nmet Bruce Willis, Justin Long en Timothy Olyphant \r\n\r\nPolitieagent John McClane krijgt de opdracht de jonge hacker Matt Farrell op te halen. Het lijkt in eerste instantie een routineklus te worden, maar als McClane en Farrell ineens aangevallen worden in Farrell's appartement, blijkt er veel meer aan de hand te zijn. Ze ontdekken dan dat Thomas Gabriel het hele land bedreigt met een complot om het computersysteem en de technische structuur waar de Amerikaanse economie op drijft te saboteren. Aan de ruige en grof gebekte McClane de taak om dit plannetje van Gabriel te stoppen. \r\n\r\nNL Subs \r\nAVI \r\n\r\nDie Hard 5 A Good Day to Die Hard (2013)BRrip 720p NL By Jeffrey \r\nAlternatieve titel: Die Hard 5 \r\n\r\n\r\nVerenigde Staten \r\nActie / Misdaad \r\n98 minuten \r\n\r\ngeregisseerd door John Moore \r\nmet Bruce Willis, Jai Courtney en Sebastian Koch \r\n\r\nJohn McClane (Bruce Willis) reist af naar Rusland om zijn vervreemde zoon te helpen. Die is betrokken bij de gevangenisuitbraak van een Russische leider die een staatsgreep wil plegen. Vader en zoon moeten alles op alles zetten om zichzelf en elkaar in leven te houden en de werelddemocratie te beschermen. \r\n\r\n\r\nNL Subs \r\nMP4 \r\n\r\nBeste gebruikers, \r\nde torrents worden geüpload met een server, en voor de omschrijving ben ik dus afhankelijk van wat ik zelf binnen krijg aan info. \r\nIk kan dus niet alles wat ik upload nalopen op fouten in de omschrijving. \r\nWaardeer je mijn uploads,laat dan even een commentaartje achter. \r\nTorrents uploaden is puur hobby voor mij. \r\n\r\nVeel plezier met de door jouw gedownloade torrent","torrent":{"xt":"urn:btih:8f465cc9fba5ce15821217fc143d012ebe1f6d42","amp;dn":"Die+Hard+Pentalogy+DvDrip+NL+Collected+By+Jeffrey+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f465cc9fba5ce15821217fc143d012ebe1f6d42","infoHashBuffer":{"type":"Buffer","data":[143,70,92,201,251,165,206,21,130,18,23,252,20,61,1,46,190,31,109,66]},"announce":[],"urlList":[]}}