{"title":"1Password 6.0.1 [MAC OS X]","uid":13458550,"size":53115010,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:8fdaae2c55f0fea79ddc9a94b5344c56d286f602&amp;dn=1Password+6.0.1+%5BMAC+OS+X%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"iAlexander","files":1,"time":1454869640,"description":"MADE IN UKRAINE\r\n\r\n1Password 6.0.1 – Powerful password manager; integrates with Web browsers and more.\r\n\r\n1Password is a password manager that uniquely brings you both security and convenience. It is the only program that provides anti-phishing protection and goes beyond password management by adding Web form filling and automatic strong password generation. Your confidential information, including passwords, identities, and credit cards, is kept secure using strong encryption.\r\n1Password fully supports major Web browsers, including Safari, Firefox, Chrome, and Opera. All browser extensions share the same encrypted data which means you never need to manually copy your passwords between browsers or from the password manager to a browser ever again!\r\n\r\nWhat's new in version 6.0.1:\r\n- Added the &quot;Reset iCloud Data&quot; to the Help &gt; Troubleshooting menu in our AgileBits Store version of 1Password.\r\n- Added better logging of iCloud Sync in our AgileBits Store version of 1Password, for easier issue diagnosis.\r\n- Fixed an issue where it was no longer possible to drag .app files to 1Password to create Software Licenses.\r\n- Fixed an issue where needless empty backup files were created while running in 1Password for Teams-only mode.\r\n- Fixed an issue displaying a Document would fail in QuickLook after locking and unlocking the app.\r\n- Fixed an issue where you couldn't close a item view in mini with the left arrow keyboard shortcut.\r\n- Fixed an issue where save pending changes would prevent auto lock timeout.\r\n- Fixed an issue where changes after the first pending save would be lost when creating a new item.\r\n- Fixed a crash that could occur when unlocking while an anchored mini window contained a 1Password for Teams item.\r\n- Fixed a crash that could occur when changing the sort type in the main app.\r\n- Fixed a crash that could occur when quitting 1Password mini.\r\n- Fixed a crash that could happen while bringing up the main window, especially while unlocking in mini while the main window was closed.\r\n\r\nMADE IN UKRAINE","torrent":{"xt":"urn:btih:8fdaae2c55f0fea79ddc9a94b5344c56d286f602","amp;dn":"1Password+6.0.1+%5BMAC+OS+X%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fdaae2c55f0fea79ddc9a94b5344c56d286f602","infoHashBuffer":{"type":"Buffer","data":[143,218,174,44,85,240,254,167,157,220,154,148,181,52,76,86,210,134,246,2]},"announce":[],"urlList":[]}}