{"title":"John-Batchelor-Aca-OBAMACARE-Unsustainable.mp3","uid":14452961,"size":18615778,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:915ca905ec8f89ba0ec3be435870eacc144115a6&amp;dn=John-Batchelor-Aca-OBAMACARE-Unsustainable.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1461768177,"description":"ACA Subsidies Cannot Solve a Losing Formula for Insurers. Brian Blasé, Mercatus Center -OBAMACARE\r\n\r\nJohn Batchelor Podcast April 26,2016\r\n\r\n“A large subsidy program that has helped insurers offering Affordable Care Act (ACA) compliant coverage in the individual market expires this year. In 2017, for the first time, insurance premiums alone must cover expenses in the individual market. A new working paper released today by the Mercatus Center at George Mason University measures the importance of this subsidy program, sheds new light on insurers’ generally poor results in 2014, and discusses what likely lies ahead for the law.\r\n\r\n“The study, authored by myself, Doug Badger of the Galen Institute and Ed Haislmaier of the Heritage Foundation contains two key findings. First, insurers incurred substantial losses overall despite receiving much larger back-end subsidies per enrollee through the ACA’s reinsurance program than they expected when they set their premiums for 2014. Second, we estimate that in the absence of the reinsurance program insurers would have had to set premiums 26% higher, on average, in order to avoid losses—assuming implausibly that the overall health of the risk pool would not have worsened as a result of the higher premiums. Our findings raise serious questions about the ACA’s future, particularly when the reinsurance program ends and premium revenue must be sufficient to cover expenses.\r\n \nhttp://www.forbes.com/sites/theapothecary/2016/04/25/new-obamacare-study-considers-what-happens-when-generous-government-subsidies-end/#6c0dad1d45e2\r\n\r\nThe John Batchelor Show","torrent":{"xt":"urn:btih:915ca905ec8f89ba0ec3be435870eacc144115a6","amp;dn":"John-Batchelor-Aca-OBAMACARE-Unsustainable.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"915ca905ec8f89ba0ec3be435870eacc144115a6","infoHashBuffer":{"type":"Buffer","data":[145,92,169,5,236,143,137,186,14,195,190,67,88,112,234,204,20,65,21,166]},"announce":[],"urlList":[]}}