{"title":"Ann Handley - Everybody Writes (audiobook)","uid":13342055,"size":377983784,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:928d7a54fa9d5effb2f556f0d5d1cbc0399c0d79&amp;dn=Ann+Handley+-+Everybody+Writes+%28audiobook%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"meltsmurf","files":82,"time":1454028453,"description":"From the Inside Flap\r\nIf you have a website, you are a publisher. If you are on social media, you are in marketing. And that means that we are all relying on our words to carry our marketing messages. We are all writers.\r\n\r\nEverybody Writes is your go-to guide to attracting and retaining customers through stellar online communication, because in our content-driven world, every one of us is a writer.\r\n\r\nYeah, but who cares about writing anymore? In a time-challenged world dominated by short and snappy, by click-bait headlines and Twitter streams and Instagram feeds and gifs and video and Snapchat and YOLO and LOL and #tbt … does the idea of focusing on writing seem pedantic and ordinary?\r\n\r\nActually, writing matters more now, not less. Our online words are our emissaries; they tell our customers who we are.\r\n\r\nOur writing can make us look smart or it can make us look stupid. It can make us seem fun, or warm, or competent, or trustworthy. But it can also make us seem humdrum or discombobulated or flat-out boring. That’s true whether you’re writing a listicle or the words on a SlideShare deck or the words you’re reading right here, right now…\r\n\r\nSo you’ve got to choose words well—and write with economy and style and honest empathy for your customers. And that means you have to put a higher value on an often overlooked skill in content marketing: how to write, and how to tell a true story really, really well.\r\n\r\nBeing able to communicate well in writing isn’t just nice; it’s necessary. And it’s also the often overlooked cornerstone of nearly all our content marketing.\r\n\r\nIn Everybody Writes, top marketing veteran Ann Handley gives expert guidance and insight into the process and strategy of content creation, production, and publishing with practical how-to advice designed to get results.\r\n\r\nThese lessons and rules she lays out apply to all of your online content—your Web pages, home pages, landing pages, blogs, emails, marketing offers, and to your posts and updates onTwitter, LinkedIn, and other social media.\r\n\r\nEverybody Writes is designed to be your go-to guide for creating or publishing any kind of online content—whether you’re working for a big brand or a small business… or yourself","torrent":{"xt":"urn:btih:928d7a54fa9d5effb2f556f0d5d1cbc0399c0d79","amp;dn":"Ann+Handley+-+Everybody+Writes+%28audiobook%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"928d7a54fa9d5effb2f556f0d5d1cbc0399c0d79","infoHashBuffer":{"type":"Buffer","data":[146,141,122,84,250,157,94,255,178,245,86,240,213,209,203,192,57,156,13,121]},"announce":[],"urlList":[]}}