{"title":"TextSoap 8.0.1 [MAC OS X]","uid":13488389,"size":15729214,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:92e9f65f1cb33d20d72bcb66927482ee449e769b&amp;dn=TextSoap+8.0.1+%5BMAC+OS+X%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"iAlexander","files":1,"time":1455103154,"description":"MADE IN UKRAINE\r\n\r\nTextSoap 8.0.1 – Automate Tedious Text Document Cleaning.\r\n\r\nThis tool is for people who work with text. TextSoap effortlessly cleans up text from endlessly different formats. Wash away unwanted characters, spaces, tabs. Fix paragraphs with hard returns at the end of each line, as well as a myriad of other formatting issues that come your way and do it all while retaining desired font styles.\r\nUnlike finding and replacing each of dozens of typical formatting issues or manually perusing through a file to find errors and fixing them by hand, TextSoap can automate that task down to just one click. And you can do it all from within your favorite app using the TextSoap Universal menu. Easy to learn for casual users, TextSoap also has the flexibility that serious users need.\r\n\r\nWhat's new in version 8.0.1:\r\n- Menu items to directly access import and export cleaner functionality.\r\n- Menu items to create a new custom cleaner and new custom group added\r\n- Now prompts to import previous TextSoap database, if found.\r\n- Renamed 'Customize Navigator' to 'Custom Cleaners and Groups' in Window menu.\r\n- Fixed: App would not always properly activate on launch (stayed in background, menu issues).\r\n- Fixed: Bugs related to default font and zoom settings.\r\n- Fixed: Bugs related to importing previous database of cleaners.\r\n- Fixed: Cleaners using text wrap incorrectly wrapped at every word.\r\n- Fixed: Custom cleaners were not available to select in TextSoap Menu prefs.\r\n- More: See release notes for complete details.\r\n\r\nMADE IN UKRAINE","torrent":{"xt":"urn:btih:92e9f65f1cb33d20d72bcb66927482ee449e769b","amp;dn":"TextSoap+8.0.1+%5BMAC+OS+X%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92e9f65f1cb33d20d72bcb66927482ee449e769b","infoHashBuffer":{"type":"Buffer","data":[146,233,246,95,28,179,61,32,215,43,203,102,146,116,130,238,68,158,118,155]},"announce":[],"urlList":[]}}