{"title":"Ultimate Dinosaur Simulator v1.0.5","uid":13284541,"size":71800722,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:936e876512b338effad3081e159750ad2b43f48e&amp;dn=Ultimate+Dinosaur+Simulator+v1.0.5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Androider","files":1,"time":1453523777,"description":"Discover a long lost prehistoric world and rule over it as an all mighty Dinosaur! \r\n\r\nTravel back to a time when monstrous carnivores roamed the Earth and exotic plant life filled dangerous jungles! For the first time ever, choose from TEN PLAYABLE DINOSAURS! Hunt down food, raise a family of dinos, and battle for your life against fierce bosses like the Spinosaurus!\r\n\r\nDownload the Ultimate Dinosaur Simulator today while it's 50% OFF for a very limited time!\r\n\r\nBrand New Features\r\nREALISTIC SIMULATOR\r\nYou'll need to maintain your health, hunger, thirst, and energy while ruling over your dinosaur’s ancient territory!\r\n\r\nTEN PLAYABLE DINOSAURS\r\nFor the first time ever, you can choose from multiple animals in a single game! Become any of ten famous dinosaurs and mammals like the Tyrannosaurus Rex, Velociraptor, Sabertooth Tiger, or even choose a flying dinosaur like the Pterodactyl or a swimming dinosaur like Mosasaurus! Each species has their own families, experience, and levels!\r\n\r\nDEADLY BOSS BATTLES\r\nTest your skills against SIX thrilling boss battles! A massive spined creature lurks in the murky water of the swamp! Engage in battle with the legendary Plesiosaur to claim dominance over it’s waters!\r\n\r\nBUILD YOUR PACK\r\nDominate other dinosaurs and recruit them to your pack! Customize and play as any Dinosaur in your pack and create a powerful family of predators!\r\n\r\nHATCH DINO EGGS\r\nBreed baby dinos that will grow into powerful members of your pack! Care for you eggs while they are hatching and then play as your new baby dinosaur!\r\n\r\nCUSTOMIZE YOUR DINOSAURS\r\nChoose your dino's name, appearance, skills, and attributes to complement your pack members and become a more powerful group!\r\n\r\nLEVEL UP YOUR DINOSAURS\r\nGain experience by defeating dangerous enemies, caring for your family, and completing missions! Level up your dinosaurs to increase their health and attack damage, earn points to upgrade your dinosaur’s stats, and increase the size of your pack!\r\n\r\nEARN STAT POINTS\r\nStat Points can be used to provide bonus’s to traits like Health, Critical Attack Chance, Run Speed, and much more!\r\n\r\nUPGRADEABLE BUFFS\r\nBuff Points can be used to upgrade your Roar and Snarl Buffs, which create temporary Stat Boosting auras around your dinosaur when active!\r\n\r\nRAGDOLL PHYSICS\r\nYour prey now realistically dangles from your claws as you carry them!\r\n\r\nDYNAMIC WEATHER AND DAY/NIGHT CYCLE\r\nProcedural weather system with unique storms, clouds, sunrise, sunset and the return of the cataclysmic Extinction Meteor Shower!\r\n\r\nMASSIVE REALISTIC 3D ENVIRONMENT\r\nRule over a world so big we created FIVE unique lairs for your dinosaurs to live in! Explore snow covered mountains, dense jungles, murky swamplands, beaches, and even hunt underwater!\r\n\r\nPREHISTORIC ENEMIES\r\nHunt down jurassic animals like the T. Rex, Raptor, Brachiosaurus, Pterodactyl, Triceratops, Stegosaurus, Ankylosaurus, Dilophosaurus, Allosaurus, Sabertooth Tiger, Mastodon, Plesiosaur, Spinosaurus, Mosasaurus, Gastornis, Parasaurolophus, Compsagnathus, and more!\r\n\r\nOPTIONAL BLOOD EFFECTS\r\nIf you are of age or have your parents permission, turn on the BRAND NEW blood effects for added combat ferocity!\r\n\r\nGLUTEN-FREE PROMISE\r\nWith all of our games you will always get the full game with no ads or additional purchases!\r\n\r\nDownload the Ultimate Dinosaur Simulator to transport yourself to the Jurassic era and survive in a world of gigantic predators as an all mighty Dinosaur!\r\n\r\nWhat's New:\r\n\r\n+ NEW: Water Options - Simple or HQ\r\n+ FIX: UI displaying correctly (no longer all black)\r\n+ FIX: Game Settings not saving\r\n+ FIX: Den icons appearing correctly\r\n+ FIX: No more falling beneath world\r\n+ FIX: DIlophosaurus now spits at enemies correctly\r\n+ IMPROVEMENT: Performance on LOW quality mode significantly increased\r\n\r\nMore info:\r\n \nhttps://play.google.com/store/apps/details?id=com.glutenfreegames.dinosaursimulatortwo","torrent":{"xt":"urn:btih:936e876512b338effad3081e159750ad2b43f48e","amp;dn":"Ultimate+Dinosaur+Simulator+v1.0.5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"936e876512b338effad3081e159750ad2b43f48e","infoHashBuffer":{"type":"Buffer","data":[147,110,135,101,18,179,56,239,250,211,8,30,21,151,80,173,43,67,244,142]},"announce":[],"urlList":[]}}