{"title":"Rigmar Radio Karaoke Collection 44600","uid":13470709,"size":1855973272,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:942e8de747374504490c75855d357a65305be5f5&amp;dn=Rigmar+Radio+Karaoke+Collection+44600&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rigmar_radio","files":601,"time":1454972748,"description":"300 Idioma español clásico Karaoke Pistas de la colección Rigmar en formato MP3 + CDG. Tenga en cuenta que no puedo hablar español, por lo que más errores pueden existir en estos archivos. Por favor, compruebe y editarlos según sea necesario.\r\n\r\nPor favor, no hay que ejecutar otras descargas, mientras que agarrar esta torrrent, ya que necesito su ancho de banda de subida para ayudar a las semillas de estos datos de manera oportuna. Por favor trate de no golpear y correr si usted es uno de los primeros compañeros para llegar al 100%, ya que es entonces necesito la velocidad de subida de la mayoría. Gracias por la siembra de usted. Muchos más españoles Karaoke por venir en los próximos días. Disfrutar:\r\n\r\nRigmar Radio - Rockin el mundo libre desde 1967\r\n\r\n300 Spanish Language classic Karaoke Tracks from the Rigmar Collection in CDG+MP3 format.   Note I can not speak Spanish, so more errors may exist in these files.  Please check and edit them as required.\r\n\r\nPlease do NOT RUN any other downloads while you grab this torrrent, as I need your upload bandwidth to help seed this data in a timely manner.  Please try to not hit and run if you are one of the first peers to reach 100% as it is then I need your upload speed the most.   Thank you for seeding.  Many more Spanish Karaoke to come in the next few days.  Enjoy:\r\n\r\nRigmar Radio - Rockin' the Free World since 1967","torrent":{"xt":"urn:btih:942e8de747374504490c75855d357a65305be5f5","amp;dn":"Rigmar+Radio+Karaoke+Collection+44600","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"942e8de747374504490c75855d357a65305be5f5","infoHashBuffer":{"type":"Buffer","data":[148,46,141,231,71,55,69,4,73,12,117,133,93,53,122,101,48,91,229,245]},"announce":[],"urlList":[]}}