{"title":"Jorge Ramos, &quot;Take a Stand: Lessons from Rebels&quot;","uid":14469377,"size":7574161,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9635c00030efa4e2d9b73249228843e6bfb0e1c5&amp;dn=Jorge+Ramos%2C+%26quot%3BTake+a+Stand%3A+Lessons+from+Rebels%26quot%3B&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Dr.Soc","files":1,"time":1461888689,"description":"Jorge Ramos, &quot;Take a Stand: Lessons from Rebels&quot;\r\nISBN: 1101989637 | 2016 | EPUB | 304 pages | 7 MB\r\n\r\n&quot;People ask if I am a journalist or an activist. The truth is that I am just a journalist who asks questions, but one who does in fact take a stand.&quot;—Jorge Ramos \r\n\r\nAfter 30 fascinating years uncovering the hard truth, Emmy Award-winning journalist Jorge Ramos opens up for the first time about life-altering lessons by sharing captivating never-before-told stories. Widely recognized for his unapologetic, no-holds-barred approach to interviewing global leaders, business titans, democratic policy makers and dictators who threaten to derail those principles, Ramos unearths their one common trait—they are all rebels. \r\n\r\nRebels are different. At some point they decided to challenge the prevailing status quo. Sometimes they rebelled to change a regime, other times to prevent abuse or discrimination, but in all cases they strived to correct an injustice.\r\n\r\nIn Take a Stand, Ramos looks back on groundbreaking interviews with rebels such as President Barack Obama, Supreme Court Justice Sonia Sotomayor, Spike Lee, Barbara Walters, Fidel Castro and more. Candid and at times controversial, Ramos draws invaluable awareness of issues that influence the mindset of the largest minority in the country and how they will undoubtedly shape not only Presidential elections but also the future of America","torrent":{"xt":"urn:btih:9635c00030efa4e2d9b73249228843e6bfb0e1c5","amp;dn":"Jorge+Ramos%2C+%26quot%3BTake+a+Stand%3A+Lessons+from+Rebels%26quot%3B","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9635c00030efa4e2d9b73249228843e6bfb0e1c5","infoHashBuffer":{"type":"Buffer","data":[150,53,192,0,48,239,164,226,217,183,50,73,34,136,67,230,191,176,225,197]},"announce":[],"urlList":[]}}