{"title":"Absolute Ass 2 (Jordan Septo, Exquisite) 2004 Split Scenes","uid":14619255,"size":1248924753,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9871cfdeee46012f5daed8437fa90732784ec236&amp;dn=Absolute+Ass+2+%28Jordan+Septo%2C+Exquisite%29+2004+Split+Scenes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"distinc","files":5,"time":1463247678,"description":"...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=8816583189\r\n \nhttp://imagedisco.net/?g=7431474095\r\n\r\n\r\nPlot:\r\n\r\nAbsolute Ass 2 gives you over 2 hours of all anal action! Hot bitches taking it up the ass, ATMs, gapers...if it's got to do with ass, then it's ass-olutely in this video! Along with all the anal action, there are hot threesomes, squirting girls and creamy facials in this non-stop hardcore fuck fest!\r\n\r\nSummary: Absolute Ass 2 is not going to be the best anal movie of the year but it does offer an alternative to some of the brightly lit gonzo productions or fetish laced weird stuff on the market today. The straightforward approach works for a lot of guys these days that don't need (or care for) semi-gay action as some companies are moving towards or all the kinky niche fetishes like smoking, foot fetish, double penetrations, and what have you. I think the strength of four of the scenes was worth a rating of Highly Recommended with only one weaker scene (and I wouldn't have kicked her out of bed either) to detract from the overall fun. The BTS extra was well done and even though I'd have appreciated more footage from some of the other gals, the thoroughness will be appreciated by fans of Rio more than anyone else. Give it a look and let me know if you have any comments since new directors tend to be forgotten about until they make it big (at which time, everyone forgets their earlier directing attempts).\r\n\r\nBody of Review: As one of the more productive reviewers of porn these days, I try to take a look at a variety of material in order to better judge what works, what doesn't, and why. By comparing and contrasting what you can buy, the end result is (hopefully) a means for consumers to get more of an idea as to the contents of a DVD than you can trust via the advertised box cover. Let's face it; I doubt the people who design box covers have seen the movies in question and most of what they say is pure marketing hype. That said, I found a lot to like when watching Absolute Ass earlier this year. Director Jordan Septo is a newcomer to directing porn and those of you who've watched newcomers come and go will know how much of a long shot such guys are for companies. Thankfully, the guy has some basic talent with which to work and that's half the battle. In the follow up volume of the series, Absolute Asses 2, his skills continue to refine and he offers up a host of even better gals for your viewing pleasure in the five scenes. If you want to watch anal antics with some of the best in the jizz bizz, you could do far worse than this one so with that said, here's a breakdown of the scenes by cast and action:\r\n\r\nDetailed Breakdown of Each Scene: Show\r\n\r\nJamie Brooks, Katja Kassin, Melissa Lauren, Nicki Hunter, Reina Leone, Rio Mariah","torrent":{"xt":"urn:btih:9871cfdeee46012f5daed8437fa90732784ec236","amp;dn":"Absolute+Ass+2+%28Jordan+Septo%2C+Exquisite%29+2004+Split+Scenes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9871cfdeee46012f5daed8437fa90732784ec236","infoHashBuffer":{"type":"Buffer","data":[152,113,207,222,238,70,1,47,93,174,216,67,127,169,7,50,120,78,194,54]},"announce":[],"urlList":[]}}