{"title":"The 2016 Diabetes World Summit, 18-24th April 2016","uid":14443313,"size":5632145964,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9a5d5c8e9e9e7186f159bea82b17031688c5dc84&amp;dn=The+2016+Diabetes+World+Summit%2C+18-24th+April+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":47,"time":1461701283,"description":"The 2016 Diabetes World Summit will help you understand and address:\r\n\r\n+ The root causes of all forms of diabetes and how to address them\r\n+ How to prevent and stop the progression of diabetes\r\n+ 10 of the most important strategies to help reverse type 2 diabetes\r\n+ The optimal diet to prevent, control and reverse type 2 diabetes\r\n+ Most effective forms of exercise for optimal blood sugar control\r\n+ Latest insights into understanding and correcting metabolic problems\r\n\r\nDay 1: Monday, April 18\r\nJonny Bowden, PhD, CNS - Using 'Smart Fat' to Balance Blood Sugar\r\nDeanna Minich, PhD - A Mind/Body Approach to Better Blood Sugar Control\r\nJody Stanislaw, ND - 3 Essentials to Lowering HbA1c Readings\r\nDr. Peter Osborne - Grain-Free Living for Optimal Health\r\nEric Westman, MD - The Low Carb, High Fat Diet for Diabetes\r\n\r\nDay 2: Tuesday, April 19\r\nLily Nichols, RDN, CDE, CLT - A Real Food Approach to Gestational Diabetes\r\nDr. Daniel Kalish - The Mitochondria and Metabolism\r\nMike Mutzel, MSc - How the Gut Affects Metabolic Health\r\nSarah Ballantyne, PhD - The Importance of Sleep for Blood Sugar Health\r\nDatis Kharrazian, DHSc, DC, FACN, CNS - New Scientific Insights into the Diabetes Continuum\r\n\r\nDay 3: Wednesday, April 20\r\nJohn Dempster, ND - How Mental Health Affects Blood Sugar and Diabetes\r\nFranziska Spritzler, RD, CDE - Exposing Common Diabetes Myths\r\nWilliam Curtis, MD - Diabetes Care from the Trenches\r\nDonna Gates, MEd, ABAAHP - Importance of Optimal Blood Sugar for Body Ecology\r\nMira and Jayson Calton, PhD - The Micronutrient Miracle for Blood Sugar Balance\r\n\r\nDay 4: Thursday, April 21\r\nDr. Josh Axe - 5 Keys To Reversing Type 2 Diabetes\r\nJJ Virgin - How to Break Sugar Cravings\r\nIzabella Wentz, PharmD - How Hashimoto’s and Hypothyroidism Affect Blood Sugar\r\nSteven Masley, MD - A Heart Specialist’s Perspective on Type 2 Diabetes\r\n\r\nDay 5: Friday, April 22\r\nDr. Eric Zielinski - Essential Oils for Blood Sugar Balance\r\nDr. Trevor Cates - Diabetes and the Skin\r\nAlan Christianson, NMD - The Adrenals and Diabetes\r\nSara Gottfried, MD - How to Balance Hormones for Better Blood Sugar\r\nPedram Shojai, OMD - The Urban Monk on Diabetes\r\n\r\nDay 6: Saturday, April 23\r\nDan Ritchie, PhD - How to Age Functionally\r\nJames Maskell - Is Diabetes a Social Genomic Phenomenon?\r\nAndrea Nakayama, CNE, CHHC, CNC - A Functional Approach to Nutrition for Blood Sugar\r\nDr. Eric Berg - The Adrenal Fatigue Connection to Diabetes\r\nRobert Lustig, MD - What Is Driving the Global Diabetes Pandemic?\r\n\r\nDay 7: Sunday, April 24\r\nLeanne Vogel, Holistic Nutritionist - The Power to End Food Obsession\r\nBen Greenfield, MS - Bio-hacking Blood Sugar\r\nSuzy Cohen, RPh - A Pharmacist’s Perspective on Solving the Type 2 Diabetes Crisis\r\nMark Hyman, MD - How to Lose Weight and Improve Blood Sugar by Eating Fat\r\n\r\nThis is critical information concerning the long term health of diabetics and should be freely available to the public. Please share and seed generously to keep this torrent alive for years to come. \r\n\r\nDownloaded from http://thediabetessummit.com/ on Monday, April 25, 2016","torrent":{"xt":"urn:btih:9a5d5c8e9e9e7186f159bea82b17031688c5dc84","amp;dn":"The+2016+Diabetes+World+Summit%2C+18-24th+April+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a5d5c8e9e9e7186f159bea82b17031688c5dc84","infoHashBuffer":{"type":"Buffer","data":[154,93,92,142,158,158,113,134,241,89,190,168,43,23,3,22,136,197,220,132]},"announce":[],"urlList":[]}}