{"title":"Attenboroughs.Passion.Projects.Complete.Series.EN.SUB.x265.MPup","uid":14628664,"size":1041272839,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9b31f94e776aebe115a4647ac997488e595b5d7b&amp;dn=Attenboroughs.Passion.Projects.Complete.Series.EN.SUB.x265.MPup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":8,"time":1463339248,"description":"Attenboroughs.Passion.Projects.Complete.Series.EN.SUB.HEVC.x265.WEBRIP.[MPup]\r\n\r\n[i][color=&quot;blue&quot;]This torrent is HEVC x26[/color][color=&quot;red&quot;]5[/color][/i]\r\n[b][color=&quot;purple&quot;]It is[/color] [color=&quot;orange&quot;][u]NOT[/u][/color] [color=&quot;purple&quot;]a x26[/color][color=&quot;red&quot;]4[/color] [color=&quot;purple&quot;]torrent[/color][/b][/size]\r\n[b]\r\n\r\nFormat: [b]This is a [i]HEVC x265 MKV[/i] file. You may need to update your video codecs to play this file.[/b]\r\n\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nAs part of a season of programming marking Sir David Attenborough's 90th birthday, four of his favourite films are brought together as the renowned naturalist looks back on his personal highlights.\r\n\r\n\t---------------------------------------------\r\n\r\nAttenboroughs.Passion.Projects.s01e01.A.Blank.on.the.Map\r\n\r\nFirst transmitted in 1971, A Blank on the Map is a unique record of a remarkable overland expedition into the heart of unknown territory in Papua New Guinea to make contact with a previously unknown tribe, the Biami.\r\n\r\nThe film follows David as he accompanies the assistant district commissioner and a team of over a hundred men as they battle through previously unexplored jungle the blank on the map. As the expedition spends several weeks mapping the forest, they encounter unusual wildlife such as tree kangaroos, the exotic goura pigeons and an emerald green tree python, but finding its people is the ultimate challenge.\r\n\r\nIn a specially shot introduction, David Attenborough recalls key moments from the journey and the magical encounter with the group of tribal people that eventually takes place, and gives a unique insight into what was to be one of the most adventurous trips of his life.\r\n\r\n\r\n\t---------------------------------------------\r\n\r\nAttenboroughs.Passion.Projects.s01e02.Lost.Gods.of.Easter.Island\r\n\r\n\r\nShown in 2000, The Lost Gods of Easter Island sees David Attenborough embark on a personal quest to uncover the history of a strange wooden figurine carving which turned up in an auction room in New York during the 1980s, which had been identified as originating from Easter Island.\r\n\r\nHe believed the carving's power and presence to be important and began an investigation to trace the origins of the artefact. Taking him on a global journey from Russia to Australia, from England back to the Pacific, David delves into the history of Easter Island and along the way tells the story of a forgotten civilization from one of the most remote places on Earth.\r\n\r\nIn a newly shot introduction, David explores how collecting objects, one of his great passions as a naturalist, has led to making some of his most personal films - including the Easter island carving and also a giant Madagascan egg.\r\n\r\n\t---------------------------------------------\r\n\r\n\r\nAttenboroughs.Passion.Projects.s01e03.Lost.Worlds.Vanished.Lives\r\n\r\nFirst transmitted in 1989, Lost Worlds, Vanished Lives showcases the world's major fossil sites. In a number of specially shot interviews, Attenborough introduces extracts from the series where he reveals ancient sea creatures, sabre-toothed predators and immense dinosaurs.\r\n\r\nGroundbreaking for its time and still as relevant now, David explores how fossils fire the imagination and teach us not just about the lives of long-extinct animals, from gentle giants like the brachiosaurs to the greatest predators ever to roam the earth - Tyrannosaurs, but also the world they lived in.\r\n\r\n\t---------------------------------------------\r\n\r\nAttenboroughs.Passion.Projects.s01e04.Darwins.Tree.of.Life\r\n\r\nFirst transmitted in 2009, Attenborough introduces a very personal film he made about the life, work and thesis of one of the greatest heroes of science and natural history - Sir Charles Darwin.\r\n\r\nThe film explores the key moments which enabled Darwin to formulate his ideas and reveals how his theory of evolution enabled for the first time a true understanding of how all life on earth relates","torrent":{"xt":"urn:btih:9b31f94e776aebe115a4647ac997488e595b5d7b","amp;dn":"Attenboroughs.Passion.Projects.Complete.Series.EN.SUB.x265.MPup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b31f94e776aebe115a4647ac997488e595b5d7b","infoHashBuffer":{"type":"Buffer","data":[155,49,249,78,119,106,235,225,21,164,100,122,201,151,72,142,89,91,93,123]},"announce":[],"urlList":[]}}