{"title":"The Laura Ingraham Podcast may 10 2016","uid":14584997,"size":34200051,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9c2879eb7896840a0d88c8140b3e48759a96ac7b&amp;dn=The+Laura+Ingraham+Podcast+may+10+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1462913586,"description":"The Laura Ingraham Podcast May 10, 2016 \r\n\r\nTHE LAURA INGRAHAM SHOW PODCAST\t\r\n\t(\r\nEd Rogers: 'Trump has taken the Republican Party to school on Immigration &amp; Trade' Tucker Carlson: 'Trump Is The Choice of Republican Voters; Current GOP Needs to Recognize \r\n\r\nGuest Lineup\r\nEd Rogers - Chairman of the lobbying and communications firm BGR Group; Washington Post Contributor\r\nTucker Carlson - Co-Founder &amp; Editor in Chief of The Daily Caller; Pundit for Fox\r\nFr. Douglas Bazi - Courageous Iraqi priest kidnapped and tortured by Islamists\r\nFr. Benedict Kiely - LifeZette Contributor, FaithZette\r\n\r\n\r\nTrump Is Right: Hillary Clinton Wants To Take Your Guns\r\n\r\nSpeaking at a rally in Washington state on Saturday, Donald Trump announced: &quot;Hillary Clinton wants to abolish the Second Amendment.&quot; He was correct: she does, unequivocally and by her own admission\r\n\r\n\r\nDemocrats, don't celebrate Trump's nomination. Fear it.\r\n\r\nI know the polls say Donald Trump cannot win. But what if we are looking at the wrong poll question?\r\nEd Rogers: 'Trump has taken the Republican Party to school on Immigration &amp; Trade'\r\n\r\nTucker Carlson: 'Trump Is The Choice of Republican Voters; Current GOP Needs to Recognize This'\r\n\r\n\r\nThe Spectre Of Mayor Khan's Islamist London\r\nOn a crisp, sunlit morning in March, I ceased to feel at home in London. It dawned on me that the city where I had been born 58 years ago was no longer safe.\r\n\r\nKerry Attacks Trump's Wall Proposal, Tells Northeastern Univ Grads to Prepare for 'Borderless World'\r\n\r\nOn Friday, Secretary of State John Kerry took a shot at likely presumptive GOP presidential nominee Donald Trump, particularly for his proposed border wall, during his commencement address at Northeastern University in Boston.\r\n\r\nRYAN'S CHALLENGER: Ryan has 'some nerve' not supporting Trump\r\n\r\nOn today's program, Rep. Paul Ryan's (R-WI) primary opponent, Paul Nehlen, discussed his campaign to unseat the Speaker of the House. Nehlen, who currently serves as Senior Vice President of Operations for Neptune Benson, explained, &quot;the reason I'm running for Congress is, Paul Ryan is the mercenary champion of this Trans Pacific Partnership, this job killing, industry destroying trade deal.&quot; Nehlen explained, &quot;in business, you succeed by under promising and over-delivering...But, in politics, you can fail year after year and yet, the corruption of Washington D.C. gets protected by big donor money.&quot; He hopes, by unseating the current speaker, to end that cycle of corruption","torrent":{"xt":"urn:btih:9c2879eb7896840a0d88c8140b3e48759a96ac7b","amp;dn":"The+Laura+Ingraham+Podcast+may+10+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c2879eb7896840a0d88c8140b3e48759a96ac7b","infoHashBuffer":{"type":"Buffer","data":[156,40,121,235,120,150,132,10,13,136,200,20,11,62,72,117,154,150,172,123]},"announce":[],"urlList":[]}}