{"title":"Fortress: Destroyer v1.0","uid":13038459,"size":77055800,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:9ca0ecfd4a7ccc691d012094293a48178fc5ca55&amp;dn=Fortress%3A+Destroyer+v1.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tiropitaki","files":1,"time":1450510490,"description":"Fortress: Destroyer v1.0 \r\n\r\nBuild the biggest, most blisteringly powerful battleship fleet imaginable, then fight back against the tyrannical Blackwater navy in this innovative action-RPG from the makers of Bloons TD 5.\r\n\r\nCRAFT YOUR SHIP\r\nChoose one of 3 ship classes, fill multiple gun slots with powerful weapons, and add Modules to get new abilities. Take your custom ship build into one of 15 missions, and unleash pure havoc as you target your weapons, ram enemies into gibs, and trigger ocean boiling special abilities. Earn resources and precious Blueprints with each victory, upgrade your ship, and build a fleet of up to 15 ships to wrest command of the seas away from your relentless enemy.\r\n\r\nFAST AND FURIOUS\r\nForget about slow ship simulations you've seen before - this is smooth, one-touch driving with the ability to dodge incoming fire, auto-target enemies, and line up nitro boosts for awesome ram combos.\r\n\r\nCRUSH YOUR ENEMIES\r\nBlackwater isn't going down without a fight - you'll face dozens of vicious enemies who can form a variety of deadly attack groups. Navigate past enemy turrets and fortifications to crush enemy-spawning factories. Then face off against huge armored boss ships that use every ounce of their firepower and their signature special attacks to send you to a watery grave.\r\n\r\nBUILD YOUR FLEET\r\n15 different ship types, 16 Bridges, 100+ weapons, and 75+ modules allow you to craft an incredible array of powerful ships. Use Fleet Squadron to call in two of your other ships to tackle tough objectives, or send other ships off on timed missions to come back with critical resources to help you grow even stronger.\r\n\r\nYOUR MISSION, IN A GRIM NEW WORLD\r\nIn 2063, vast ice shelves in western Antarctica broke free, crushing coastal cities beneath cataclysmic waves, overwhelming nuclear failsafes, and plunging the world into disease, mutation, economic collapse, and regional conflict. Governments crumbled, and in 2065, Aiden Black, head of the world's largest naval military contractor, Blackwater Enterprises, unleashed his stockpiled fleets and seized control of the seas.\r\n\r\nYou are a captain in the New Coastal Alliance, a coalition of surviving national and private fleets held together by the need to confront Blackwater. You must arm your ship, collect valuable Blueprints to build your strength, and assemble a fleet of warships mighty enough to challenge Blackwater and allow our world to rebuild.\r\n\r\nDownload and play now, Captain - your fleet awaits!\r\n\r\nRequired Android O/S : 4.0.3+","torrent":{"xt":"urn:btih:9ca0ecfd4a7ccc691d012094293a48178fc5ca55","amp;dn":"Fortress%3A+Destroyer+v1.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ca0ecfd4a7ccc691d012094293a48178fc5ca55","infoHashBuffer":{"type":"Buffer","data":[156,160,236,253,74,124,204,105,29,1,32,148,41,58,72,23,143,197,202,85]},"announce":[],"urlList":[]}}