{"title":"Farewell To The World - Marzio Baebagli","uid":13306388,"size":8808942,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9cdd90a1372e4dda06c6889e2abd881397db563b&amp;dn=Farewell+To+The+World+-+Marzio+Baebagli&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1453745483,"description":"What drives a person to take his or her own life? Why would an individual be willing to strap a bomb to himself and walk into a crowded marketplace, blowing himself up at the same time as he kills and maims the people around him? Does suicide or ‘voluntary death’ have the same meaning today as it had in earlier centuries, and does it have the same significance in China, India and the Middle East as it has in the West? How should we understand this distressing, often puzzling phenomenon and how can we explain its patterns and variations over time?\r\n\r\nIn this wide-ranging comparative study, Barbagli examines suicide as a socio-cultural, religious and political phenomenon, exploring the reasons that underlie it and the meanings it has acquired in different cultures throughout the world. Drawing on a vast body of research carried out by historians, anthropologists, sociologists, political scientists and psychologists, Barbagli shows that a satisfactory theory of suicide cannot limit itself to considering the two causes that were highlighted by the great French sociologist Émile Durkheim – namely, social integration and regulation. Barbagli proposes a new account of suicide that links the motives for and significance attributed to individual actions with the people for whom and against whom individuals take their lives.\r\n\r\nThis new study of suicide sheds fresh light on the cultural differences between East and West and greatly increases our understanding of an often-misunderstood act. It will be the definitive history of suicide for many years to come","torrent":{"xt":"urn:btih:9cdd90a1372e4dda06c6889e2abd881397db563b","amp;dn":"Farewell+To+The+World+-+Marzio+Baebagli","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cdd90a1372e4dda06c6889e2abd881397db563b","infoHashBuffer":{"type":"Buffer","data":[156,221,144,161,55,46,77,218,6,198,136,158,42,189,136,19,151,219,86,59]},"announce":[],"urlList":[]}}