{"title":"TeensLoveMoney ~ Cassidy Banks ** NEW 26 April 2016 ** mp4","uid":14440477,"size":189894731,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:9ecd13b20a642ebef82a2ff1ebe0af3e065b991a&amp;dn=TeensLoveMoney+%7E+Cassidy+Banks+%2A%2A+NEW+26+April+2016+%2A%2A+mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ImgSnaps","files":1,"time":1461674561,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/94y\r\n \nhttp://imgsnaps.com/image/94i\r\n \nhttp://imgsnaps.com/image/949\r\n\r\nThis girl Cassidy is truly unlucky. Shes lost with no directions, her boyfriend left her, and shes strapped for cash. Thats one of the worst trios of life positions anyone could ever be in. Luckily, she meets Tony who offers to help her out. They go back to his car and get to talking, and Tony asks her how bad she needs money. She responds with pretty bad, and tony just so happens to have fat stacks of twentys in his pocket, and is also quite intrigued by her body, so decides to make an offer: show me your tits for some extra cash. She thinks about it for maybe two seconds and whips those shoulder boulders out like its going out of style. Tony likes what he sees, and offers to put up some more cash if Cassidy is down to go a bit further. Of course she is! They go back to his place and he really gets his money worth. Getting sucked off by her plump pillow lips and getting to satisfy his sexual urges with her perfectly ripe body. Tony cums all over her chest and face, only to remind her that shes been truly worth all the cash he shelled out. She smiles, and doesnt forget to pick her dough up off the dresser before the walk of shame!\r\nTags:\r\nAfrican American, Bed, Bedroom, Big Ass, Big Dicks, BJ, Black, Blowjob, Booty, Brunette, Bubble Butt, Butt, Casual, Chubby, Crazy, Deepthroat, Doggystyle, Ebony, Facial, Girl Next Door, Handjob, Long Hair, Missionary, Natural Tits, Nympho, Pornstar, Sexy, Straight, Teen, Teen POV Public Hardcore Reality, Wild","torrent":{"xt":"urn:btih:9ecd13b20a642ebef82a2ff1ebe0af3e065b991a","amp;dn":"TeensLoveMoney+%7E+Cassidy+Banks+%2A%2A+NEW+26+April+2016+%2A%2A+mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ecd13b20a642ebef82a2ff1ebe0af3e065b991a","infoHashBuffer":{"type":"Buffer","data":[158,205,19,178,10,100,46,190,248,42,47,241,235,224,175,62,6,91,153,26]},"announce":[],"urlList":[]}}