{"title":"Five Nights at Freddy's World","uid":13280894,"size":242139517,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a0d15d449dea0100f9d24417c2d57fc2a905f3f1&amp;dn=Five+Nights+at+Freddy%27s+World&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"scorpionlion","files":7,"time":1453489705,"description":"Featuring the entire cast from the Five Nights at Freddy's series, this fantasy RPG will let players control their favorite animatronics in a an epic animated adventure!\r\n\r\nAbout This Game\r\nFeaturing the entire cast from the Five Nights at Freddy's series, this fantasy RPG will let players control their favorite animatronics in a an epic animated adventure!\r\n\r\nWith 40 playable characters, multiple endings, multiple difficulties, and a great soundtrack from artist Leon Riskin, FNaF World hits the ground running and doesn't stop. Take control of Freddy and the gang as they set out on a quest in the world beneath worlds, a world that reflects the actions and deeds of the &quot;flipside&quot;, where things have started becoming distorted and broken. Lead your team deeper into this digital world to find the source of these glitches and monsters, and restore it to what it was designed to be- a safe haven.\r\n\r\nBut be careful, behind the curtain there may be something even more sinister pulling the strings...\r\n\r\n-------------------------------------------------------------------------------------\r\n\r\nA few beginner’s tips:\r\n\r\nAlthough many parts of your quest will be self-explanatory, here are a few explanations for things that you might need some help with!\r\n\r\nBytes: Bytes are small animatronic helpers that you can buy with Faz Tokens (earned from battle). Purchase Bytes from Lolbit, who you can find in several locations around the world map. You can have four Bytes equipped at any time.\r\n\r\nChips: Chips have different effects in battle, ranging from attacks to healing commands. Find them in treasure chests scattered around the world map. You can have four chips equipped at once.\r\n\r\nHere are a few unusual battle commands and what they do:\r\n\r\nBirthday- Temporarily increases attack, defense, and speed. Very useful in the early parts of the game.\r\nWaterhose- Instantly kills enemies under 30% health.\r\nGiftboxes- Puts a gift-box at the feet of each of your team members. When they die, it will automatically bring them back to life with full health.\r\nHot Cheese- Put globs of hot cheese on the floor, doing damage-over-time to enemies.\r\nUnscrew- 30% chance of instant death to one enemy.\r\nEsc Key- Chance of death for all enemies on screen. (less likely to work than Unscrew)\r\nMystery Box- Swaps out all members of your party for random characters. They go back to normal after the battle is over.\r\nPrize Ball- Performs a random attack.\r\nJumpscare- Stuns enemies for a few seconds. Less effective on bosses.\r\nSystem Requirements\r\nMINIMUM: \r\nOS: Win XP, 7, 8, Vista, 10 \r\nProcessor: 2 GHz Intel Pentium 4 or AMD Athlon or equivalent \r\nGraphics: 1 GB \r\nStorage: 400 MB available space\r\n--------------------------\r\nInstall The Requirements in the Redist folder!\r\nMainly the dxwebsetup (Direct)","torrent":{"xt":"urn:btih:a0d15d449dea0100f9d24417c2d57fc2a905f3f1","amp;dn":"Five+Nights+at+Freddy%27s+World","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0d15d449dea0100f9d24417c2d57fc2a905f3f1","infoHashBuffer":{"type":"Buffer","data":[160,209,93,68,157,234,1,0,249,210,68,23,194,213,127,194,169,5,243,241]},"announce":[],"urlList":[]}}