{"title":"Rigmar Radio Karaoke Collection 45800","uid":13488072,"size":2409455994,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a2f0d2f4cefb296f22a3574a2025a4e6e17319b5&amp;dn=Rigmar+Radio+Karaoke+Collection+45800&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rigmar_radio","files":800,"time":1455100529,"description":"Esta es una gran descarga de 2,2 gigabytes. Por favor, no unirse a este enjambre si usted no ha conseguido buenas velocidades de descarga. Usted debe ser capaz de descargar en menos de un día. Si tarda más que eso, por favor, detener todas las otras descargas, si eso no funciona, entonces un chequeo de puertos están abiertos en el router. Si usted sufre de puertos bloqueados y puede acceder a sus enrutador van aquí para obtener ayuda con lo siguiente: http://www.setuprouter.com y buscar las instrucciones para acceder a su modelo.\r\n\r\n400 Lengua Española canciones de karaoke clásicos en el popular formato MP3 + CDG de la colección 2015 Rigmar Radio Internacional optomised para los buenos resultados de la búsqueda al reproducir en un PC o MAC. Nuevo en el 2015 ahora con la elección múltiples etiquetas en las canciones más populares del idioma Inglés.\r\n\r\nLos nombres de archivo y las etiquetas MP3 siguen los estándares de la industria para la denominación de archivos de música ... Artista - Título de la canción [cualquier información]\r\n\r\nRigmar Radio - Rockin el mundo libre desde 1967\r\n\r\nThis is a very large 2.2 Gigabyte download.  Please do not join this swarm if you have not got good download speeds.   You should be able to download this in less than a day.  If you take longer than that, please stop all other downloads, if that does not work then check your ports are open in your router.  If you suffer from blocked ports and can access your router go here for help with that:   http://www.setuprouter.com and look up the instructions for accessing your model.\r\n\r\n400 Spanish Language classic Karaoke songs in the popular CDG+MP3 format from the International Rigmar Radio 2015 collection optomised for good search results when playing back on a PC or MAC.  New in 2015 now with multiple label choice on the more popular English Language songs.\r\n\r\nFile names and MP3 Tags follow industry standards for the naming of Music files...  Artist - Song Title [Any Other Information] \r\n\r\nRigmar Radio - Rockin' the Free World since 1967","torrent":{"xt":"urn:btih:a2f0d2f4cefb296f22a3574a2025a4e6e17319b5","amp;dn":"Rigmar+Radio+Karaoke+Collection+45800","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2f0d2f4cefb296f22a3574a2025a4e6e17319b5","infoHashBuffer":{"type":"Buffer","data":[162,240,210,244,206,251,41,111,34,163,87,74,32,37,164,230,225,115,25,181]},"announce":[],"urlList":[]}}