{"title":"Brother Fuckers 2 [Desperate Pleasures] 2016 DVDRip","uid":14639715,"size":1951544744,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a416d879298189a6f729505ca1366f0ef9873c83&amp;dn=Brother+Fuckers+2+%5BDesperate+Pleasures%5D+2016+DVDRip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"distinc","files":6,"time":1463500839,"description":"...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=4263156741\r\n \nhttp://imagedisco.net/?g=4553168542\r\n\r\n\r\nPlot:\r\n\r\nSierra Simmons - My cousin Russel and I hooked when I was pregnant. One afternoon, Daddy was gone and Rus-sell came to see me. We teased and pleased each other fucking like crazy until I was exhausted from cumming. Russel came so hard it seemed like he was never going to stop which really made me happy. Russel exploded inside me and we fell asleep. Daddy caught us in bed and shocked us with a revelation. Russel was not my cousin he's actually my 1/2 brother. I guess that makes me a brother fucker just like my other sisters. Violet Monroe - Our parents left on a business trip so Connor and I had the house to ourselves. One morning I was looking in the fridge when my brother slipped up behind me and grabbed my ass. His touch made me forget about food and we started kissing right there in the kitchen. My brother threw me up on the counter and ate my muffin for breakfast. He pulled out his cock and fed me every inch. Connor took me from behind and when I came the second time my brother could not hold back and gave me a hot creampie for breakfast. Emma Evins - I asked my brother to help me with an art project. Daddy saw the mess and he sent us to the shower. One thing led to another and soon my brother was rubbing my bush. He fingered me and licked my pussy. Then he slid his big cock in my hairy pussy. He fucked me pretty hard and I came once more before Daddy yelled at us for taking too long. Poor Jason, I'll have to finish him off tonight after Daddy goes to bed. BONUS SCENE: Ashlynn Taylor and Chi Chi Medina Two sisters pull out all the stops vying for their brothers affections in a wild and intense family threesome.\r\n\r\n\r\nTitle: Sex Brother 2\r\nOriginal: Brother Fuckers 2\r\nYear: 2016\r\nGenre: Incest, Family Roleplay, Teens\r\nDirector: Desperate Pleasures\r\nStarring: Violet Monroe, Sierra Simmons, Emma Evins, Ashlynn Taylor, Chi Chi Medina.\r\n\r\nCountry: USA\r\nDuration: 1:34:00\r\nTranslation: English\r\n\r\nTechnical data\r\nQuality: DVDRip-AVC\r\nFormat: MP4\r\nVideo codec: H264\r\nVideo: 852x480 30.00fps 3024kbps\r\nAudio codec: AAC\r\nAudio: 127kbps","torrent":{"xt":"urn:btih:a416d879298189a6f729505ca1366f0ef9873c83","amp;dn":"Brother+Fuckers+2+%5BDesperate+Pleasures%5D+2016+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a416d879298189a6f729505ca1366f0ef9873c83","infoHashBuffer":{"type":"Buffer","data":[164,22,216,121,41,129,137,166,247,41,80,92,161,54,111,14,249,135,60,131]},"announce":[],"urlList":[]}}