{"title":"Northern Exposure  - (Complete Series with Original Music) - H26","uid":13324677,"size":26176007938,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a8fd165662be01633a1eb4cba72c1823ac79a3f6&amp;dn=Northern+Exposure++-+%28Complete+Series+with+Original+Music%29+-+H26&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":7,"uploader":"WindyTrees","files":111,"time":1453903993,"description":"These episodes were captured from CBC public television syndication of Northern Exposure which features all of the original music, which the official DVD did not:\r\n\r\n&quot;[Northern Exposure] DVD releases have caused controversy among the show's fans due to their high prices and the changes to the soundtrack introduced in order to lower their costs.[18] The release of Season 1 contained the original music, but retailed for $60 due to the cost of music licensing. Subsequent seasons replaced most of the music with generic elevator-style music, resulting in a lower-cost release. \r\n\r\n- source wikipedia (http://en.wikipedia.org/wiki/Northern_Exposure#DVD_releases)\r\n\r\nThese episodes, while not quite at the visual fidelity of the commercial DVD releases BUT do have all the important music included, and are unedited versions (unlike some reruns which were shown on A&amp;E and were cut to add more commercials). \r\n\r\nThe source of the rips where from the .VOB files that were once being sold in a DVD set through the mail by an individual by the name of Art Pattison. Art spent a good amount of time creating this set that he recorded off the CBC and trans-coded to DVD format. While we NX fans applaud the work of this individual, it is no longer the day &amp; age where one person can profit from piracy. This torrent was created to put the show back in the hands of the fans to enjoy the original series as it was created. \r\n\r\nI would also like to acknowledge the torrent uploader 'PoshFrosh', who so generously uploaded this series in .VOB format for all of us to share. While I think it's good to have the .VOB files (with menus &amp; extras) available for people to create a DVD sets of their own, this torrent here is a minimized amalgamation of PoshFrosh's set in a compressed format to offer a more manageable file size per episode, and the use of a deinterlaced filter, which removes the interlaced frames that are seen in the .VOB files which occur in older DVD technology. \r\n\r\nPlease do not complain about the quality, as the source material was already compromised as being created at a 352x480 resolution and recorded on what I am assuming was a DVD recorder. I made no attempts to enlarge the resolution in order preserve file sizes and image integrity (but did crop out the small amount of dead space that is seen in many of the .VOB files, which was not the same on all episodes, so episode dimensions may vary slightly). The episodes may seem a bit 'softer' than the.VOB versions. This is because of a slow deinterlacing filter that was applied during the rips. As mentioned above, this was needed to remove the interlacing of frames that occur in the DVD format for progressive frame viewing. If your player appears to play the episdoes stretched out vertically, please ensure your media player aspect ratio is set to 4:3. You will also need a codec &amp; media player, as well as hardware that supports the playing of h.265 files. \r\n\r\nSPECIAL NOTE ABOUT H265 FILES H265 files,,(noted from the master encoder JoyBell):\r\n\r\nThis next-generation video format/codec H.265/HEVC is one of the best and more advanced codecs than the current popular format H.264. It's named HEVC which stands for High Efficiency Video Codec and offers much better compression when comparing with H.264 (Lower file size, far better quality).\r\n\r\nIf you want to play this smoothly, you need to use a device/PC with at least dual-core processor.You have to update your player to latest version. Also if you use your PC to watch it, installing LAV Filter will help you a lot if you want to use KMPlayer or PotPlayer. Many updated players have native support for the codec.\r\n\r\nIf your Device doesn't support H.265 you can try updating your firmware or you can hook your Laptop or x265 compatible device to the TV with HDMI or Wireless connection and stream the video.\r\n\r\nDownload:\r\nKMPlayer - http://www.kmplayer.com/\r\nPot Player - http://potplayer.daum.net/\r\nMedia Player Classic - http://mpc-hc.org/ (RECOMMENDED)\r\nLAV Filters - https://github.com/Nevcairiel/LAVFilters/releases (installing this would help)\r\n\r\nVLC 2.1.5 does not play this file! update to VLC 2.2.1 or higher.\r\n\r\nTo play on Android, use MX Player\r\n\r\nMore info: \nhttp://x265.org/ \nhttps://en.wikipedia.org/wiki/High_Efficiency_Video_Coding\r\n\r\nThank you Art Pattison, and unloader PoshFrosh","torrent":{"xt":"urn:btih:a8fd165662be01633a1eb4cba72c1823ac79a3f6","amp;dn":"Northern+Exposure++-+%28Complete+Series+with+Original+Music%29+-+H26","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8fd165662be01633a1eb4cba72c1823ac79a3f6","infoHashBuffer":{"type":"Buffer","data":[168,253,22,86,98,190,1,99,58,30,180,203,167,44,24,35,172,121,163,246]},"announce":[],"urlList":[]}}