{"title":"Bengt Liljegren - Pink Floyd (Svensk Retail EPUB)","uid":13018679,"size":9111599,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a986429da903f005ecedd9ff21953d776c277893&amp;dn=Bengt+Liljegren+-+Pink+Floyd+%28Svensk+Retail+EPUB%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1450318667,"description":"Författare: Bengt Liljegren\r\n       Titel: Pink Floyd: Musiken, människorna, myterna \r\nUtgivningsår: 2011\r\n       Språk: Svenska\r\n        ISBN: 9789186675929\r\n      Format: Retail EPUB\r\n\r\nDetta är den häpnadsväckande historien om hur det gick till när ett undergroundband förvandlades till världens största rockgrupp!\r\n\r\nDet är 45 år sedan Pink Floyd bildades. Den legendariska rockgruppen fångar fortfarande tusentals nya lyssnare och år 2008 tilldelades de Polarpriset. Med tidlösa mästerverk som Dark Side of the Moon och The Wall förändrade de rockmusiken för alltid.\r\n\r\nHistorikern och musikern Bengt Liljegren presenterar här den nakna och inte alltid så smickrande historien om Pink Floyd från starten som coverband 1965 till den bejublade återföreningen vid Live 8-galan 2005 inför två miljarder tv-tittare. Och det är en story som rymmer långt mer än bara konstnärliga landvinningar: Den destruktiva rivaliteten mellan den diktatoriske basisten Roger Waters och den flegmatiske gitarristen David Gilmour. De nedtystade turerna om hur organisten Richard Wright sparkades ur bandet, men ändå fortsatte att medverka på konserterna. Nick Masons bräckliga självförtroende som trummis, som ledde till att han ersattes av studiomusiker under skivinspelningarna.\r\n\r\nI berättelsens fokus står kulthjälten Syd Barretts gripande öde. Sångaren och låtskrivaren som blev den psykedeliska rörelsens ikon: vacker, genialisk, men redan kort efter genombrottet sparkad ur gruppen och förklarad psykiskt otillräknelig. Var det resultatet av omfattande LSD-missbruk? Eller ett överlagt beslut att stiga av den kommersiella popkarusellen för att istället ägna sig åt måleri?\r\n\r\nPink Floyd har sålt över 100 miljoner album och uppträtt inför miljontals människor. Trots detta har de enskilda medlemmarna förblivit förvånansvärt anonyma. Inget rockband av sådan global dignitet har så framgångsrikt lyckats skydda sina privatliv","torrent":{"xt":"urn:btih:a986429da903f005ecedd9ff21953d776c277893","amp;dn":"Bengt+Liljegren+-+Pink+Floyd+%28Svensk+Retail+EPUB%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a986429da903f005ecedd9ff21953d776c277893","infoHashBuffer":{"type":"Buffer","data":[169,134,66,157,169,3,240,5,236,237,217,255,33,149,61,119,108,39,120,147]},"announce":[],"urlList":[]}}