{"title":"Philip Pullman - Trilogia Queste oscure materie [epub] [ita]","uid":13489532,"size":14517579,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9cec6088662425ab9280b9ccf3daff681d0a685&amp;dn=Philip+Pullman+-+Trilogia+Queste+oscure+materie+%5Bepub%5D+%5Bita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"i019s","files":18,"time":1455109831,"description":"Queste oscure materie.\r\n\r\nLa trilogia completa: La bussola d'oro-La lama sottile-Il cannocchiale d'ambra\r\n\r\ndi Philip Pullman (Autore), M. Astrologo (Traduttore), A. Tutino (Traduttore)\r\n\r\nimage\r\n\r\nLa bussola d'oro\r\nLyra vive al Jordan College di Oxford. Ma il mondo di Lyra è ben diverso dal nostro. Oltre l'Oceano c'è l'America, ma lo stato più importante di quel continente si chiama Nuova Francia; giganteschi orsi corazzati regnano sull'Artico; lo studio della natura viene chiamato &quot;teologia sperimentale&quot;. E soprattutto ogni essere umano ha il suo daimon: un compagno, una parte di sé, di sesso opposto al proprio, grazie al quale nessuno deve temere la solitudine. Ma questo mondo sta per attraversare un periodo critico\r\n\r\nLa lama sottile\r\nLyra, la giovanissima e intrepida protagonista della &quot;Bussola d'oro&quot;, sta per lasciare il suo mondo, popolato da streghe centenarie e fantomatici ingoiatori di bambini e denso di misteri. Lyra sta per giungere nel nostro mondo, dove, insieme al suo nuovo compagno di avventura, Will Parry, la aspettano altri incredibili incontri e la soluzione di alcuni misteri. Predestinata da secoli a salvare il mondo dalla distruzione, Lyra non si fermerà davanti ai pericoli e alle minacce che la attendono nella sua lunga marcia verso il vero...\r\n\r\nIl cannocchiale d'ambra\r\nDopo la &quot;Bussola d'oro&quot; e &quot;La lama sottile&quot; Philip Pullman conclude la trilogia con un nuovo libro, arricchendo il suo universo di nuovi personaggi i gallivespiani, orgogliosi guerrieri a cavallo di libellule dai colori sgargianti; i mulefa, strani animali che viaggiano su ruote, dotati di un linguaggio e della capacità di vedere la Polvere - e apre nuovi mondi, arrivando perfino nella terra della morte. Nel &quot;Cannocchiale d'ambra&quot; la storia diventa epica, sfrontata e dissacrante, esplora i recessi più profondi, supera i confini tra cielo e terra, in un'entusiasmante e insieme poetica unione di avventura, mito e religione.\r\n\r\nTorrent Hash: A9CEC608 8662425A B9280B9C CF3DAFF6 81D0A685","torrent":{"xt":"urn:btih:a9cec6088662425ab9280b9ccf3daff681d0a685","amp;dn":"Philip+Pullman+-+Trilogia+Queste+oscure+materie+%5Bepub%5D+%5Bita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9cec6088662425ab9280b9ccf3daff681d0a685","infoHashBuffer":{"type":"Buffer","data":[169,206,198,8,134,98,66,90,185,40,11,156,207,61,175,246,129,208,166,133]},"announce":[],"urlList":[]}}