{"title":"Iron Man Trilogy DVDrip NL By Jeffrey","uid":13042503,"size":5216707840,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ac014f687a076b5686f59b901ff40a521e0928a3&amp;dn=Iron+Man+Trilogy+DVDrip+NL+By+Jeffrey&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gljeffrey45","files":3,"time":1450545508,"description":"Iron Man Trilogy DVDrip NL By Jeffrey\r\n\r\nIron Man 1 (2008)DVDrip NL By Jeffrey\r\n\r\nVerenigde Staten\r\nActie / Sciencefiction\r\n126 minuten\r\n\r\ngeregisseerd door Jon Favreau\r\nmet Robert Downey Jr., Jeff Bridges en Gwyneth Paltrow\r\n\r\nTony Stark (Robert Downey Jr.) is een multimiljardair, industrialist en bovenal een geniale uitvinder. Hij wordt ontvoerd en gedwongen om een verschrikkelijk wapen te bouwen. In plaats daarvan construeert hij een ingenieus ijzeren pak waarmee hij weet te ontsnappen. Als hij terugkeert in de V.S. ontdekt hij een complot dat de stabiliteit van de wereld in gevaar brengt. Onder zijn alias Iron Man probeert hij het tij te keren.\r\n\r\nNL Subs\r\nAVI\r\n\r\nIron Man 2 (2010)BRrip NL By Jeffrey\r\n\r\nVerenigde Staten\r\nActie / Sciencefiction\r\n124 minuten\r\n\r\ngeregisseerd door Jon Favreau\r\nmet Robert Downey Jr., Mickey Rourke en Scarlett Johansson\r\n\r\nMultimiljardair en geniale uitvinder Tony Stark (Robert Downey Jr.), wordt zes maanden, nadat hij zijn identiteit als 'Iron Man' heeft onthuld, opnieuw gedwongen zijn krachten te bundelen. Nu de wereld bewust is van het feit dat Tony 'Iron Man' is, wordt hij door zowel de pers als de regering onder druk gezet om zijn uitvinding en technologie met het Amerikaanse leger te delen. Tony weigert informatie te onthullen, omdat hij bang is dat het in de verkeerde handen terecht zal komen. Met Pepper Potts (Gwyneth Paltrow) en James ''Rhodey'' Rhodes (Don Cheadle) aan zijn zijde, smeedt Tony nieuwe plannen en moet hij het opnemen tegen nieuwe, duistere en gevaarlijke machten. Het duurt dan ook niet lang voordat de uiterst gevaarlijke Rus Ivan Vanko a.k.a. 'Whiplash' (Mickey Rourke) van zich laat horen...\r\n\r\nNL Subs (instelbaar)\r\nMKV\r\n\r\nIron Man 3 (2013)BRrip NL By Jeffrey\r\n\r\nVerenigde Staten / China\r\nActie / Avontuur\r\n130 minuten\r\n\r\ngeregisseerd door Shane Black\r\nmet Robert Downey Jr., Guy Pearce en Gwyneth Paltrow\r\n\r\nSinds een intensieve strijd met buitenaards leven in New York heeft Tony Stark last van angstaanvallen en kan hij niet meer slapen. Hierdoor werkt hij bijna dag en nacht aan zijn Iron Man pakken en probeert steeds meer nieuwe dingen uit. Maar dan wordt de wereld opgeschrikt door een reeks aanslagen van de mysterieuze Mandarin. Tony besluit om de terrorist uit te dagen, waar deze op reageert door vol in de aanval te gaan. Tony ontdekt al snel dat niets is wat het lijkt en hij moet proberen al zijn kracht en kennis te verzamelen om de plannen van Mandarin tegen te gaan en zo zijn naasten te beschermen.\r\n\r\nNL Subs\r\nAVI\r\n\r\nBeste gebruikers,\r\nde torrents worden geüpload met een server, en voor de omschrijving ben ik dus afhankelijk van wat ik zelf  binnen krijg aan info.\r\nIk kan dus niet alles wat ik upload nalopen op fouten in de omschrijving.\r\nWaardeer je mijn uploads,laat dan even een commentaartje achter.\r\nTorrents uploaden is puur hobby voor mij.\r\n\r\nVeel plezier met de door jouw gedownloade torrent","torrent":{"xt":"urn:btih:ac014f687a076b5686f59b901ff40a521e0928a3","amp;dn":"Iron+Man+Trilogy+DVDrip+NL+By+Jeffrey","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac014f687a076b5686f59b901ff40a521e0928a3","infoHashBuffer":{"type":"Buffer","data":[172,1,79,104,122,7,107,86,134,245,155,144,31,244,10,82,30,9,40,163]},"announce":[],"urlList":[]}}