{"title":"The PreHistory of the Far side-a 10th anniversary (Art Cartoon)","uid":13468822,"size":52855422,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aca4fc8208f08dbb2c8813683aaa1f2f49b49d62&amp;dn=The+PreHistory+of+the+Far+side-a+10th+anniversary+%28Art+Cartoon%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"STBGD","files":1,"time":1454961742,"description":"Andrews and McMeel | 1989 | Pdf | Eng | 0836218515 | 288 pag | 50.4 MB\r\n\r\nGary Larson lives in Oregon with his wife and a Big dog. Although retired from his job as a daily syndicated cartoonist, he is now turning his graphical talent to new forms of technology.\r\n\r\nThe Far Side was syndicated in more than 1,900 daily newspapers from 1980 to 1995, when Gary Larson retired. During its run, the cartoon spawned 22 books from AMP, which were translated into a total of 17 different languages. For his work with The Far Side, Larson was awarded the Reuben Award for Outstanding Cartoonist from the National Cartoonists Society in 1991 and 1994. The group also named The Far Side Best Syndicated Panel in both 1985 and 1987.\r\n____\r\n\r\nIf you have ever wondered how Gary Larson started coming up with ideas for &quot;The Far Side,&quot; this book offers a retrospective back to Gary's childhood days. The book is divided into five portions. The first portion takes Gary's past from his first drawings to syndication of &quot;The Far Side.&quot; Along the path was a pre-Far Side comic called &quot;Nature's Way.&quot;\r\n\r\nIn the second part of the book Gary offers his original sketches and captions in comparison to how the comics actually came out. In most cases the final version was better, but not always. At the end of this portion of the book is a short section titled &quot;stories&quot; that is what it says, comics with a lengthy caption that is at the very least a short story. In some cases the caption could be a novel, if you think about the concept very long, which I do not recommend. You might suffer further brain damage.\r\n\r\nThe third part is really interesting. It shows how Gary or newspapers made mistakes. The mistakes were often subtle, sometimes blatant. Some of the more interesting mistakes happened when the caption of adjacent comic was switched with that of &quot;The Far Side.&quot;\r\n\r\nThe fourth portion of the book was humorous independent of the comics. Gary offers comments from various people offended by his art. Considering the art and the comments offered, I suggest that in many cases people saw something that was not there, which makes me wonder where THEIR mind was at. In other cases, people need to remember that Gary is offering a perspective on the world, in comparison to how people see things. It does not mean that Gary is interested in actually seeing the things in his comics happening; usually.\r\n\r\nThe fifth and last portion of the book offers Gary's favorites. I concur that most of them brought a smile to my face, and in a few cases an out right laugh","torrent":{"xt":"urn:btih:aca4fc8208f08dbb2c8813683aaa1f2f49b49d62","amp;dn":"The+PreHistory+of+the+Far+side-a+10th+anniversary+%28Art+Cartoon%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aca4fc8208f08dbb2c8813683aaa1f2f49b49d62","infoHashBuffer":{"type":"Buffer","data":[172,164,252,130,8,240,141,187,44,136,19,104,58,170,31,47,73,180,157,98]},"announce":[],"urlList":[]}}