{"title":"Rigmar Radio Karaoke Collection 42800","uid":13446820,"size":1819928163,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ae224160900e5acb0605781fb5e52f00bc211c78&amp;dn=Rigmar+Radio+Karaoke+Collection+42800&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rigmar_radio","files":600,"time":1454755853,"description":"THE LAW OF DIMINISHING RETURNS: A simple story based on FACT\r\n\r\n1. Your download speed of this torrent depends mostly on your ability to upload to the swarm while (as) you download.\r\n\r\n2. EVERY DOWNLOADING Torrent can have a minimum of 2 Peers who can use your upload bandwidth as you download. Often this is a LOT MORE, typically 5 to 7 upload slots per torrent.\r\n\r\n3. The MORE DOWNLOADING TORRENTS you have active at any single time then the SLOWER each will download as an individual torrent and the less help you will give the original seed and the swarm (fellow peers) you download from.\r\n\r\nIn effect you become a leech, only able to download at a fraction of your true speed but not seed worth a toss to those dozens of downloading torrents with there hundreds of upload slots.\r\n\r\nOVERLOADING YOUR BIT TORRENT CLIENTS WITH DOZENS OR EVEN HUNDREDS OF ACTIVE TORRENTS IS KILLING BIT TORRENT SPEEDS IN 2016. When you have finished with a torrent REMOVE IT FROM YOUR BIT TORRENT CLIENT. You can still keep the original torrent file and the data. You can still reload that torrent and seed the data at any time.... JUST CLEAR OUT YOUR CLIENT. This is not rocket science but common sense.\r\n\r\nThe Best time to seed is when you are not downloading anything !!!! Just in case you have never noticed that is what I do. I stop ALL SEEDING while I download each part until it has more seeds than peers, then I restart other seeds\r\n\r\nRigmar Radio - Attempting to educate the Bit Torrent user since 2003","torrent":{"xt":"urn:btih:ae224160900e5acb0605781fb5e52f00bc211c78","amp;dn":"Rigmar+Radio+Karaoke+Collection+42800","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae224160900e5acb0605781fb5e52f00bc211c78","infoHashBuffer":{"type":"Buffer","data":[174,34,65,96,144,14,90,203,6,5,120,31,181,229,47,0,188,33,28,120]},"announce":[],"urlList":[]}}