{"title":"United 2011 720p BluRay","uid":14636534,"size":1267871083,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:af7c892b9c56498561b832d4c953b347de530514&amp;dn=United+2011+720p+BluRay&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"goniix","files":1,"time":1463453357,"description":"The drama primarily focuses on the relationship between assistant manager Jimmy Murphy and the young player Bobby Charlton. The film begins in the autumn of 1956 as Murphy gives Charlton his first chance to play a match with Manchester United's first team, nicknamed the &quot;Busby Babes&quot; due to their unique pedigree as an almost entirely club-nurtured team of players, with the exception of a few slightly older players who have been purchased from other clubs.\r\n\r\nThe other players to come through the ranks and who feature greatly in the film include centre-half Mark Jones, left-half Duncan Edwards and right-half Eddie Colman. A rare signing is then made when Busby signs Northern Irish goalkeeper Harry Gregg in late 1957.\r\n\r\nMeanwhile, manager Matt Busby has persuaded Football League administrator Alan Hardaker to allow his team to play in the European Cup with the proviso that they are back in time for each scheduled fixture. They first compete for this title in the 1956-57 campaign after winning the league title, and are able to compete in the cup again the following season after retaining their domestic title.\r\n\r\nThe team sees success both at home and abroad. However, on the return flight from a European Cup match in Belgrade, their aeroplane crashes attempting to take off after refuelling in Munich, and seven of the club's players (including Mark Jones and Eddie Colman) are killed. Harry Gregg is instrumental in saving survivors from the wreckage of the plane, while Bobby Charlton suffers minor injuries, but Duncan Edwards and Matt Busby are seriously injured.\r\n\r\nCharlton is allowed to leave the hospital and return to England within a week, but Edwards and Busby remain in a critical condition at this stage. Jimmy Murphy was not on the plane when it crashed due to his duties with the Welsh national side, but flies out as soon as he can in order to visit his injured colleagues in hospital and travel home with Charlton.\r\n\r\nTwo weeks after the crash, Duncan Edwards dies in hospital, heaping fresh devastation on Bobby Charlton, who is ready to give up football until he has a visit from Jimmy Murphy and is soon playing for United again.\r\n\r\nAgainst the odds, Murphy vows to present a team to play their next home game and, ultimately, the 1958 FA Cup Final, taking charge of the first team until the following season as Busby recovers from his injuries","torrent":{"xt":"urn:btih:af7c892b9c56498561b832d4c953b347de530514","amp;dn":"United+2011+720p+BluRay","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af7c892b9c56498561b832d4c953b347de530514","infoHashBuffer":{"type":"Buffer","data":[175,124,137,43,156,86,73,133,97,184,50,212,201,83,179,71,222,83,5,20]},"announce":[],"urlList":[]}}