{"title":"Yehudi.Menuhin.Who.Was.Yehudi.EN.SUB.MPEG4.x264.WEBRIP.[MPup]","uid":14514608,"size":1053060576,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b1be2fbbcc2e3bdc26455abc9b909f719abcc1b4&amp;dn=Yehudi.Menuhin.Who.Was.Yehudi.EN.SUB.MPEG4.x264.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":2,"time":1462320503,"description":"BBC.Documentaries.2016.04.24.Yehudi.Menuhin.Who.Was.Yehudi.EN.SUB.MPEG4.x264.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\n\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nYehudi Menuhin was the twentieth century's greatest violinist. As famous as any Hollywood star, he even had songs written about him.\r\n\r\nA child prodigy, unmatched by his contemporaries, he achieved more by his teens than most artists do in a lifetime. But the man behind the violin was harder to know - his cocooned and curious childhood marked him emotionally for life.\r\n\r\nEndlessly touring and crossing continents and cultures, the man whose contract with EMI was the longest in the history of the music industry took classical music out of the concert hall because he believed music was for everyone and had the power to change lives.\r\n\r\nAn impassioned idealist, Yehudi wanted to give more to the world than music - he became a tireless figure fighting for the humanitarian issues he believed in.\r\n\r\nPresenter Clemency Burton-Hill was fifteen and a student at the Royal College of Music when Yehudi first heard her play and asked her to study with him. She says of that first lesson, 'We worked through pieces of Bach and Beethoven. And I walked out of there a better fiddle player. But I also came out with a sense that to be a truly great musician is about much more than just music...'\r\n\r\nIn this film, which commemorates the 100th year of Yehudi's birth, family members and close friends recall his extraordinary musical life, one in which he embraced jazz and Indian ragas as much as Bach, Beethoven and Bartok.\r\n\r\nAnd incredible home movies, some dating back to 1927 and many never seen before, take us on an intimate behind-the-scenes journey from his childhood in California, to meeting gypsies in Romania and travelling to India and beyond","torrent":{"xt":"urn:btih:b1be2fbbcc2e3bdc26455abc9b909f719abcc1b4","amp;dn":"Yehudi.Menuhin.Who.Was.Yehudi.EN.SUB.MPEG4.x264.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1be2fbbcc2e3bdc26455abc9b909f719abcc1b4","infoHashBuffer":{"type":"Buffer","data":[177,190,47,187,204,46,59,220,38,69,90,188,155,144,159,113,154,188,193,180]},"announce":[],"urlList":[]}}