{"title":"NubileFilms - Aiko Mai, Vinna Reed HD 1080p","uid":13335856,"size":858541901,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b288d7fea3fc2f58e60b779509ff4d19237c3dec&amp;dn=NubileFilms+-+Aiko+Mai%2C+Vinna+Reed+HD+1080p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ElitePorn","files":1,"time":1453986992,"description":"NubileFilms - Aiko Mai, Vinna Reed HD 1080p\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\nVinna Reed is feeling extra horny as she admires her slender figure that is clad in just a bra and thong in the mirror. When Aiko Mai gets up to do some admiring of her own, Vinna slips her hand into her underwear. Soon, Aiko is mimicking her blonde lover's movements.\r\n\r\nThe girls maintain eye contact as they masturbate in front of each other, working one another into a sensual frenzy. Aiko is the first to drop her thong to the ground. Naked except for her bra, she joins Vinna on the bed. Leaning forward, Aiko pulls Vinna's thong to the side and flicks her tongue out to sample her blonde lover's slick bald twat.\r\n\r\nLoving what she finds, Vinna settles in for an extended pussy feast. She drives Vinna towards a pleasurable peak, but doesn't let her fall quite yet. Instead, she takes the time to get both of them naked and to indulge in a few scorching kisses before laying Vinna down on the bed for a pussy ride that won't stop without a big climax.\r\n\r\nWhen her fingers find Vinna's bald twat nice and wet, Aiko doesn't hesitate to press two digits deep into her lover's tight snatch. The feeling of fullness and the delicious friction of Aiko's fingers and tongue leave Vinna moaning her pleasure in loud breathy gasps that get louder as she finally reaches the orgasm she has been chasing.\r\n\r\nAiko isn't any shyer about taking her turn than she was about giving her partner pleasure. Vinna remains on her back on the bed, so Aiko takes the opportunity to climb onto Vinna's face to go for a pussy ride on her lover's mouth. Soon Aiko is thrusting her hips and rubbing her clit while Vinna works her talented tongue in and out of Aiko's juicy fuck hole.\r\n\r\nAs her first climax roars through her, Aiko gradually falls forward. Her snatch remains planted near Vinna's mouth, but now Aiko is able to give pleasure as well as receive it. Soon the girls are locked in a lusty 69 that leaves them both pleasurably sated as they feast on each other's soft folds.\r\n\r\nIntent on giving Aiko the time of her life, Vinna flips onto her belly and arranges her brunette lover so that she is seated on the bed with her thighs parted. Aiko is happy to let Vinna lean in and press two fingers into her tight twat, but she needs just a bit more stimulation to really enjoy herself so she slips a hand down to show Vinna just how she likes her clit touched. Soon Vinna has gotten the hang of it with her tongue, leaving Aiko's hands free to squeeze her small tits.\r\n\r\nNow that her horny needs have been satisfied, Aiko is happy to give Vinna one more round of orgasmic joy to close out the afternoon. Spooning with her lover, Aiko reaches forward beneath one of Vinna's legs so that she can finger fuck the blonde's twat with slow but forceful strokes. Vinna spends some time playing with her own clit, but eventually she is happy to lie back and let Aiko do the work until her world explodes in ecstasy to end their lovemaking.\r\n\r\nScreenshots:\r\n~~~~~~~~~~~~ \nhttp://picturescream.asia/soft/GAf\r\n \nhttp://picturescream.asia/soft/GAz\r\n \nhttp://picturescream.asia/soft/GAR\r\n \nhttp://picturescream.asia/soft/GAT\r\n \nhttp://picturescream.asia/soft/GAY\r\n \nhttp://picturescream.asia/soft/GAu\r\n\r\n\r\nVideos Info:\r\n~~~~~~~~~~~~\r\nSize: 818 MB\r\nDuration: 17:48 min \t\r\nResolution: 1920x1080\r\n\r\n\r\nShow Your Appreciation - BitCoin: 1JxUQqRrvGC6txChvaZEbqSSsq9wtswoto","torrent":{"xt":"urn:btih:b288d7fea3fc2f58e60b779509ff4d19237c3dec","amp;dn":"NubileFilms+-+Aiko+Mai%2C+Vinna+Reed+HD+1080p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b288d7fea3fc2f58e60b779509ff4d19237c3dec","infoHashBuffer":{"type":"Buffer","data":[178,136,215,254,163,252,47,88,230,11,119,149,9,255,77,25,35,124,61,236]},"announce":[],"urlList":[]}}