{"title":"Hidden Secrets - Part 90 -Decoding the Past vol 2","uid":13467370,"size":5269628196,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b2a6102a9f3d3e40c1e59b1c452d23ec848cbb58&amp;dn=Hidden+Secrets+-+Part+90+-Decoding+the+Past+vol+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"POtHS11","files":30,"time":1454948381,"description":"Hidden Secrets - Part 90 -Decoding the Past vol 2\r\n\r\n\r\nThe Messiah - Prophecy Fulfilled (Christian Movie):\r\n2003 Crown Award Winner for Best Evangelistic Film.\r\nFew movies have captured the fulfillment of Jewish prophecy like The Messiah! This emotion-touching drama shows how one first century Rabbi (Yehudah, played by Nick Mancuso) becomes a follower of Yeshua of Nazareth (Jesus Christ). Yehudah attempts to share the Good News of Jesus with his people, beginning with his own relatives. Now, one year has passed since the crucifixion of the carpenter's son. Yehudah's greatest challenge and earnest desire is to help his loved ones understand that the long awaited Messiah, the Son of David, walked among them. Through the Passover feast spoken of by Moses, Yehudah reveals the meaning behind the meal while his relatives slowly awaken to the fact that God's chosen people crucified the very Messiah whose reign they have awaited so long.\r\n\r\nThe Messiah: Prophecy Fullfilled is an excellent tool for sharing with those who may grapple with who Jesus really was and is today.\r\n\r\nFor more details see the links,\r\n \nhttp://www.christiancinema.com/catalog/product_info.php?products_id=296\r\n\r\nRuntime: 50 mins\r\nLanguage: English (No-Subtitles)\r\nYear: 2004\r\nMy Rating: 10/10\r\nQuality: 10/10 \r\n\r\n---------------------------------------------------------------------------\r\n\r\nGod in Ancient China - Parts 1 &amp; 2 (English &amp; Chinese).\r\nMessage delivered by Rev. (Pastor) Kong Hee (City Harvest Church, Singapore), January/February 2009.  \r\n\r\nThis is the full length 2:12 hour presentation delivered by pastor Hee who examines the most ancient Chinese who developed their language, which is still used today, were once worshipers of The Father, Who art in heaven. A very interesting story of their past.\r\n-----------------------------------------------------------------------------------------------------------\r\n\r\nIntelligent Design vs Evolution, When Worldviews Collide:\r\nStephen C. Meyer, PhD, presents evidence on the historical science perspective and the 19th century's rise of its adversary called evolution.  In this funny, yet insightful presentation, Dr. Meyer astutely critiques the problems that our children face as the battle of the sciences is biasly presented in the classroom.\r\n-----------------------------------------------------------------------------------------------------------\r\n\r\nCS Lewis on Intelligent Design:\r\nCS Lewis provides a brief commentary on the dynamics of Intelligent Design theory showing how all things were indeed created by a grand designer.\r\n-----------------------------------------------------------------------------------------------------------\r\n\r\nVoices of the Farhud - The 1940 Muslim Genocide of Jews:\r\nMuslim efforts to exterminate the Jewish people from the world all together is an Islamic duty laid out in the Koran and started in 622 AD. Millions of Jews have been killed since the Islamic prophet was born. So much so that their entire world population in the whole world today is no more than 13 million while the entire Arab peninsula used to be Jewish land.\r\n\r\nBut it is not only Jewish people who are target of this extreme racism. It is applied anyone who does not bend to Islam and live under Sharia. For this reason we see the expansion of the Arab Spring, the Muslim effort to re-awaken the Caliphate and remove any religion or rule that is considered non-Islamic.\r\n\r\nFarhud (Arabic ??) refers to the pogrom or &quot;violent dispossession&quot; carried out against the Jewish population of Baghdad, Iraq, on June 1--2, 1941. The riots occurred in a power vacuum following the collapse of the pro-Nazi government of Rashid Ali while the city was in a state of instability. Before British and Transjordanian forces arrived, around 2,000 Jews were killed and 1,000's injured. Looting of Jewish property took place and thousands of Jewish homes were destroyed. The actual numbers may be much higher as Arabs lowered the actual figures.\r\n\r\nLike the Muslim Armenian genocide of over 2 million Christians, the mass murders and numbers have been ignored as insignificant to Muslim leaders. Why? Because kafirs, a non-Muslim has no official rights or value within Islam, so the murder of non-Muslims is nothing to pay attention to","torrent":{"xt":"urn:btih:b2a6102a9f3d3e40c1e59b1c452d23ec848cbb58","amp;dn":"Hidden+Secrets+-+Part+90+-Decoding+the+Past+vol+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2a6102a9f3d3e40c1e59b1c452d23ec848cbb58","infoHashBuffer":{"type":"Buffer","data":[178,166,16,42,159,61,62,64,193,229,155,28,69,45,35,236,132,140,187,88]},"announce":[],"urlList":[]}}