{"title":"Surface Activity of Petroleum Derived Lubricants","uid":14634889,"size":2144381,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2df7870faf57923bf651f0d02d38e60457ebf22&amp;dn=Surface+Activity+of+Petroleum+Derived+Lubricants&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1463430775,"description":"Surface Activity of Petroleum Derived Lubricants - Lilianna Z. Pillon (CRC, 2011).pdf\r\n\r\nISBN 978-1-4398-0341-7\r\n\r\nHundreds of lubricant additives are available industry-wide to improve base stock properties and protect metal surfaces; however, the wrong combination of these commodities can result in substandard performance. Surface Activity of Petroleum Derived Lubricants explains how surface activity is affected by several factors: the interfacial properties of lube oil base stocks at oil/surface interfaces, lubricant solvency properties, additive interactions, and variations in temperature. The book provides an understanding of these factors that will influence proper selection of base stocks and additives necessary for resisting foaming and air entrainment, inhibiting rust and corrosion, preventing wear, and controlling emulsification and demulsification.\r\n\r\nUsing 300 tables to provide experimental data from books, journals, and the patent literature, this practical and comprehensive reference examines:\r\n\r\nthe refining of lube oil base stocks\r\nthe chemistry of additives\r\nthe formulation technology of lubricants\r\nthe performance of the most important finished products such as turbine oils, hydraulic fluids, and engine oils\r\nInsight into these variables enables petroleum chemists and engineers to choose the right lubricant base stock and additive combination. By becoming aware of these important elements, those in industry are better able to make the right choices, leading to reduced costs, improved performance, and better management of production timelines","torrent":{"xt":"urn:btih:b2df7870faf57923bf651f0d02d38e60457ebf22","amp;dn":"Surface+Activity+of+Petroleum+Derived+Lubricants","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2df7870faf57923bf651f0d02d38e60457ebf22","infoHashBuffer":{"type":"Buffer","data":[178,223,120,112,250,245,121,35,191,101,31,13,2,211,142,96,69,126,191,34]},"announce":[],"urlList":[]}}