{"title":"Hydrofracking - What Everyone Needs to Know","uid":14633549,"size":1078578,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2e69dae960c7a48e4c57e8d4c886223326737e8&amp;dn=Hydrofracking+-+What+Everyone+Needs+to+Know&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1463399498,"description":"Hydrofracking - What Everyone Needs to Know - Alex Prud’homme (OUP, 2013).pdf\r\n\r\nISBN 9780199311255\r\n\r\nConstantly in the news and the subject of much public debate, fracking, as it is known for short, is one of the most promising yet controversial methods of extracting natural gas and oil. Today, 90 percent of natural gas wells use fracking. Though highly effective, the process-which fractures rock with pressurized fluid-has been criticized for polluting land, air, and water, and endangering human health.\r\n\r\nA timely addition to Oxford's What Everyone Needs to Know® series, Hydrofracking tackles this contentious topic, exploring both sides of the debate and providing a clear guide to the science underlying the technique. In concise question-and-answer format, Alex Prud'homme cuts through the maze of opinions and rhetoric to uncover key points, from the economic and political benefits of fracking to the health dangers and negative effects on the environment. Prud'homme offers clear answers to a range of fundamental questions, including: What is fracking fluid? How does it impact water supplies? Who regulates the industry? How much recoverable natural gas exists in the U.S.? What new innovations are on the horizon? Supporters as diverse as President Obama and the conservative billionaire T. Boone Pickens have promoted natural gas as a clean, &quot;21st-century&quot; fuel that will reduce global warming, create jobs, and provide tax revenues, but concerns remain, with environmental activists like Bill McKibben and others leading protests to put an end to fracking as a means of obtaining alternative energy. Prud'homme considers ways to improve methods in the short-term, while also exploring the possibility of transitioning to more sustainable resources-wind, solar, tidal, and perhaps nuclear power-for the long term.\r\n\r\nWritten for general readers, Hydrofracking clearly explains both the complex science of fracking and the equally complex political and economic issues that surround it, giving readers all the information they need to understand what will no doubt remain a contentious issue for years to come.\r\n\r\nWhat Everyone Needs to Know® is a registered trademark of Oxford University Press","torrent":{"xt":"urn:btih:b2e69dae960c7a48e4c57e8d4c886223326737e8","amp;dn":"Hydrofracking+-+What+Everyone+Needs+to+Know","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2e69dae960c7a48e4c57e8d4c886223326737e8","infoHashBuffer":{"type":"Buffer","data":[178,230,157,174,150,12,122,72,228,197,126,141,76,136,98,35,50,103,55,232]},"announce":[],"urlList":[]}}