{"title":"[Classic]Heavy Load (1975)","uid":13004928,"size":738805222,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b35e67f06708e39729f1847f5d4d4bd1d40a1688&amp;dn=%5BClassic%5DHeavy+Load+%281975%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hunter534","files":1,"time":1450217500,"description":"Gus is married to a sensationally sexy lady. In fact, she wants him to stay home from work and warm the cockles of her heart. But Gus is a truck driver, and he's got deliveries to make. Peeling out of her lusty clutch, he drives to his first drop-off. It's a photo studio. The photographer, a sizzling cover girl, has eyes for Gus. In the click of a zipper, he's overexposed. It's a hot session, and Gus is temporarily tired. He guns his motor and makes it back to the van. No sooner has he hit the pavement he stops. Two delicious young girls all alone on the highway? What can he do? He has to help them out! The nimble nymphets pull Gus over, rev him up, and melt him down in the fastest heat ever. Gus gives them a ride, then pulls into a truckstop. He's got to have a cup of coffee. But he gets mixed up in a brawl. The voluptuous waitress gathers hurt Gus tenderly to her breast, bundles him into the ladies' room, and heals his bruised body with some steam of her own. Feeling much better, Gus decides to go home. But he spots a girl trying to fix a flat. Gus pulls over to help. Minutes later he's all tied up. This slick chick has him licked, while her kinky husband looks on in delight. Needless to say, Gus is late for dinner--but he cooks up a little dessert for his lady she'll never forget! \r\n\r\nVideo: Xvid 576x432 29.97fps 1352Kbps [Stream 00]\r\nAudio: MPEG Audio Layer 3 48000Hz mono 64kbps [Stream 01]\r\nDuration: 01:08:57\r\nSize: 704 MB\r\nCountry: USA\r\n\r\nCast: Jamie Gillis, Jeffrey Hurst, Billy Joe, Helen Madigan, Samantha McLaren, Susan Sloan...\r\n\r\nCOVER+SCEENSHOT:\r\n \nhttp://photo-up.info/img-567081dd1c442.html \r\n \nhttp://myimg.info/img-567081d637692.html","torrent":{"xt":"urn:btih:b35e67f06708e39729f1847f5d4d4bd1d40a1688","amp;dn":"%5BClassic%5DHeavy+Load+%281975%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b35e67f06708e39729f1847f5d4d4bd1d40a1688","infoHashBuffer":{"type":"Buffer","data":[179,94,103,240,103,8,227,151,41,241,132,127,93,77,75,209,212,10,22,136]},"announce":[],"urlList":[]}}