{"title":"OH! RPG! 2015 repack Mr DJ","uid":13011339,"size":505871848,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b38354daaff19ec809e59d14471e2d773143cb88&amp;dn=OH%21+RPG%21+2015+repack+Mr+DJ&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rock840","files":2,"time":1450257838,"description":"Title: OH! RPG!\r\n Genre: Adventure, Casual, Indie, RPG, Strategy\r\n Developer: RosePortal Games \r\n Publisher: Aldorlea Games \r\n Release Date: 12 Dec, 2015\r\n Language: English \r\n\r\nAbout This Game\r\n\r\nPresentation\r\n Deep enough for the veteran roleplayer... Humorous enough for the casual gamer! \r\n OH! RPG! is a quirky, innovative and colorful adventure by RosePortal Games (of Epic Quest and Whisper of a Rose fame) and released on Steam by RPG veteran Aldorlea Games. \r\n The game consists of 8 chapters, each with a different atmosphere, gameplay and protagonist, all contributing to an exciting and fresh experience. \r\n Mixing elements of parody and great use of interaction with an enthralling storyline, this game is a quality blend of pure RPG goodness - but with an unique twist! \r\n\r\nPlot\r\n\r\n Heroes always win. But what happens to those who don't? \r\n The world is coming to an end and the heroes return home after their ludicrous failure, to be with loved ones for whatever's left. \r\n Except this time you're not going to play them. Who wants to play failures anyway? \r\n In OH! RPG!, traditional roles are reversed. You play the NPCs and help the heroes along the way. \r\n -See the story from another perspective and embark with a new protagonist in each of the 8 chapters \r\n -Travel from front to back, from awe-inspiring castles to your remote peasant village, from enemies super strong and big, to end up proudly defeating... pathetic slimes? \r\n -Enjoy a collection of unique protagonists such as an upbeat Jester, a quickwitted Goblin or even the Hero's own family, as you interact with them in an innovative way \r\n -Visit 8 chapters, all with a different style and optional content to discover!\r\n Features\r\n -Unique battles using the special skill &quot;Hero Calls&quot;: Harold, Therese, Marsha and Lucius are never in battle, but you can call them and wait until they arrive, and they will perform one powerful move - this is different for each battle depending on where they are in the story \r\n -End-level ratings based on performance \r\n -Stage selection to replay levels and improve your ratings in each \r\n -Global User Rank based on overall end-level results - unlock goodies with higher scores! \r\n -Collect material to upgrade the power/efficiency of your weapons, armor and potions \r\n -Unlock skills of RPG Maker History like Call Ralph!, Mapping Tool or Summon Don Miguel \r\n -FREE license original resources for everyone who purchases the game to use - includes 4 side-view monsters, some side-view battlers, tileset, charsets, and even the airship above!* \r\n -Steam Achievements &amp; Steam Trading Cards! \r\n -Mouse, keyboard and gamepad/controller fully supported, with non-invasive full screen or windowed mode and higher resolution graphics\r\n\r\nSystem Requirements\r\n\r\n Minimum: \r\n OS: Windows XP/Vista/Windows 7/8/8.1/10 (32bit/64bit) \r\n Processor: 1.6 GHz \r\n Memory: 128 MB RAM \r\n Graphics: DirectX 9.0 Compatible \r\n DirectX: Version 9.0 \r\n Storage: 800 MB available space \r\n Sound Card: DirectX 9.0 Compatible Sound \r\n\r\n**INSTALL INSTRUCTIONS:\r\n\r\nOpen OH! RPG!.exe , wait for a bit for the self extractor to open, specify the directory where u want to extract the game folder, open the extracted folder and play.....\r\n OR\r\nExtract it yourself using 'WinRAR'\r\n\r\nAlways open the game using run as administrator\r\n\r\nCheck my FB page for more :\r\nMr DJ repacks","torrent":{"xt":"urn:btih:b38354daaff19ec809e59d14471e2d773143cb88","amp;dn":"OH%21+RPG%21+2015+repack+Mr+DJ","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b38354daaff19ec809e59d14471e2d773143cb88","infoHashBuffer":{"type":"Buffer","data":[179,131,84,218,175,241,158,200,9,229,157,20,71,30,45,119,49,67,203,136]},"announce":[],"urlList":[]}}