{"title":"Stargate Atlantis - Season 04 - Episodes 11 thru 20","uid":14607130,"size":9134342790,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b4c002e80d5881657d0e49b64a97b97a8447d862&amp;dn=Stargate+Atlantis+-+Season+04+-+Episodes+11+thru+20&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":23,"time":1463101962,"description":"Stargate Atlantis - Season 04 - Episodes 11 thru 20\r\n\r\n\r\n\r\nBe All My Sins Remember'd\r\nThe Atlantis team decides to attack the numerous ships of the Replicators, with the help of uneasy alliances.\r\nWatch Now or On Disc \r\n$0.00 with Prime Video + 1 more\r\n \r\n Spoils of War S4, Ep12\r\n11 Jan. 2008 Spoils of War\r\nA transmission from space leads the team to the discovery of a breeding ground for Wraith soldiers.\r\nWatch Now or On Disc \r\n$0.00 with Prime Video + 1 more\r\n \r\n Quarantine S4, Ep13\r\n18 Jan. 2008 Quarantine\r\nThe entire city locks down for a false quarantine, leaving people stranded with a decreasing amount of oxygen, while Rodney is unable to reach a computer.\r\nWatch Now or On Disc \r\n$0.00 with Prime Video + 1 more\r\n \r\n Harmony S4, Ep14\r\n25 Jan. 2008 Harmony\r\nSheppard and McKay must escort a prospective queen as part of their diplomatic duties, unaware that an ambush has been set by some familiar enemies.\r\n \r\n Outcast S4, Ep15\r\n1 Feb. 2008 Outcast\r\nAfter returning to Earth for his father's funeral, John Sheppad discovers the existence of a human form replicator loose in the population.\r\n \r\n Trio S4, Ep16\r\n8 Feb. 2008 Trio\r\nKeller, Carter and McKay are stranded in an abandoned Genii mine while off-world.\r\nWatch Now or On Disc \r\n$0.00 with Prime Video + 1 more\r\n \r\n Midway S4, Ep17\r\n15 Feb. 2008 Midway\r\nThe IOA is conducting interviews back on Earth to ensure that any personnel serving on Atlantis (in particular, aliens) are suitable for their roles. The episode opens up with a pregnant Teyla having been interviewed and reporting back to Atlantis. Ronon is next. Col. Carter is unsure about Ronon's ability to handle the IOA's interview and therefore asks Teal'c to come to Atlantis in a coaching capacity for Ronon. After a rocky start to their relationship, Ronon and Teal'c return to Earth, via the series of Stargates and a Midway Station, that McKay had previously ...\r\nWatch Now or On Disc \r\n$0.00 with Prime Video + 1 more\r\n \r\n The Kindred: Part 1 S4, Ep18\r\n22 Feb. 2008 The Kindred: Part 1\r\nA plague of sorts is spreading across the Pegasus galaxy and Dr. Keller estimates that hundreds of thousands will die if they don't don't find a way to stop it. Her research shows however that the disease's origin is with the Hoff, who had been working on a way to kill the Wraith. Sheppard and the others think they know who might be spreading the virus and why. Teyla meanwhile believes she is receiving messages from Kanaan, the father of her child. She's getting his messages while sleeping and most think she's just dreaming. She follows the clues he gives her but she ...\r\nWatch Now or On Disc \r\n$0.00 with Prime Video + 1 more\r\n \r\n The Kindred: Part 2 S4, Ep19\r\n29 Feb. 2008 The Kindred: Part 2\r\nSlowly, everyone on Atlantis comes to terms with the sudden re-appearance of Dr. Carson Beckett who, he claims, has been Michael's prisoner for some two years. He tells them what he was doing in Michael's laboratory and they set off to find the kidnapped Teyla. Dr. Keller figures out just how he's come to there at all. Sheppard meanwhile has been using all of his contacts to try and locate Teyla but they come across someone from the past. Teyla in turn has found some of the Athosians alive but they are few in number as a result of Michael's experiments. Michael ...\r\nWatch Now or On Disc \r\n$0.00 with Prime Video + 1 more\r\n \r\n The Last Man S4, Ep20\r\n7 Mar. 2008 The Last Man\r\nAfter yet another fruitless search for the missing Teyla, Sheppard returns to Atlantis, only to find it deserted. Worse yet, the city isn't just abnormally hot, but the entire ocean has completely dried up, leaving a sandy desert! Sheppard then finds a hologram of an aged Dr. McKay, telling him that a solar flare had sent him 48,000 years into the future. Once he learns the demise of Atlantis and everyone on it, and worse yet that the sun in the solar system is dying and he won't survive there much longer, he and the holographic McKay must find a way to send Sheppard","torrent":{"xt":"urn:btih:b4c002e80d5881657d0e49b64a97b97a8447d862","amp;dn":"Stargate+Atlantis+-+Season+04+-+Episodes+11+thru+20","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4c002e80d5881657d0e49b64a97b97a8447d862","infoHashBuffer":{"type":"Buffer","data":[180,192,2,232,13,88,129,101,125,14,73,182,74,151,185,122,132,71,216,98]},"announce":[],"urlList":[]}}