{"title":"BiniSoft Windows Firewall Control v4.6.0.0","uid":13288321,"size":315332,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b4c05229d3a4cb120c306b305e8352c82d60df64&amp;dn=BiniSoft+Windows+Firewall+Control+v4.6.0.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ZarkBit","files":1,"time":1453569541,"description":"BiniSoft Windows Firewall Control v4.6.0.0\r\n\r\nWhat's new in version 4.6.0.0 (01.01.2016)\r\n\r\n- Improved: Many PNG images from the user interface have been replaced with scalable\r\nvector images in order to improve the scalling and the effects. The readability of \r\nthe user interface was increased for the cases when bright colors are used or high \r\ncontrast Windows themes.\r\n- Improved: The logic behind the Display combo box from Connections Log was updated \r\nto improve the speed when loading the most recent entries.\r\n- Fixed: In Windows 10, if the network is not initialized when the service is starting, \r\nthe service may appear to be started normally even if it is in faulted state. Now, \r\nthe service closes properly if it fails on startup and will be automatically restarted \r\ncorrectly.\r\n- Fixed: The parser for Security log entries reads and displays wrong remote addresses \r\nin Connections Log for some operating systems which are not in English language.\r\n.\r\n.\r\n.\r\n.\r\n\r\nWindows Firewall Control - Managing Windows Firewall is now easier than ever\r\nProgram Overview\r\n\r\nWindows Firewall Control is a powerful application which extends the functionality of the Windows Firewall and provides quick access to the most frequent options of Windows Firewall. It runs in the system tray and allows user to control the native firewall easily without having to waste time by navigating to the specific part of the firewall. This is the best tool to manage the native firewall from Windows 10, 8.1, 8, 7, Vista, Server 2008, Server 2012. Windows Firewall Control offers four filtering modes which can be switched with just a mouse click:\r\n\r\nHigh Filtering - All outbound and inbound connections are blocked. This setting blocks all attempts to connect to and from your computer.\r\nMedium Filtering - Outbound connections that do not match a rule are blocked. Only the programs that you allow can initiate outbound connections.\r\nLow Filtering - Outbound connections that do not match a rule are allowed. The user can block the programs he doesn't want to allow initiating outbound connections.\r\nNo Filtering - Windows Firewall is turned off. Avoid using this setting unless you have another firewall running on your computer.\r\nProgram Features\r\n\r\n√ Intuitive and easy accessible interface in the system tray, next to the system clock.\r\n√ Full support with standard user accounts. Elevated privileges are required only at installation.\r\n√ Disable the ability of other programs to add Windows Firewall rules.\r\n√ Multiple and easier ways of creating new rules in Windows Firewall.\r\n√ Integrated support of creating, modifying and deleting Window Firewall rules.\r\n√ Lock feature which can disable the access to the settings of the program and Windows Firewall.\r\n√ Shell integration into the right click context menu of the executable files.\r\n√ Display invalid rules with the possibility to delete them very quickly.\r\n√ Merge multiple similar rules or duplicate existing ones.\r\n√ Search for executable files through folders and create new rules in seconds.\r\n√ View recently allowed and blocked connections and create new rules from the Security log.\r\n√ Choose if you want the program to start at user log on.\r\n√ Import, export and restore all firewall rules or just the selected rules.\r\n√ Protection to unauthorized uninstallation.\r\n√ Possibility to restore previous settings at uninstallation.\r\n√ Global hot keys are supported and various shortcut keys are available.\r\n√ And many, many more. Just try it out","torrent":{"xt":"urn:btih:b4c05229d3a4cb120c306b305e8352c82d60df64","amp;dn":"BiniSoft+Windows+Firewall+Control+v4.6.0.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4c05229d3a4cb120c306b305e8352c82d60df64","infoHashBuffer":{"type":"Buffer","data":[180,192,82,41,211,164,203,18,12,48,107,48,94,131,82,200,45,96,223,100]},"announce":[],"urlList":[]}}