{"title":"Big Assets #1 [Split Scenes 720p]","uid":13449901,"size":3862970105,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b62aab0d180608d59a10b6db4d2ce8be08d87b66&amp;dn=Big+Assets+%231+%5BSplit+Scenes+720p%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxsunset","files":5,"time":1454789349,"description":"Screenshots: \nhttp://imgur.su/image/5Wz0 \nhttp://imgur.su/image/5qMV \nhttp://imgur.su/image/53Xt \nhttp://imgur.su/image/5XOI \nhttp://imgur.su/image/5kRN\r\n\r\n\r\nScene 1: [Sarah Vandella]\r\nSarah shows of her booty as she gets it slowly massaged by her partner, he begins warming up her pussy and ass while she is is bend over. Sarah sucks his dick, while showing off her big butt for you. Sarah then gets her pussy pounded in multiple positions most showing off her butt, but one giving a perfect view of her large tits as well. The scene ends with a load all over her round ass.\r\n\r\nScene 2: [Courtney Cummz]\r\nCourney Cummz starts of stripping out of a pink and purple set of underwear, as she spanks her ass and twerks for camera, she warms up her pussy solo for a while until a man arrives and eats her out. She then sits on his face and gyrates as he licks her.\r\nCortney returns the facor and sucks his cock with a seductive hungry look in her eyes, while servicing the entire cock and balls. Courtney shows off her assets as she gets pounded in various positions, until the guy can't hold it in any longer and cums all over her perfect ass.\r\n\r\nScene 3: [Elena Heiress &amp; Cassandra Cruz, FFM]\r\nElena and Cassandra are approached in the parking lot and agrees to come back to fuck a guy, Elena and Cassandra then help each other out of their clothes, while the guy gropes Elena. They then help the guy out of his pants and begin double teaming that dick, sucking him off and licking his balls. Various threesome positions ensue, until he gives the two lovely ladies a facial.\r\n\r\nScene 4: [Rachel Starr]\r\nRachel Starr shows of her all star ass in a pair of Denim shorts on a balcony. We then follow her bouncing butt down to the pool as she strips along the way. She finally enters the house and dances and pressess her ass up against a glass wall with a man on the other side. After teasing him behind the glass wall for a while, she finally walks around to the other side, where she allows the man to lick her pussy in various positions, until she finally lets the lucky guy fuck her in all the positions until he busts his nut on her perfect ass.\r\n\r\nScene 5: [Alexis Texas &amp; Megan Monroe, FFM]\r\nAlexis and Megan walk in their bikini's as we are treated to a view of their bouncing booties, until they bend over a motorcycle and starts twerking for our viewing pleasure. The two girls then jump in the hot tub and make out for a while, until they decide to show off their assets once again by dunking their booties in the water.\r\nA man shows up at the pool and starts making out with the two stunning beauties. He drops his clothes and sits on the edge of the hot tub whilst the girls deftly handle his cock with their lips. Once he can't stand to wait any longer he fucks the two girls in various threesome positions and in the end creams on both their asses","torrent":{"xt":"urn:btih:b62aab0d180608d59a10b6db4d2ce8be08d87b66","amp;dn":"Big+Assets+%231+%5BSplit+Scenes+720p%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b62aab0d180608d59a10b6db4d2ce8be08d87b66","infoHashBuffer":{"type":"Buffer","data":[182,42,171,13,24,6,8,213,154,16,182,219,77,44,232,190,8,216,123,102]},"announce":[],"urlList":[]}}