{"title":"Aztec wars PC V2 (ENG) 1999/2001","uid":13476672,"size":556338574,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b66e339e617e5d9a9ab8907fd807a792f9df166b&amp;dn=Aztec+wars+PC+V2+%28ENG%29+1999%2F2001&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Fraggerwithrifle","files":1,"time":1455017213,"description":"UPDATED TORRENT VERSION 2!!\r\n\r\nENGLISH VERSION OF THE GAME 'THE AZTEC' PC   1999/2001\r\n\r\nUSE WINZIP OR WINRAR TO UNPACK THE DOWNLOADED FILE. RUN SETUP.\r\n\r\nSelect the first option in the installer window. The installer wizard will start.\r\n\r\nOnly cd1 is added to this torrentfile. CD2 is not needed to play the game.\r\nSince the game is extremely rare and hard to find, I tought I should share it with the rest of the world. The game is over 15 years old, so I do not expect massive amounts of seeders. Contact me onif the download stalls. I will send you a copy true 'wetransfer', so you can still enjoy this game! Commenting on this youtubevideo will give you a quicker response from me:\r\n\r\nComment if you experience errors etc.\r\n\r\nFrag\r\n\r\n\r\n\r\n&quot;Aztec Wars by Russian developer New Media Generation offers an alternate look at history in 30 sprawling scenarios. The storyline is based on the premise that the mighty Aztec Empire defeated the Incas, conquered the Americas, crossed the Atlantic, dispatched northern Africa, and then set its sights on the domination of Europe. The real-time strategy gameplay begins around the beginning of the 18th century and allows you to guide the Aztec Empire, the Russian Empire, or the forces of the Emperor of Cathay, who has subjugated India and Japan in the East.\r\n\r\nAfter fueling their war machine with the salt and gold of the conquered Mali and Gao empires, the warlords take on Western Europe and defeat Spain, Portugal, France, and Germany. The game takes place after the Aztecs have spent several hundred years absorbing the culture and science of the era and technologies such as firearms and steam engines are available. With the possible allegiance of made-up of factions including Indians (muskets, cannon, bows, steel, and more), Nazca clans (hang gliders for reconnaissance), and Caribbean tribes (poisoned blowpipes), the invading army has a formidable array of weapons at its disposal.\r\n\r\nThe single player campaign contains 15 missions with the ability to control units from different races, with unique units available for each. Just a few examples include archers, musketeers on bison, and jaguars for the Aztecs, bears, dirigibles, and horsemen for Russia, and ninjas, thieves, and elephants for Cathay. Farms, barracks, stables, mines, workshops, fortresses, outposts, watchtowers, animal lairs, prisons, caves, and more make up the varied structures for each race.\r\n\r\nMultiplayer action for up to seven players, 30 maps for network play, a custom game generator, 20-minutes of digital music and full-screen rendered movies, and a scenario and unit editor round out the package. The game was originally released in Russia in 1999 and, with no manual (printed or electronic), requires learn-as-you-go play.&quot;","torrent":{"xt":"urn:btih:b66e339e617e5d9a9ab8907fd807a792f9df166b","amp;dn":"Aztec+wars+PC+V2+%28ENG%29+1999%2F2001","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b66e339e617e5d9a9ab8907fd807a792f9df166b","infoHashBuffer":{"type":"Buffer","data":[182,110,51,158,97,126,93,154,154,184,144,127,216,7,167,146,249,223,22,107]},"announce":[],"urlList":[]}}