{"title":"The Wild Wild West - Season 3 - Part 2","uid":13488870,"size":8862455428,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b795ae53af9deeb7969a12b9040c3fe6274b6925&amp;dn=The+Wild+Wild+West+-+Season+3+-+Part+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":20,"time":1455105193,"description":"\n\r\nDescription\r\n\r\nAt the peak of the 007 craze (1965), television was virtually inundated with 'secret agent' series, some clever (&quot;The Man from U.N.C.L.E.&quot;), some dazzling (&quot;The Avengers&quot;), some novel (&quot;I Spy&quot;), and more than a few just bad (&quot;Amos Burke, Secret Agent&quot;). Yet the most unabashedly entertaining series of the genre was also the most far-fetched, set in the 1870s, with two Secret Service agents operating out of a private train. &quot;The Wild Wild West&quot; lived up to it's title, and had more imagination, action, and romance than any other series of it's time. \r\n\r\nThe brainchild of producer Michael Garrison, the Sci Fi/Western starred 30-year old TV veteran Robert Conrad (&quot;Hawaiian Eye&quot;) as James West, an impossibly handsome, yet dedicated secret agent. While Conrad's acting skills were no threat to Olivier, as an ex-boxer, he was in superb physical condition, and performed nearly all of his own stunts, throughout the series' run. Dressed in a waist coat and tight toreador pants (&quot;If I turned the wrong way, they'd split&quot;, he joked), he exuded a sex appeal that no other TV star of the sixties could match.\r\n\r\nHis partner, Artemus Gordon, was portrayed by respected character actor Ross Martin, a 45-year old with impeccable credentials (&quot;Mr. Lucky&quot;, &quot;The Twilight Zone&quot;) over a twenty-year career. He had begun acting on radio in the forties, playing a wide variety of characters, and his role as Gordon gave him a similar opportunity, as a master of disguise. Witty, and with a childlike thirst for knowledge, Martin and 'Gordon' had much in common, and he and Conrad quickly developed a friendship that would continue until his death, in 1981. The loyalty between the pair was so strong, in fact, that when Martin suffered a mild heart attack, during the series' run, the star and producers refused to write his character out of the show, but filled his 'position' with 'guest stars', until he was healthy enough to resume the role.\r\n\r\nThe premise of the show was simple; each week, in episodes always entitled &quot;The Night of...&quot;, a megalomaniac would come up with a nefarious scheme, involving prototype weapons way ahead of their time, and West and Gordon would have to defeat him and his gang (a group of stuntmen who would reappear, every episode, in a variety of guises), while West would seduce the inevitably beautiful girl involved with the bad guys. Each episode would feature two spectacular brawls between West and the henchmen, one or two disguises for Gordon, and a climax where the heroes, held prisoner, would have to find a clever means to escape, and destroy the weapon. Many of Hollywood's legendary actors would guest as the villain, but the most popular, by far, who would reappear the most frequently, was the brilliantly funny, yet evil dwarf, Dr. Miguelito Loveless, portrayed by gifted actor Michael Dunn. A 31-year old best remembered for his work in the film, SHIP OF FOOLS, Dunn's 'Loveless' was as popular as Conrad and Martin, and his episodes were always the most stylish and entertaining\r\n\r\n\r\nThe Wild Wild West - Season 3 - Part 2 (Size: 8.25 GB)\r\n \t\t13 - The Night of the Turncoat.avi\t605.56 MB\r\n \t\t14 - The Night of the Iron Fist.avi\t605.97 MB\r\n \t\t15 - The Night of the Running Death.avi\t606.03 MB\r\n \t\t16 - The Night of the Arrow.avi\t605.91 MB\r\n \t\t17 - The Night of the Headless Woman.avi\t606.67 MB\r\n \t\t18 - The Night of the Vipers.avi\t593.9 MB\r\n \t\t19 - The Night of the Underground Terror.avi\t606.23 MB\r\n \t\t20 - The Night of the Death Masks.avi\t606.28 MB\r\n \t\t21 - The Night of the Undead.avi\t605.91 MB\r\n \t\t22 - The Night of the Amnesiac.avi\t606.02 MB\r\n \t\t23 - The Night of the Simian Terror.avi\t606.09 MB\r\n \t\t24 - The Night of the Death-Maker.avi\t605.9 MB\r\n \t\tDR. CHUCK MISSLER - The Eternal Realities of Heaven &amp; Hell.mp4\t \r\n \t\tHell is worse than we thought. Hear about the horrors that the unsaved will endure.mp4\t154.11 MB\r\n \t\r\nXtras","torrent":{"xt":"urn:btih:b795ae53af9deeb7969a12b9040c3fe6274b6925","amp;dn":"The+Wild+Wild+West+-+Season+3+-+Part+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b795ae53af9deeb7969a12b9040c3fe6274b6925","infoHashBuffer":{"type":"Buffer","data":[183,149,174,83,175,157,238,183,150,154,18,185,4,12,63,230,39,75,105,37]},"announce":[],"urlList":[]}}