{"title":"Containment.S01E05.HDTV.x264-LOL[mp4remuxer].mp4","uid":14638260,"size":264955454,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b900dc6092762c0e0af8871f95d1c956a9bceead&amp;dn=Containment.S01E05.HDTV.x264-LOL%5Bmp4remuxer%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"k3nd00d","files":1,"time":1463482551,"description":"LOL MKV to MP4 remux.\r\n\r\nVideo stream: x264\r\nAudio stream: AAC\r\n\r\nNotes about [mp4remuxer]\r\n\r\n 1. This remuxing is focused on SD (approx. 400 to 480p) HDTV or Web-DL captures that have begun coming out as MKVs instead of MP4s, even though the audio and video streams inside those MKVs are standard/typical streams for MP4s.\r\n 2. The change to MKVs for these SD HDTV captures causes problems for many people and their devices (for no logical reason).\r\n 3. I will remux and share things I want to, I do not plan to be a comprehensive remux dumper of everything out there.\r\n 4. Remux is when you take the audio and video streams from one video file in one container format (in this case MKV) and put them directly into another container format (in this case MP4). So, it is fast and there is no difference in quality because the streams are identical.\r\n 5. Why not just let everyone remux their own files? My answer to that is that people who just want to grab a video and watch it should not have to remux it before watching. I would prefer this change to put MP4 standard audio and video streams into MKV files would have never happened. The next best scenario is for someone to remux MKVs to MP4s and put those MP4s on torrent so only 1 person has to remux, not tens of thousands or more.\r\n 6. I follow the KAT rules for naming/tagging MKV to MP4 remuxes.\r\n 7. If you want to do some MKV to MP4 remuxing and share those remuxes on torrent, add your own tag or feel free to use the same tag I am using making those of us who use the [mp4remuxer] tag only affiliated in that we are doing the same thing and it is a tag that makes the nature of these torrents very clear to all.\r\n 8. Should I add anything else here?:)","torrent":{"xt":"urn:btih:b900dc6092762c0e0af8871f95d1c956a9bceead","amp;dn":"Containment.S01E05.HDTV.x264-LOL%5Bmp4remuxer%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b900dc6092762c0e0af8871f95d1c956a9bceead","infoHashBuffer":{"type":"Buffer","data":[185,0,220,96,146,118,44,14,10,248,135,31,149,209,201,86,169,188,238,173]},"announce":[],"urlList":[]}}