{"title":"Wilhelm Furtwangler: The Legacy 1926-1954 [107 CDs] 2014","uid":14491367,"size":29060840433,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:bd32d82a9e019472bb24e5e9b063943958712801&amp;dn=Wilhelm+Furtwangler%3A+The+Legacy+1926-1954+%5B107+CDs%5D+2014&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Horisarte","files":347,"time":1462103894,"description":"http://i.imgur.com/byphV7X.jpg\r\n\r\n\r\nGenre: Classical\r\nCountry of origin disc: Germany\r\nYear of Publishing drive: 2010\r\nPublisher (label): Membran Music\r\nCatalog Number: 233110\r\nRecord date: 1926-1954\r\nAudio codec: FLAC\r\nrip type: image + .cue\r\nAudio Bitrate: lossless\r\nDuration: 111: 51'00 &quot;\r\nAvailability of scans in the contents distribution: yes\r\n\r\nConductor Wilhelm Furtwangler already enjoyed a worldwide legendary standing during his lifetime - he was considered the German conductor and performances were greeted with rapturous applause. Today, more than 50 years after his death, Wilhelm Furtwangler is still an icon and his work has become an integral part ofthe music scene.But just what makes up this fascination? And what makes his recordings so special? This edition provides the answers.\r\nThese 107 CDs contain all the works Furtwangler ever recorded for release on record - and the &quot;live&quot; recordings he made for radio broadcast. In the case of different versions of the same work having been produced (for example there are 12 recordings of Beethoven's Eroica!.0 the best, most beautiful, or the most exciting interpretations have been chosen for this edition. In addition the numerous bonus CDs and tracks present excerpts taken from alternative recordings.\r\nFrom his very first recording (Weber's Freischiitz Overture, 1928) to his very last (Wagner's Valkyrie, 1954), this edition features productions of all the Beethoven and Brahms symphonies, the complete Rome recording of Wagner's Ring, recordings of the famous symphonies composed by Schubert, Schumann, Bruckner and Mozart, highlights taken from the Salzburg recordings of Don Giovanni, Magic Flute and Figaro, a live Bayreuth recording of Mastersingers etc. etc. etc.\r\nThe edition has been complemented by recordings of rehearsals and interviews. In addition the recording of the famous Salzburg song recital in 1953 reflects on the pianist Wilhelm Furtwangler as accompanist to Elisabeth Schwarzkopf.\r\nFurthermore, the edition contains a DVD with a video clip featuring the famous music critic Prof. Dr. Joachim Kaiser, who provides the answer to the question: why is Wilhelm Furtwangler still the most famous conductor in the world?\r\n\r\n\r\n \nhttp://www.hbdirect.com/album/1785975-wilhelm-furtwangler-the-legacy-107-cds.html","torrent":{"xt":"urn:btih:bd32d82a9e019472bb24e5e9b063943958712801","amp;dn":"Wilhelm+Furtwangler%3A+The+Legacy+1926-1954+%5B107+CDs%5D+2014","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd32d82a9e019472bb24e5e9b063943958712801","infoHashBuffer":{"type":"Buffer","data":[189,50,216,42,158,1,148,114,187,36,229,233,176,99,148,57,88,113,40,1]},"announce":[],"urlList":[]}}