{"title":"Le pouvoir de guérison du souffle (Meditation) + CD Audio","uid":14617046,"size":85210967,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bdd220632a13ca90316f5f15e0e15e40bcd44bac&amp;dn=Le+pouvoir+de+gu%26eacute%3Brison+du+souffle+%28Meditation%29+%2B+CD+Audio&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"asperge","files":15,"time":1463217115,"description":"Le pouvoir de guérison du souffle - Richard Brown &amp; Patricia Gerbarg\r\nFrench | 2015 | 205 Pages | ISBN: 2813208205 | PDF + DJVU | 4.25 MB + 2.34 MB\r\n\r\nPar la respiration, nous pouvons nous libérer de nos tensions, soigner nos douleurs, guérir nos dysfonctionnements. Ce que les traditions enseignent sur le souffle est aujourd'hui prouvé par la science.\r\n\r\nCe livre nous propose d'observer comment le rythme des cycles respiratoires, la façon de respirer, la force de l'expiration et les vibrations sonores, induisent des effets spécifiques dans l'organisme.\r\n\r\nLe recours à la respiration est une aide dans toutes les situations traumatiques, quelles qu'elles soient – y compris les catastrophes collectives. (Les auteurs sont intervenus auprès de groupes de rescapés de l'attentat du 11 Septembre, du tsunami dans le Sud-Est asiatique, du séisme en Haïti, et des massacres au Rwanda.)\r\n\r\nLa pratique quotidienne ou régulière des exercices proposés permet de modifier les connexions du système nerveux, et d'orienter l'organisme et le psychisme vers une possibilité de guérison ou de rémission, d'optimiser nos comportements, nos performances et nos relations aux autres.\r\n\r\nUne bonne partie de ce livre doit être utilisée en association avec le CD Le pouvoir de guérison du souffle qui l'accompagne et où sont enseignées toute une série de pratiques respiratoires et quelques techniques supplémentaires","torrent":{"xt":"urn:btih:bdd220632a13ca90316f5f15e0e15e40bcd44bac","amp;dn":"Le+pouvoir+de+gu%26eacute%3Brison+du+souffle+%28Meditation%29+%2B+CD+Audio","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdd220632a13ca90316f5f15e0e15e40bcd44bac","infoHashBuffer":{"type":"Buffer","data":[189,210,32,99,42,19,202,144,49,111,95,21,224,225,94,64,188,212,75,172]},"announce":[],"urlList":[]}}