{"title":"Andrew Rothschild - The Stampede of Life","uid":14614791,"size":126851280,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bedea7c395dc3d06b26ffdf47aad316f4685458d&amp;dn=Andrew+Rothschild+-+The+Stampede+of+Life&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Reed21","files":11,"time":1463189312,"description":"Andrew Rothschild is fore-running a new genre called Bluestronica where his primary expertise of guitar revolutionizes the Blues within Electronica for a journey-like experience.\r\n\r\nAndrew personally uses his dominant choice of instrument to construct living atmospheres up-heaving from his roots of Blues, Folk and Classic Rock. Rothschild combines these genres within the modern choice of Electronica for the next step in the evolution of the Blues. Andrew fuses nature oriented sounds, resonated didgeridoos, and conversing vocals through the glue of lush reverb and vast delays.\r\n\r\nTaking the rustic, primitive energy from the Blues and the refined, bright vitality from Folk: Andrew Rothschild’s music can certainly attract the older generations while the newer generation can heavily indulge with his cosmic approach to Electronica. Ultimately, Andrew distills his atmospheres with his personal craft of integrating nature oriented accents, fluent finger-picking, and Hendrix styled lead.\r\n\r\nWith the release of his debut album, The Stampede of Life, make sure to keep in tune to this artisan in the forthcoming months for the resuscitated quality of authentic music weaved within the eternal world of Electronica.\r\n\r\nSupport him on Itunes, Amazon, Google Play &amp; more if you would like.\r\n\r\n\r\n\r\nFind out more at http://aroths.com/\r\n\r\n\r\n\r\nEnjoy!","torrent":{"xt":"urn:btih:bedea7c395dc3d06b26ffdf47aad316f4685458d","amp;dn":"Andrew+Rothschild+-+The+Stampede+of+Life","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bedea7c395dc3d06b26ffdf47aad316f4685458d","infoHashBuffer":{"type":"Buffer","data":[190,222,167,195,149,220,61,6,178,111,253,244,122,173,49,111,70,133,69,141]},"announce":[],"urlList":[]}}