{"title":"The emotional atheism of Kookyinc refuted","uid":13228842,"size":5451105,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:bf6b5a9340f2fc21645580c1be7281108ec5f81f&amp;dn=The+emotional+atheism+of+Kookyinc+refuted&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dakilukker","files":1,"time":1452911683,"description":"Kookyinc was a (now suspended) youtube atheist user with delusional views, he believed himself to be a scientist and refused to debate with any theist who wasn't a creationist in fear of being humiliated with his arguments for atheism which could only work against creationists. His emotional arguments of matter arising from nothing could not work against any theist educated in philosophy and who denied creationism and he knew it. \r\n\r\nIn one video Kookyinc made titled &quot;Pareidolia proves God&quot; kookyinc attacked a theist's argument that the complexity of the universe can only point to an intelligent being: a god simply because mindlessness nothingness cannot lead to the complexity we observe in the structure of the universe (i.e its laws). Kookyinc quote-mined from this argument and set up a straw-man, deliberately changing the argument to make out that the theist was arguing that pareidolia (seeing faces in objects) was proof of God. This is just one example of Kookyinc's dishonesty in arguing. \r\n\r\nEventually he was suspended from YouTube due to impersonating another user. In his trolling on YouTube, Kookyinc would target certain users (normally creationists whose arguments are easy to destroy) making several minute long videos of them show-casing their comments and arguments, all while putting them down. He would then generalize them as being &quot;typical Christians&quot; and then played innocent to how this was trolling. Encouraging his followers to harass and troll these people, kookyinc would document, stalk and harass these people until they stopped using their accounts.\r\n\r\nEventually certain users stood up to kookyinc and his trolling, getting him, his alt accounts and his followers suspended from YouTube and at the same time exposing how kookyinc was nothing more than a delusional and mentally deranged kid with anger issues. \r\n\r\nKookyinc himself has made a torrent containing one of his poorly researched videos, it's titled &quot;What is an Arzock&quot; and concerns another atheist troll from a gaming forum who kookyinc tries to hold up as a victim of a theist. In truth, as another torrent &quot;Arzock the atheist troll&quot; has revealed, Arzock himself was nothing more than a troll who harassed people on gaming forums but kookyinc overlooked this, he did so for good reason as admitting to his own trolling or the trolling of another atheist would debunk the notion he was sprouting that atheists are always the victims. Admitting to his own or another atheist's harassment of theists and religious people would do away with kookyinc's atheist persecution complex and so he ignored everything bad from his own crowd. Included with this torrent is a text file from someone who researched this long and pathetic e-drama describing perhaps the reason behind kookyinc's obsession with what he proclaimed was one user on YouTube counter-trolling him. \r\n\r\nMy personal belief is that Kookyinc was just a mentally unstable person with anger issues and couldn't handle having his own worldviews mocked, he's the type of person who can dish it out but can't take it. To defend himself he invented all manner of lies but they all backfired on him in the end when he was finally suspended from YouTube for impersonation (see the accompanying image for that or simply visit his YouTube's account URL). \r\n\r\nIncluded also with this torrent file is a video showing some comments from Kookyinc about his position as an atheist alongside some of his arguments for atheism, the video author quickly refutes them revealing Kookyinc's position to be nothing more than an emotional one. Next to this is an image showing kookyinc's suspension from YouTube","torrent":{"xt":"urn:btih:bf6b5a9340f2fc21645580c1be7281108ec5f81f","amp;dn":"The+emotional+atheism+of+Kookyinc+refuted","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf6b5a9340f2fc21645580c1be7281108ec5f81f","infoHashBuffer":{"type":"Buffer","data":[191,107,90,147,64,242,252,33,100,85,128,193,190,114,129,16,142,197,248,31]},"announce":[],"urlList":[]}}