{"title":"Evolution Planet: Gold Edition v1.0.5","uid":13481278,"size":107023676,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:bfa0b6f9c26ca3ce2427ddc106a1deb8a8483a6c&amp;dn=Evolution+Planet%3A+Gold+Edition+v1.0.5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Androider","files":2,"time":1455060033,"description":"Discover a place full of wonder, adventure, fun, treasures… and frogs! And dinosaurs! And cavemen! Play through Evolution Planet’s islands and meet the creatures that live there. Match them together, make them stronger and help them beat their despicable mutant versions.\r\n\r\nWhat will you find while you travel from island to island?\r\n\r\nPURE FUN!\r\nFrom the very start you will see for yourself that playing Evolution Planet is easy, but genuinely fun and challenging as well. Combine three creatures and they will turn into a stronger one. Choose a strategy of your own to overcome each challenge. At the end of the day, you will be evolving your creatures like a master.\r\n\r\nDISCOVER THEM ALL!\r\nThree amoebas make a jellyfish. Three jellyfishes make a frog. Three frogs make a… What’s the highest evolution level? Who can beat the dinosaur? Each new creature is a new surprise.\r\n\r\nEXPLORE 6 FANTASTIC ISLANDS (THAT IS A LOT OF LEVELS!)\r\nEvolution Planet is a thrilling adventure that will give you hours of fun. Share your journey with these amusing creatures through forests, icy lands, volcanos, deserts… All of them featuring beautiful atmospheric and lighting effects. Beware of the meteorites!\r\n\r\nTHE BAD GUYS ARE COMING!\r\nEverything in life has a dark side, even your loyal creatures. Confront their mutant version in epic battles, and use your bravery and your wits to defeat the dreadful final bosses if you want to go on with your journey. Eat or get eaten.\r\n\r\nTREASURES EVERYWHERE\r\nGems, treasure chests, special items… Do you like collecting things? Then you will really enjoy having a bath of gems in the bonus levels.\r\n\r\nGet ready to have an amazing experience.\r\n\r\nEnjoy Evolution Planet and solve the great puzzle of evolution!\r\n\r\nWhat's New:\r\n\r\n• New survival mode\r\nEnjoy a new special challenge, this time with unlimited creatures. How much can you score? How long can you survive?\r\nUnlimited gameplay with your own record as a challenge!\r\n• Several performance improvements and corrections.\r\n\r\nMore info:\r\n \nhttps://play.google.com/store/apps/details?id=com.playw.evoplanetgold\r\n\r\n\r\nInstructions:\r\n\r\n1.Copy 'com.playw.evoplanetgold' folder to 'sdcard/Android/obb'\r\n2.Install APK\r\n3.Launch the game","torrent":{"xt":"urn:btih:bfa0b6f9c26ca3ce2427ddc106a1deb8a8483a6c","amp;dn":"Evolution+Planet%3A+Gold+Edition+v1.0.5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfa0b6f9c26ca3ce2427ddc106a1deb8a8483a6c","infoHashBuffer":{"type":"Buffer","data":[191,160,182,249,194,108,163,206,36,39,221,193,6,161,222,184,168,72,58,108]},"announce":[],"urlList":[]}}