{"title":"Stargate Atlantis - Season 04 - Episodes 1 thru 10","uid":14607065,"size":8519533556,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bfe0f14efb2613aa8ca156fd0ac0f43dec79d06e&amp;dn=Stargate+Atlantis+-+Season+04+-+Episodes+1+thru+10&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":24,"time":1463101567,"description":"Stargate Atlantis - Season 04 - Episodes 1 thru 10\r\n\r\nAdrift  S4 Ep1\r\nWith a damaged ZPM, and diminished hopes of survival, the Atlantis team finds themselves stranded in the middle of empty space with hardly any time before they run out of power completely. Dr. McKay is challenged to the max as he tries to find a way to save Atlantis from its doom. Meanwhile, Dr. Keller races to treat Weir's increasing head injuries, but the only answer she can come up with could have grave results for everyone on board.\r\nWatch Now or On Disc \r\n$0.00 with Prime Video + 1 more\r\n \r\n Lifeline S4, Ep2\r\n5 Oct. 2007 Lifeline\r\nThe Atlantis team, along with Weir and now with the ability to make large hyperspace jumps in only a puddle jumper, must now journey to the replicator home planet to steal one of their many ZPMs to bring the city back to life, and finish the journey to their new planet\r\nWatch Now or On Disc \r\n$0.00 with Prime Video + 1 more\r\n \r\n Reunion S4, Ep3\r\n12 Oct. 2007 Reunion\r\nWhile on a regular mission, Ronan runs into some Satedan friends from his past. As old emotions start to return, new thoughts come with them, one of which involves leaving Atlantis. But could danger be lurking just around the corner?\r\nWatch Now or On Disc \r\n$0.00 with Prime Video + 1 more\r\n \r\n Doppelganger S4, Ep4\r\n19 Oct. 2007 Doppelganger\r\nWhile exploring a new planet, Sheppard started to watch a strange crystal. He doesn't know why, but he had to touch it. Back on Atlantis, everybody but him started to have some bad nightmares.\r\nWatch Now or On Disc \r\n$0.00 with Prime Video + 1 more\r\n \r\n Travelers S4, Ep5\r\n26 Oct. 2007 Travelers\r\nSheppard is kidnapped by a group of people living in a starship fleet. They were telling him that they were living on these ships for a long time, due to the war with the Wraith. He was forced to help them make an ancient's ship fly. Sheppard tricked them and flew with the ship, and 3 of the kidnappers.\r\nWatch Now or On Disc \r\n$0.00 with Prime Video + 1 more\r\n \r\n Tabula Rasa S4, Ep6\r\n2 Nov. 2007 Tabula Rasa\r\nRodney McKay awakens in his lab, tied to a chair and with no memory of who or where he is. He did seemingly leave himself a video message telling him to look for Teyla. The problem began some 14 hours before when Dr. Katie Brown returned to Atlantis with plants from a planet she had visited. The plants had been cleared through the normal quarantine procedure but she is soon afflicted with severe headaches and loss of memory, eventually falling into a coma. Memory loss begins to afflict other members of the crew but they soon become distrustful of one another, making ...\r\nWatch Now or On Disc \r\n$0.00 with Prime Video + 1 more\r\n \r\n Missing S4, Ep7\r\n9 Nov. 2007 Missing\r\nTeyla and Dr. Keller go to the Athosian's new planet, and what they see is that the Athosian are not there anymore. They've gone missing. It seems to be the work of a warrior tribe, the Bola Kai.\r\nWatch Now or On Disc \r\n$0.00 with Prime Video + 1 more\r\n \r\n The Seer S4, Ep8\r\n16 Nov. 2007 The Seer\r\nHaving been told by the Genii spy on New Athos that her people were still alive, Teyla asks permission to visit a man named Davos who is a legendary seer and may be able to help her. When they arrive, Dr. Keller realizes that the man is dying. His ability to see the future is real, but the snippets of the future he is able to show them are open to interpretation. John is called back to Atlantis when they receive a message from the Wraith whose life he had previously saved. He offers to work with McKay to fix the nano virus that is now malfunctioning. As if this ...\r\nWatch Now or On Disc \r\n$0.00 with Prime Video + 1 more\r\n \r\n Miller's Crossing S4, Ep9\r\n30 Nov. 2007 Miller's Crossing\r\nRodney McKay is continuing to work on solving the problems with the replicator nano code and finally gives in to Zalenka's request that he contact his sister Jeannie for help. He sends her an e-mail but that same night, she is kidnapped and taken to a private medical facility where she is expected to use nano technology to save the life of a wealthy industrialist's daughter. Rodney and others travel to Earth to look into Jeannie's disappearance but Rodney is soon kidnapped and put to work as well. Rodney and Jeannie think they have found a working solution but when it...\r\nWatch Now or On Disc \r\n$0.00 with Prime Video + 1 more\r\n \r\n This Mortal Coil S4, Ep10\r\n7 Dec. 2007 This Mortal Coil\r\nWhen what appears to be a satellite crashes into Atlantis, the team becomes aware of strange behaviour on the base","torrent":{"xt":"urn:btih:bfe0f14efb2613aa8ca156fd0ac0f43dec79d06e","amp;dn":"Stargate+Atlantis+-+Season+04+-+Episodes+1+thru+10","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfe0f14efb2613aa8ca156fd0ac0f43dec79d06e","infoHashBuffer":{"type":"Buffer","data":[191,224,241,78,251,38,19,170,140,161,86,253,10,192,244,61,236,121,208,110]},"announce":[],"urlList":[]}}