{"title":"BBC Young Musician 2016, final","uid":14634387,"size":2438226095,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:bfe082eadbbc21efb5c05e46c8d21ab224b3de4c&amp;dn=BBC+Young+Musician+2016%2C+final&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"RoaElson","files":2,"time":1463413298,"description":"After a series full of thrilling performances, BBC Young Musician 2016 reaches its conclusion. Now just three exceptional musicians remain, as the Barbican Hall in the City of London plays host to the final. In this legendary venue, three finalists perform a full concerto with the BBC Symphony Orchestra and the celebrated British conductor Mark Wigglesworth.\r\n\r\nClemency Burton-Hill, trumpet player Alison Balsom - herself a finalist in 1998 - and Josie D'Arby present the coverage from what's sure to be a breathtaking climax to this year's competition, bringing behind-the-scenes insights and providing analysis of each performance.\r\n\r\nWe also hear from pianist Martin James Bartlett, who won this competition two years ago, and performs the first movement from Prokofiev's Piano Concerto no 3. Who will follow in his footsteps and become the winner of BBC Young Musician 2016?\r\n\r\nBBC Young Musician 2016 reaches its penultimate stage - the semi-final. Clemency Burton-Hill and trumpet player Alison Balsom, herself a BBC Young Musician Finalist in 1998, present extensive highlights from the semi-finalists' performances at the Royal Welsh College of Music and Drama in Cardiff.\r\n\r\nIn the category finals we were treated to some remarkable performances from 25 talented and dedicated young musicians. Now the winners of the keyboard, woodwind and percussion finals- Jackie Campbell, Jess Gillam, Andrew Woolcock - are joined by the winners from the brass and strings categories to compete against each other for just three places in the grand final at the Barbican Hall in London.\r\n\r\nMaking the all-important decisions are the judges: Meurig Bowen, Director of the Cheltenham Music Festival, Alpesh Chauhan, Assistant Conductor at the City of Birmingham Symphony Orchestra, Huw Humphreys, Head of Music at London's Barbican Centre, and Chair of the jury across the category finals, composer Dobrinka Tabakova.\r\n\r\n\r\n\r\nBroadcast: 15th May 2016\r\nDuration: 135 minutes","torrent":{"xt":"urn:btih:bfe082eadbbc21efb5c05e46c8d21ab224b3de4c","amp;dn":"BBC+Young+Musician+2016%2C+final","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfe082eadbbc21efb5c05e46c8d21ab224b3de4c","infoHashBuffer":{"type":"Buffer","data":[191,224,130,234,219,188,33,239,181,192,94,70,200,210,26,178,36,179,222,76]},"announce":[],"urlList":[]}}