{"title":"On Rusty Trails - TheDarkKnight","uid":14587980,"size":360500252,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c11925fd4c81e310993781e0ec8cf7b0bbaa7dec&amp;dn=On+Rusty+Trails+-+TheDarkKnight&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"batknight2016","files":1,"time":1462931731,"description":"This game was shared by John2s on\n\r\nStore Page:\r\n  \nhttp://store.steampowered.com/app/277700/\r\n\r\nAbout This Game:\r\n\r\nOn Rusty Trails is a modern, illustrative platformer that puts you into a world constantly reacting to your change in identity. You are Elvis. Metal being, home owner and a lover of dryness. But recently, the weather has been going haywire. Your house has just dissolved into a pile of rust, and soon you will too! This is not how you planned to enjoy your future as a rate payer. Good thing, you suddenly get your hands on a Shifty Suit! Now it‘s super easy to incognito yourself and walk among suspicious hairy folk. Walk along, below and above iron cities, soggy jungles and flaming war zones. Swiftly zoom over any obstacle and switch form to avoid a rusty funeral.\r\n\r\nKey Features\r\n\r\nSlip into the Shifty Suit!\r\n \r\n– Fast reactions are the key to progressing through      this fast-paced game. Shift instantly from metal being to hairy person with a suit and influence how the world reacts to you.\r\n \r\nStill stepping on the floor? \r\n\r\n– Others break walls, you tread on them! The ceiling? Not a problem. Walk wherever you like! A unique platform mechanic where your feet have no limits.\r\n\r\nA tale told in finest comic art!\r\n \r\n– Feast your eyes on the trademark Black Pants   art style in this beautifully drawn platformer and its miniature world with even smaller inhabitants. Eyes! FEAST!\r\n \r\nIt is illegal to mingle!\r\n\r\n– Stimulate your brains with a story about the loss of a low-rent flat, complicated  misunderstandings and a looming war. And there’s even forbidden romance… \r\n\r\nIt creaks, it cracks, it crunches!\r\n \r\n– A dark and melodic soundtrack with an eclectic selection of music. Robotic sounds for your rainy days and the industrial revolution.\r\n\r\nScreenshots:\r\n  \nhttp://cdn.akamai.steamstatic.com/steam/apps/277700/ss_e1c6add1f44ee85937d024228e1feb60761357b3.1920x1080.jpg?t=1461952351 \nhttp://cdn.akamai.steamstatic.com/steam/apps/277700/ss_d0a324e4217058b47971bef1c9365190eb99207c.1920x1080.jpg?t=1461952351 \nhttp://cdn.akamai.steamstatic.com/steam/apps/277700/ss_799e84d479531c3e420a909f7604a5029df72e5f.1920x1080.jpg?t=1461952351 \nhttp://cdn.akamai.steamstatic.com/steam/apps/277700/ss_275dc1fa5482697f7956ca65a4024e8e111e232a.1920x1080.jpg?t=1461952351 \nhttp://cdn.akamai.steamstatic.com/steam/apps/277700/ss_53e81afa05bce6c71e99fbff4925636ba7e21342.1920x1080.jpg?t=1461952351\r\n\r\nAuthors Note:\r\n\r\nWhy I do this? I share because I want to give back to the community that has given to me for years. I believe torrents are a great form or advertising and promoting. When people can test games and watch movies before buying them they are more likely to support the developers / producers by buying their products.\r\n\r\nI Try to release things no one else has so when people steal my torrents without saying thanks or giving recognition it makes me want to stop. So if you want to share my stuff please ask or mention me.\r\n\r\nPlease don't hit and run show some appreciation and say thanks/seed so you motivate me to keep sharing things that no one else has. My motivation is to give to the community but if your not telling me you like it I feel i'm wasting my time. I have lots of stuff no one else has shared but i'm not going to put much time into it unless people seed and say thanks. -TheDarkKnight\r\n\r\n\r\n!!!IF YOU LIKE THIS PLEASE SUPPORT THE DEVELOPERS AND BUY IT!!!","torrent":{"xt":"urn:btih:c11925fd4c81e310993781e0ec8cf7b0bbaa7dec","amp;dn":"On+Rusty+Trails+-+TheDarkKnight","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c11925fd4c81e310993781e0ec8cf7b0bbaa7dec","infoHashBuffer":{"type":"Buffer","data":[193,25,37,253,76,129,227,16,153,55,129,224,236,140,247,176,187,170,125,236]},"announce":[],"urlList":[]}}