{"title":"Murder at 1600(1997)DVDRip.AC3[ENG]-DROCK","uid":13233605,"size":1121326416,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c4dee76ff3947f5e1b1b45d5dc35e12fb25a1aac&amp;dn=Murder+at+1600%281997%29DVDRip.AC3%5BENG%5D-DROCK&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":1,"time":1452977498,"description":"A 25 year old female White House staffer, Carla Town is murdered in the White House. D.C. homicide detective Regis is assigned to investigate, only to find all evidence suppressed by the Secret Service. After suspecting a cover-up, Regis convinces Secret Service Agent Nina Chance to assist in uncovering the cover-up. The President's son Kyle Neil is a prime suspect, as he was having sex with Carla within an hour of her murder. While the investigation ensues the President Jack Neil is holding meetings with top military personnel regarding North Korea's holding 23 U.S. military personnel hostage. Regis confronts top Secret Service Agent Spikings at his home shortly after Spikings returns home with evidence leading to the murder. The home is attacked and Spikings is killed, but Regis makes it out alive with Agent Chance's assistance, and with the evidence tape. White House adviser Jordan presents false evidence to the President that his son killed Carla and forces the President to say he will announce his resignation at 10 p.m. the following day. Regis and Chance break into the White House via underground tunnels, stop the President from resigning, and arrest Jordan for conspiracy to murder. Jordan pulls a gun, injures Agent Chance, and is killed by multiple Secret Service agents. News release states there were false rumors of the President resigning, and also falsely state that Agent Spikings was killed in the gunfire exchange between Jordan and the Secret Service. \r\n\r\nVideo Properties\r\n\r\nFrame Width: 720\r\n\r\nFrame Height: 540\r\n\r\nFrame Rate: 29fps\r\n\r\nAudio Properties\r\n\r\nBit Rate: 192kbps","torrent":{"xt":"urn:btih:c4dee76ff3947f5e1b1b45d5dc35e12fb25a1aac","amp;dn":"Murder+at+1600%281997%29DVDRip.AC3%5BENG%5D-DROCK","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4dee76ff3947f5e1b1b45d5dc35e12fb25a1aac","infoHashBuffer":{"type":"Buffer","data":[196,222,231,111,243,148,127,94,27,27,69,213,220,53,225,47,178,90,26,172]},"announce":[],"urlList":[]}}