{"title":"Unraveled Series - Rael Smith","uid":13225249,"size":1133356,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6ecf6ad1d49d95bbcacf11a7275d893f9f4ee9b&amp;dn=Unraveled+Series+-+Rael+Smith&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":9,"time":1452852964,"description":"01. House of Steel (Unraveled Series, #1) - Raen Smith\r\n\r\n\r\n\r\nLife has a way of coming undone. One single moment can set the undoing in motion, unraveling our neat, tiny stitch of life. For young art professor Delaney Jones, the treacherous spiral begins when she makes one unforgivable mistake - she sleeps with her student. Her silent Wisconsin winter turns deadly after she witnesses the brutal murder of a man she had fought hard to forget. As Delaney battles to deal with the undoing of her tight-stitched life, the small liberal arts university is devastated by the discovery of a bloody crime scene on campus. A mysterious text entangles her in the violent scandal, and Delaney must follow the rules of the anonymous messenger to stop the perpetuating descent toward death. But the line between good and evil is blurry. And maybe, just maybe, there is no line at all.\r\n\r\n02. House of Fire (Unraveled, #2) - Raen Smith\r\n\r\n\r\n\r\nFive months after Evie Parker’s disappearance, Delaney Jones is dangerously close to leading a normal life with a cancer-free mother, a successful career, and a gorgeous, loving boyfriend. But there’s one hitch: she breathes, sleeps, and eats under the watchful eyes of Holston Parker, a villainous billionaire.\r\n\r\nThe spring semester at Leighton University has ended, and Delaney is determined to rid Holston from her life – for good. As she digs deeper to uncover his secrets, she finds a tangled web of police corruption and mysterious disappearances. And when the grand opening of Parker Tower brings her mother face-to-face with Holston Parker, her family’s buried past threatens to emerge. Just as Delaney thinks she’s on her own, Evie returns to finish what she started. But time is running out as Holston is about to make his final move, stopping at nothing to get what he wants.\r\n\r\n\r\n\r\n03. House of V (Unraveled Series, #3) - Raen Smith\r\n\r\n\r\nOne year after killing my so-called father, I thought I’d buried the past six feet under. A new country. A new name. And now love.\r\n\r\nI've just received an urgent message from Delaney, the sister I never knew I had until a year ago. She told me that Father Haskens was found dead in the rectory of St. Mary's Church in Appleton and that Sister Josephine was in danger. They need my help to finish what Holston Parker started, but I can't imagine going back to the place where it all began. I’ve spent my whole life as an after-thought, unwanted by the man that took me. And now, I’m being hunted, and I never knew how bad it could hurt. - Evie Parker","torrent":{"xt":"urn:btih:c6ecf6ad1d49d95bbcacf11a7275d893f9f4ee9b","amp;dn":"Unraveled+Series+-+Rael+Smith","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6ecf6ad1d49d95bbcacf11a7275d893f9f4ee9b","infoHashBuffer":{"type":"Buffer","data":[198,236,246,173,29,73,217,91,188,172,241,26,114,117,216,147,249,244,238,155]},"announce":[],"urlList":[]}}