{"title":"Tony Wheeler's Dark Lands by Tony Wheeler {BooksDeityTEAM}","uid":14454768,"size":2236169,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c79d8ff4365788fca3195cb24c8e10beb3546598&amp;dn=+Tony+Wheeler%27s+Dark+Lands+by+Tony+Wheeler+%7BBooksDeityTEAM%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"BooksD","files":1,"time":1461784253,"description":"Lonely Planet: The world’s leading travel guide publisher* Greedy Lords, dubious heroes, wicked relations and innocents in peril – today’s world sounds like a grim fairytale! Travelling along the infamous ‘Axis of Evil’ led to Tony Wheeler’s Bad Lands – now he’s going deeper into the world’s darkest corners to explore a rogue’s gallery of troubled nations. Every country has its problems, but some problems seem so vexed, so intractable, so absurd, you can only shake your head. Tony Wheeler trains his well-travelled eyes on some of these places and attempts to understand how things got so messed up. Along the way he gets stoned (with the thrown variety) in Palestine, scores a speeding ticket in Zimbabwe, gets arrested for photographing a bar in the Congo, and visits Osama bin Laden’s Abbottabad in Pakistan. Join Tony and find out if there’s a happily-ever-after in these tales from the dark side. Author: Tony Wheeler About Lonely Planet: Started in 1973, Lonely Planet has become the world’s leading travel guide publisher with guidebooks to every destination on the planet, as well as an award-winning website, a suite of mobile and digital travel products, and a dedicated traveller community. Lonely Planet’s mission is to enable curious travellers to experience the world and to truly get to the heart of the places where they travel. \r\n\r\n \nhttp://booksdeity.com/2016/04/26/tony-wheelers-dark-lands-by-tony-wheeler/\r\n\r\n\r\n                         ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\r\n\r\n                          Visit us for more Awesome ebooks             \r\n\r\n                               http://booksdeity.com/\r\n \r\n                         **********************************","torrent":{"xt":"urn:btih:c79d8ff4365788fca3195cb24c8e10beb3546598","amp;dn":"+Tony+Wheeler%27s+Dark+Lands+by+Tony+Wheeler+%7BBooksDeityTEAM%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c79d8ff4365788fca3195cb24c8e10beb3546598","infoHashBuffer":{"type":"Buffer","data":[199,157,143,244,54,87,136,252,163,25,92,178,76,142,16,190,179,84,101,152]},"announce":[],"urlList":[]}}