{"title":"Mountain-5.Eps-w.subs--BBC-2007-x265-HEVC-720p","uid":13223244,"size":2412089067,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:c825689043bb9d74d365cb015b36afed65b4eded&amp;dn=Mountain-5.Eps-w.subs--BBC-2007-x265-HEVC-720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"uggauga","files":5,"time":1452813908,"description":"\nMountain\r\n\r\nBBC (2007)\r\n\r\nGriff Rhys Jones explores the great mountain ranges of Britain, from Scotland southwards to the Pennines and Wales\r\n \nhttp://www.bbc.co.uk/programmes/b007xp0w\r\n_______________________________________\r\n\r\n1280x720 resolution\r\n\r\nVideo Codec h.265 / HEVC !!!!!\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!\r\n_______________________________________\r\n\r\nNorthern Scotland\r\nEpisode 1 of 5\r\nGriff Rhys Jones begins his exploration of Britain's mountains in the breathtaking wilderness of the northwest highlands of Scotland. The area was once home to half the population of Scotland, but Griff finds a vast, empty landscape closer to the Arctic Circle than to his native London. He meets a crofter who wants to encourage people back to the land and an artist who enjoys the emptiness.\r\nOn the Isle of Skye, Griff explores a mountain range that is privately owned, but up for sale.\r\n\r\nThe Lakes\r\nEpisode 2 of 5\r\nGriff Rhys Jones explores the stunning landscape of the Lake District as his expedition through the mountains of Britain continues. With 12 million people visiting the Lakes every year, it's hard to imagine that the mountains were once thought to be 'God's mistake'. Yet only a few hundred years ago it was believed no one in their right mind would enjoy the mountains. Somehow the feelings for dramatic landscape were transformed. This programme shows how the Lake District became a source of inspiration, and how William Wordsworth almost single-handedly changed people's attitudes to the mountains. What was once simply terrifying became awesome, and by getting closer to nature and experiencing the mountains, people were encouraged to become spiritually fulfilled. Griff discovers the birthplace of the Quaker movement and retraces the steps of the poet Coleridge, credited with being the first adrenalin junkie. He also finds that we have fallen in love with a landscape captured by artists and photographers in a moment of time - and that farmers are now paid to keep the mountains picturesque.\r\n\r\nCentral Scotland\r\nEpisode 3 of 5\r\nGriff Rhys Jones continues his tour of the mountains of Britain with a journey to the central Highlands, where he explores Glencoe, the Cairngorm range and Britain's highest mountain, Ben Nevis.\r\nGriff explores ambitious feats of Victorian engineering and finds a stunning example of a Victorian shooting lodge. He also tries his hand at local pursuits including dog sledding and skiing, before joining a group of runners in training for the formidable annual Ben Race.\r\n\r\nPennines\r\nEpisode 4 of 5\r\nGriff Rhys Jones continues his exploration of Britain's mountains with a journey across the Pennines, the natural barrier between Yorkshire and Lancashire. Griff ventures underground to the heart of the mountains in search of the source of one of the country's most important rivers. He also discovers how the workers of the Pennines fought to claim the mountains as their own as an escape from the industry of the cities, and meets the ramblers who proudly uphold the right to roam.\r\n\r\nWales\r\nEpisode 5 of 5\r\nGriff Rhys Jones returns to the land of his forefathers in the first of his series exploring the mountains of Britain.\r\nAccording to Welsh legends, the mountains of Snowdonia were created by angry giants, inhabited by dragons and made battlegrounds by King Arthur. Now, the battle being fought isn't between legendary creatures but between mountains and man.\r\nWith a railway taking visitors to the summit of Snowdon, it would be easy to assume these hills have already been lost. But Griff discovers that the mountains continue to protect a fragile ecology despite the best efforts of us humans. This beautiful corner of Wales is the most southerly home of rare Arctic plants and wild horses, whose ancestors have roamed Snowdonia for 2,000 years. Griff meets people who respect the mountains' fragility, including an extraordinary climber of the old slate quarries, entrepreneurs making paper from sheep droppings and a member of the 1953 Everest expedition, who began climbing long before millions of pairs of feet took the mountains for granted","torrent":{"xt":"urn:btih:c825689043bb9d74d365cb015b36afed65b4eded","amp;dn":"Mountain-5.Eps-w.subs--BBC-2007-x265-HEVC-720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c825689043bb9d74d365cb015b36afed65b4eded","infoHashBuffer":{"type":"Buffer","data":[200,37,104,144,67,187,157,116,211,101,203,1,91,54,175,237,101,180,237,237]},"announce":[],"urlList":[]}}