{"title":"Windows 8 Pro x86 - FRENCH","uid":14584021,"size":2425254369,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c8c1c9f720ca7953493c2c8e68246d498deb2f15&amp;dn=Windows+8+Pro+x86+-+FRENCH&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"annuaireweb","files":2,"time":1462902555,"description":"Windows 8 est la nouvelle et actuelle version du système d'exploitation Windows commercialisée le 26 octobre 2012. La version pré-bêta (Developer Preview) publique a vu le jour en septembre 2011, une version bêta (Consumer Preview) a aussi vu le jour le 29 février 2012 à l'occasion du Mobile World Congress à Barcelone. La version Release Preview (équivalent des Release Candidate, RC, des versions antérieures à Windows 8 ) est sortie le 31 mai 2012. Pour Microsoft, Windows 8 est devenu une priorité en juillet 2010. \r\n\r\nWindows 8 a été dévoilé, avec l'utilisation de l'interface tactile, le 1er juin 2011. La version RTM de Windows 8 à destination des constructeurs OEM est disponible depuis le 15 août 2012. Windows 8 a été présenté en grande pompe comme les anciennes versions (7, Vista ou XP) le 25 octobre 2012, avant la sortie grand public le lendemain pour les différentes plateformes (tablettes, PC et smartphones y compris mais sous Windows Phone 8 Apollo). \r\n\r\nCeci est la version complète et originale de Windows 8 Professionnel 32 bits. Loader non inclue. \r\n\r\nGuide d'installation \r\n\r\nSur PC \r\n\r\n- Méthode USB: - Monter l'iso avec un lecteur virtuel ou l'extraire avec 7zip - Copier le contenu de l'iso dans une clef USB (4Go min en Fat32) - Redémarrez le PC et booter sur la clef USB - Installez \r\n\r\nMéthode DVD \r\n\r\n- Graver l'iso sur un DVD 4.7Go - Redémarrez le PC et booter sur le lecteur DVD - Installez","torrent":{"xt":"urn:btih:c8c1c9f720ca7953493c2c8e68246d498deb2f15","amp;dn":"Windows+8+Pro+x86+-+FRENCH","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8c1c9f720ca7953493c2c8e68246d498deb2f15","infoHashBuffer":{"type":"Buffer","data":[200,193,201,247,32,202,121,83,73,60,44,142,104,36,109,73,141,235,47,21]},"announce":[],"urlList":[]}}