{"title":"U-Roy - Music Addict","uid":13246015,"size":337799077,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c94c73656439cf90a9e5276c861e15806b3e1404&amp;dn=U-Roy+-+Music+Addict&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jokersmoker","files":10,"time":1453104637,"description":"DJ Prince Jazzbo had shaken up the sound systems during the roots era with a clutch of classic self-produced singles. These hits all had gloriously dread atmospheres, and even well into the '80s, that quality still occasionally fired his productions. The rhythm of &quot;Jah Jah Call You&quot; may have started life in a brightly upbeat fashion, but the producer transforms it into a moodier piece, a melancholy elephant stomping through the undergrowth. &quot;Come Fe Warn Them&quot; is even more blistering, a brooding drum'n'bass extravaganza, while &quot;Haul and Pull&quot; is the moodiest of the batch, almost darkwave in its shadowed atmosphere. All three version the same rhythm, but Jazzbo re-creates each one in a surprisingly unique way. These rhythms seem to have resonated with U-Roy, who responded with inspired toasts, striding forcefully through &quot;Jah Jah Call You,&quot; toasting hypnotically on &quot;Come Fe Warn Them,&quot; and storming his way across &quot;Haul and Pull.&quot; In Jazzbo's hands, even a &quot;Reggae Party&quot; is less jubilant than smoldering, but the DJ works hard to add some exuberance to the evening, while he can make even a well-recycled rhythm like that utilized for &quot;I Feel Good&quot; sound fresh, especially with U-Roy sprucing it up. The title track, in contrast, is stripped down to bare rhythmic bones, and the DJ sends it straight into the sound systems, as he enthusiastically declares his need for music while sending shout-outs to much of the contemporary competition. Which means &quot;I Originate&quot; and &quot;King Tubby's Skank&quot; sound surprisingly out of place. And no wonder -- both are nearly decade-old songs the DJ cut for Bunny Lee. The latter is included in its original form; the former is either a particularly bizarre mix or else was taken from a damaged tape. Both were great numbers, but their inclusion here is unwelcome, as they neither fit nor enhance the rest of the set. Thankfully, the sequencing limits the damage to an otherwise exceedingly strong album. ~ Jo-Ann Greene \r\n\r\n Record date : 1987\r\n\r\n Album style : digital, DJ\r\n\r\n Playlist :\r\n Originate\r\n Music Addict\r\n King Tubby's Skank\r\n Jah Jah Call You\r\n Come Fe Warn Them\r\n Reggae Party\r\n Haul And Pull\r\n I Feel Good\r\n Waterbot\r\n\r\n Mixing Engineer : Paul Jacobson\r\n Engineer : Paul Jacobson\r\n\r\n Producer : Prince Jazzbo\r\n\r\n Studios :\r\n Creative Sounds (Kingston, JA)\r\n Enjoyy and Seed !!!","torrent":{"xt":"urn:btih:c94c73656439cf90a9e5276c861e15806b3e1404","amp;dn":"U-Roy+-+Music+Addict","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c94c73656439cf90a9e5276c861e15806b3e1404","infoHashBuffer":{"type":"Buffer","data":[201,76,115,101,100,57,207,144,169,229,39,108,134,30,21,128,107,62,20,4]},"announce":[],"urlList":[]}}