{"title":"JJ Plush, Born to be Bound [720p]","uid":13449630,"size":300375571,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ca434065ef941ef1d95ae4deaca7183f2abca195&amp;dn=JJ+Plush%2C+Born+to+be+Bound+%5B720p%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxsunset","files":1,"time":1454784959,"description":"Screenshots: \nhttp://imgur.su/image/oPG\r\n\r\nJJ's stepkid Riley Rose is a real loser. She just can't stay out of trouble and she happens to be dressed in white stockings and a mini skirt midwinter for no good reason. JJ and Riley's dad have just bought a big eye sore of a home in town and they plan to spend a lot renovating it making everyone in the neighborhood happy, raising property values. They own a few companies and are having a party on the gutted first floor. JJ has Riley tied up in a bedroom upstairs so she doesn't get in the way and humiliate them. JJ is hoping to get a grant to fix up a building of theirs on the main road and hoping that buying the eye sore home and fixing it up will help get them get the grant for their business. She doesn't want anyone to know about the messed up step daughter. She doesn't think that will help them get the grant or rub elbows with the right people. The problem is Riley keeps making noise, so JJ has to keep leaving the party to try to quiet the girl down. She stuffs satin panties in her mouth, she wraps her head with tons of saran wrap. She has her hanging in some form of ancient Chinese torture (strappado) but she still won't simmer down. Eventually Riley gets out of the strappado but is caught before she can make it down the stairs. She is sat back down in the closet. Black tape is added to the saran wrap to be sure that she can't spit those panties out of her mouth. She is tied in a little ball in the closet, but she keeps slamming her heels on the wood floor so they are finally removed. Riley slides down to the floor and struggles about trying to call for help and get out of her binds but no luck she is just stuck in the closet until the step-monster decides to let her out","torrent":{"xt":"urn:btih:ca434065ef941ef1d95ae4deaca7183f2abca195","amp;dn":"JJ+Plush%2C+Born+to+be+Bound+%5B720p%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca434065ef941ef1d95ae4deaca7183f2abca195","infoHashBuffer":{"type":"Buffer","data":[202,67,64,101,239,148,30,241,217,90,228,222,172,167,24,63,42,188,161,149]},"announce":[],"urlList":[]}}