{"title":"Canoeing and Kayaking Florida - 2nd Edition (2011).epub Gooner","uid":13489755,"size":25083097,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca85a8c8d75993fbe0391e39d156842a1bfcb495&amp;dn=Canoeing+and+Kayaking+Florida+-+2nd+Edition+%282011%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1455112245,"description":"Canoeing and Kayaking Florida - 2nd Edition (2011).epub Gooner\r\n\r\nPublisher: Menasha Ridge Press; 2nd edition (November 11, 2007) Epub: 2011\r\nLanguage: English\r\nISBN-10: 0897329554\r\nISBN-13: 978-0897329552\r\n\r\nCompletely updated, Canoeing &amp; Kayaking Florida, 2nd is the most comprehensive guide to the best of Florida’s unique streams, springs, creeks, and rivers. Engaging and concise yet filled with carefully selected details vital to any successful Florida paddling adventure, Canoeing &amp; Kayaking Florida spares readers encyclopedic fluff in favor of practical, no-nonsense information. With expanded regional maps and revised river maps, Canoeing &amp; Kayaking Florida is simply the best and most informative Florida paddling guide available.\r\n\r\nFlorida has a lot of sand, but it also has a lot of water—and not just for drinking. It’s only natural that native Floridians and transplants alike paddle and ply the waterways of this waterway-rich state. Of course, Florida’s native Indians and subsequent settlers used the creeks, streams, and rivers long before the first plastic kayak or fiberglass canoe took to this watery paradise. In the early 1970s, the state of Florida established a canoe trail system, which was born out of paddlers discovering the many destinations here. For various reasons, this state-sanctioned canoe trail system lost momentum.\r\n\r\nBuilding on the state’s efforts and adding their own discoveries, paddling enthusiasts Elizabeth F. Carter and John L. Pearce brought together the rich and varied streams, creeks, and rivers of Florida. Together, they penned the original version of portions of this book, A Canoeing &amp; Kayaking Guide to the Streams of Florida, Volume I. Their book covered the north central part of the state as well as the panhandle. This was followed by A Canoeing &amp; Kayaking Guide to the Streams of Florida, Volume II, written by Lou Glaros and Doug Sphar. Their book covered the southern half of the state.\r\n\r\nPaddling grew steadily in Florida due in part to these excellent guidebooks, establishment of paddling clubs, positioning of outfitters on rivers, and population growth. More people explored new waterways, not only in new kayaks made of varied plastic but also ultra-lightweight canoes easy to paddle and transport. More recently, a rise in the use of recreational kayaks has led to a rebirth of paddling’s popularity.\r\n\r\nIn 2004, Molloy worked on a new consolidated paddling guide to Florida and refloated previously covered rivers, checking access points, and floated new waterways to highlight newer opportunities for Florida paddlers. Several new wilderness streams were added to the book. In the new 2007 edition, Molloy and Elizabeth Carter added a few more streams, and revised the maps for easier use.\r\n\r\nFor over 20 years, Menasha Ridge Press's Canoeing &amp; Kayaking Florida has provided the essential information needed to paddle the waterways of the Sunshine State","torrent":{"xt":"urn:btih:ca85a8c8d75993fbe0391e39d156842a1bfcb495","amp;dn":"Canoeing+and+Kayaking+Florida+-+2nd+Edition+%282011%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca85a8c8d75993fbe0391e39d156842a1bfcb495","infoHashBuffer":{"type":"Buffer","data":[202,133,168,200,215,89,147,251,224,57,30,57,209,86,132,42,27,252,180,149]},"announce":[],"urlList":[]}}