{"title":"Seven Seas - Native American Flute Stephen Muires Shakuhachi","uid":13060711,"size":148547013,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:caadd2c7f1a4e4fa74f02f29c2c437f45672a9ba&amp;dn=Seven+Seas+-+Native+American+Flute+Stephen+Muires+Shakuhachi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"muirespirate","files":17,"time":1450711546,"description":"CD with Native American flute music, recorded by Stephen Muires.\r\nRecorded with NAFs, shakuhachi and anasazi flutes.\r\n\r\nThese recording are free of copyright, and shared without restriction.\r\nContact:   \r\nMore on: muires (dot) wordpress (dot) com\r\n\r\nAll mp3 files are 320 kbps.\r\n\r\nStephen Muires is author of ‘Ordained – a novel.’\r\n------------------------------------------------\r\n\r\nI am using all kinds of exotic flutes and scales on this album. Applying Swedenborg to music, I have recorded some tracks in far away places, including one from just above the atmosphere, and three tracks on other planets.\r\n\r\nThe individual tracks:\r\n\r\nSeven Seas 3:31 – Cypress flute. Modest beginning of the album.\r\n\r\nLiquid Light 4:16 – Blue Star flute named Terik, cherry wood, in G. Getting a little other worldly already. Don’t listen to the background of this track if you’re not near a bathroom.\r\n\r\nSufi 3:59 – Gehrke middle east tuning, lacewood flute. We’re somewhere on location in the Middle East. Far from Christendom. Strange that other religions contain so much beauty, too.\r\n\r\nKoi 3:52 – Shakuhachi 2.0 Japanese flute, unknown maker, bamboo. In this cave in Japan the water trickled down from the ceiling. My flute got all wet recording this track.Was it worth it?\r\n\r\nHidden Temple 3:33 – Danny Eagle flute in G#, poplar wood. Somewhere in South America. No idea what temple it was. I tried to be friendly and welcoming to the natives who had never seen an alien from outer space before.\r\n\r\nFlute Player On Planet Earth 4:25 – Coyote Oldman flute in low D, cedar, lefty, horse totem. Note how soft and gentle life on earth is.\r\n\r\nSame Flute Player On Saturn 4:44 – Same flute and tune as just before. But this time recorded on Saturn. The sound you hear in the background is the grinding together of rocks in the rings circling that planet.\r\n\r\nWhy Don’t He Write 4:19 – Three Leaf flute, maple and purple heart, Stephen Grosvenor Meier. I don’t know why he didn’t write. Gone to places no one has been before, maybe?\r\n\r\nGobi 2:33 – Mark Purtill, Namaste flute, in E, Bhairavi raga scale, in PVC. OK, this is straight out of Meetings with Remarkable Men. Wow, the mountains are singing.\r\n\r\nPagoda 2:53 – Chinese Xiao flute in F, bamboo, 6 hole. Notice the Chinese flute. Yes, you guessed right, recorded in China. But you can easily hear that.\r\n\r\nFast River 2:43 – Coyote Oldman backpacking flute in high D, cedar, alternative tuning. The natives were chasing me. So I had to play my little Coyote flute to keep them at bay.\r\n\r\nI Hear a Bell 2:33 – High Spirits flute, Golden Eagle, walnut in F#. This a rough and ready piece, but the oddest thing happened. despite my irreverence recording this track, several times I thought I could hear a bell ringing loud and clear…?\r\n\r\nDark Jupiter 3:43 – Erik the Flutemaker, bamboo, Kiowa love flute in F. Recorded on Jupiter. You can hear the weird atmosphere noise in the background. Heavy gravity, man.\r\n\r\nMount Fuji As Seen From The Moon 3:21 – Shakuhachi 2.4, Shepard, dark bamboo. Contrary to popular belief, there are people on the moon. They don’t look like us. And the reverb is just crazy when playing a shak there.\r\n\r\nRain Wilds 2:39 – Low bamboo or rivercane, 5 holes. Robin Hobb knows this place. You can’t imagine the height of these trees. And when it rains it just never stops.\r\n\r\nAbove the World 3:35 – Blue Star Wakan in F#, alder. I felt very elevated, literally, when recording this track. Those Blue Star flutes sing like no others.\r\n\r\nDeath 3:00 – HawkHurst bamboo flute, low E. Fittingly, the last track is full of death rattles. The HawkHurst flute really allows a note to breath its last.\r\n\r\n \r\n\r\nThat’s it for this CD, 17 tracks and 60 minutes of excruciating spiritual music. I hope y’all appreciate that I am putting this stuff out here, freely available, at no charge","torrent":{"xt":"urn:btih:caadd2c7f1a4e4fa74f02f29c2c437f45672a9ba","amp;dn":"Seven+Seas+-+Native+American+Flute+Stephen+Muires+Shakuhachi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"caadd2c7f1a4e4fa74f02f29c2c437f45672a9ba","infoHashBuffer":{"type":"Buffer","data":[202,173,210,199,241,164,228,250,116,240,47,41,194,196,55,244,86,114,169,186]},"announce":[],"urlList":[]}}