{"title":"Megan Vale aka Francheska - scene from Teenage Sodomy 2","uid":13490659,"size":362718802,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:cbb1ea393d7cb5e7c7f31e9efda0d06a3d829897&amp;dn=Megan+Vale+aka+Francheska+-+scene+from+Teenage+Sodomy+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxsunset","files":1,"time":1455122208,"description":"Screenshots: \nhttp://imgur.su/image/bjxS\r\n\r\nWell the word Epic Orgasm does not come to mind often.. well as a matter of fact in my previous uploads (more than 200) i have never used the word.. But this time i have to.. i have seen this seen being played on many website ads and finally decided to hunt it down.. its Megan Vale aka Francheska from Teenage Sodomy 2...\r\n\r\nThe scene starts off with 2 guys and Megan talking in what i presume is Russian.. the scene quickly moves on as the 2 guys stat the action. some blowjob and vaginal sex..\r\n\r\nThis is followed by anal. the guy has difficulty getting his dick in her tight asshole but eventually manages to do so. The both of them start working on that sweet asshole and stretch it. they really give her a good anal pounding and stretching her asshole to the max.\r\n\r\nThen around the 18 min 50 second mark, while the guy is fucking her in the ass and rubbing her pussy.. She has an incredible orgasm. and i do mean Incredible. she starts shaking and tries to pull away but the guy holds her down and keeps rubbing her pussy making the orgasm more intense. you can see her eyes rolling, her entire body shivering and her screaming..\r\n\r\nAs soon as it over you would think she would get some rest, but no.. they imminently pin her down and finger her vigorously making her squirt and making her cum TWICE more...\r\n\r\nThey again start fucking her and they end it off by one guy dropping his load on her ass and other in her mouth","torrent":{"xt":"urn:btih:cbb1ea393d7cb5e7c7f31e9efda0d06a3d829897","amp;dn":"Megan+Vale+aka+Francheska+-+scene+from+Teenage+Sodomy+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbb1ea393d7cb5e7c7f31e9efda0d06a3d829897","infoHashBuffer":{"type":"Buffer","data":[203,177,234,57,61,124,181,231,199,243,30,158,253,160,208,106,61,130,152,151]},"announce":[],"urlList":[]}}