{"title":"Handbook of Fluorous Chemistry - John A. Gladysz et al.","uid":14512897,"size":6429713,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc3db5d9816ff73c70d051a70d62a7d78ae0fa38&amp;dn=Handbook+of+Fluorous+Chemistry+-+John+A.+Gladysz+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1462305317,"description":"Handbook of Fluorous Chemistry - John A. Gladysz et al. (Wiley-VCH, 2004).pdf\r\n\r\nEdited by the leading experts John Gladysz, Dennis Curran, and Istv?n Horv?th, this handbook is the first to summarize all the essential aspects of this emerging field of chemistry. Whether the reader is seeking an introduction to the concept of fluorous biphase catalysis, summaries of partition coefficients involving fluorous and organic solvents, or information on the latest fluorous mixture separation techniques, this authoritative compilation of contributions, written by the world's top authors, provides key information needed for successfully working with the diverse and fascinating families of fluorous molecules. The large number of reliable experimental procedures in particular makes this the ideal guide for newcomers wanting to use this elegant method in the laboratory. In addition, experts will also find a wealth of important information concisely contained in one ready reference. The result is an indispensable resource for everyone currently working or intending to work in this field","torrent":{"xt":"urn:btih:cc3db5d9816ff73c70d051a70d62a7d78ae0fa38","amp;dn":"Handbook+of+Fluorous+Chemistry+-+John+A.+Gladysz+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc3db5d9816ff73c70d051a70d62a7d78ae0fa38","infoHashBuffer":{"type":"Buffer","data":[204,61,181,217,129,111,247,60,112,208,81,167,13,98,167,215,138,224,250,56]},"announce":[],"urlList":[]}}