{"title":"The Triple Path v. 2015.10.23","uid":13054225,"size":6214933,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cca8f7a94f23a15b667e1c27b6c429455e1b372c&amp;dn=The+Triple+Path+v.+2015.10.23&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":6,"time":1450647342,"description":"The Triple Path v.2015.10.23\r\nBy: James Kenneth Rogers\r\n290 Pages\r\nLanguage: English\r\nISBN-13: 978-0615954158\r\nISBN-10: 0615954154\r\nFormat: PDF, EPUB, Kindle (azw3)\r\n\r\nThe ancient cosmologies and disproved beliefs of the world's major religions are increasingly dissatisfying and irrelevant to growing numbers of people. On the other hand, religion brings many benefits for which the New Atheists have been unable to provide a viable alternative.\r\n\r\nTaking a tone sympathetic to the views of both religious and atheist readers alike, the Triple Path offers a credible synthesis of modern scientific knowledge and the useful teachings and practices of the world's major religions, making use of the latest scientific research and referencing scores of peer-reviewed academic papers. Most importantly, it collects the most moving words of wisdom of the world's great sacred texts and then updates and adds to them to create a new approach relevant to life today.\r\n\r\nYou can read more about the book at TriplePath.org.\r\n\r\n\r\nAbout the author: James Kenneth Rogers received a B.A. in International Relations, with honors, from Brigham Young University, a Juris Doctor from Harvard Law School, and a Masters of Law in International Law from the University of Cambridge. He is from Arizona, but has also lived in Utah, Massachusetts, Brazil, England, and Namibia. He loves writing, running, and traveling, but most of all, spending time with his wife and four children.\r\n\r\nKey words: Christianity, Atheism, Buddhism, Hinduism, Mormonism, Marcus Aurelius, Meditations, meditation, philosophy, prayer, religion, science, the Bible, Buddha, Dhammapada, Chuang Tzu, Jesus, Gospel of Thomas, Joseph Smith, the Book of Mormon, Doctrine and Covenants, Tao Te Ching, Jonathan Haidt, elevation\r\n\r\nThis book is protected by copyright. By downloading this book, you agree to be bound by the terms of the copyright and redistribution permissions granted by the author listed at http://TriplePath.org/License and also included with this torrent in a file titled License.txt","torrent":{"xt":"urn:btih:cca8f7a94f23a15b667e1c27b6c429455e1b372c","amp;dn":"The+Triple+Path+v.+2015.10.23","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cca8f7a94f23a15b667e1c27b6c429455e1b372c","infoHashBuffer":{"type":"Buffer","data":[204,168,247,169,79,35,161,91,102,126,28,39,182,196,41,69,94,27,55,44]},"announce":[],"urlList":[]}}