{"title":"Databook of Antistatics - George Wypych","uid":14593924,"size":1830551,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1a3343ae17d33ceab6f53fa75d680c60d286afa&amp;dn=Databook+of+Antistatics+-+George+Wypych&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1463010419,"description":"Databook of Antistatics - George Wypych (ChemTec, 2014).pdf\r\n\r\nThe Antistatics Databook contains detailed information on over 300 frequently used antistatic additives for polymers — additives capable of modifying properties of materials so that they become antistatic, conductive or EMI shielded. The potential risks of static electricity, as well as the variety of antistatic additives available, mean that selecting the correct antistatic agent is vital. This databook is an important source of information for industry, research, and academia.\r\n\r\nEach additive is presented with data in the following categories: General Information; Physical Properties; Health and Safety; Ecological Properties; and Use and Performance. The Databook includes a large amount of data, from state, odor, and color to autoignition temperature and probability of biodegradation. Recommendations are provided for products, processing methods and dosages, and the features and benefits of each additive are assessed.\r\n\r\n\r\nContains the most extensive data available on a large number of antistatics\r\nFeatures 130 data fields for each additive, divided into the following categories: General Information, Physical Properties, Health and Safety, Ecological Properties, and Use and Performance.\r\nIncludes an assessment of benefits and properties of each additive, recommended dosages and processing methods","torrent":{"xt":"urn:btih:d1a3343ae17d33ceab6f53fa75d680c60d286afa","amp;dn":"Databook+of+Antistatics+-+George+Wypych","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1a3343ae17d33ceab6f53fa75d680c60d286afa","infoHashBuffer":{"type":"Buffer","data":[209,163,52,58,225,125,51,206,171,111,83,250,117,214,128,198,13,40,106,250]},"announce":[],"urlList":[]}}