{"title":"Thomas Ringstedt - Röd snö (Svensk Retail EPUB)","uid":13018667,"size":445893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1c5057b2c571a4ea18eb0db5f6ac71a3c23af95&amp;dn=Thomas+Ringstedt+-+R%26ouml%3Bd+sn%26ouml%3B+%28Svensk+Retail+EPUB%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1450318340,"description":"Författare: Thomas Ringstedt\r\n       Titel: Röd snö\r\nUtgivningsår: 2012\r\n       Språk: Svenska\r\n        ISBN: 9789174292480\r\n      Format: Retail EPUB\r\n\r\n1918 hemsökte spanska sjukans influensa världen och dödade fler människor än hela första världskriget. I ett laboratorium i Uppsala arbetar forskarna med viruset, som har återskapats från döda kroppar i Alaska. De lyckas framställa en ovanligt aggressiv variant med våldsamt sjukdomsförlopp och dödlig utgång. Strax därefter hittas tre djurrättsaktivister mördade, och på en närbelägen gård håller en ökänd tysk nynazist på att upprätta en ny världsordning. En natt blir viruset stulet från laboratoriet.\r\n\r\nKriminalinspektör Ulf Beow är mitt uppe i en stillastående utredning av mordet på en kollega. Samtidigt försöker han hantera separationen från sin sambo och vårdnaden om deras son, och ta hand om sin psykiskt instabila mor. Han blir inkopplad på fallet med det stulna viruset, och inser snart att biovapnen, nynazisterna, och de olika morden på något sätt måste hänga ihop. Till sin hjälp får han mikrobiologen Lotta Nordenflycht, en ung kvinna som visar sig ha oanade resurser. Tillsammans försöker de spåra viruset, som i händerna på terrorister kan orsaka massdöd och kaos världen över.\r\n\r\nRöd snö är en samtidsthriller i högt tempo; en roman om ideologier som gått över styr, biologiska massförstörelsevapen och människorna bakom dem","torrent":{"xt":"urn:btih:d1c5057b2c571a4ea18eb0db5f6ac71a3c23af95","amp;dn":"Thomas+Ringstedt+-+R%26ouml%3Bd+sn%26ouml%3B+%28Svensk+Retail+EPUB%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1c5057b2c571a4ea18eb0db5f6ac71a3c23af95","infoHashBuffer":{"type":"Buffer","data":[209,197,5,123,44,87,26,78,161,142,176,219,95,106,199,26,60,35,175,149]},"announce":[],"urlList":[]}}