{"title":"Cartel Land (2015) 1080p LAT - ZeiZ","uid":13475455,"size":3362575500,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:d5dffb6b09b0493c273808da56fc387ed0f74acf&amp;dn=Cartel+Land+%282015%29+1080p+LAT+-+ZeiZ&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":5,"time":1455005394,"description":"With unprecedented access, CARTEL LAND is a riveting, on-the-ground look at the journeys of two modern-day vigilante groups and their shared enemy - the murderous Mexican drug cartels. In the Mexican state of Michoacán, Dr. Jose Mireles, a small-town physician known as &quot;El Doctor,&quot; leads the Autodefensas, a citizen uprising against the violent Knights Templar drug cartel that has wreaked havoc on the region for years. Meanwhile, in Arizona's Altar Valley - a narrow, 52-mile-long desert corridor known as Cocaine Alley - Tim &quot;Nailer&quot; Foley, an American veteran, heads a small paramilitary group called Arizona Border Recon, whose goal is to stop Mexico's drug wars from seeping across our border. Filmmaker Matthew Heineman embeds himself in the heart of darkness as Nailer, El Doctor, and the cartel each vie to bring their own brand of justice to a society where institutions have failed. CARTEL LAND is a chilling, visceral meditation on the breakdown of order and the blurry line between good and evil.\r\n\r\nCartel Land es como un western clásico en el siglo 21, enfrentando a los vigilantes a ambos lados de la frontera contra los cárteles de la droga mexicanos. Con un acceso sin precedentes, esta película provoca preguntas profundas sobre la anarquía, la ruptura del orden, y si sólo queda para los ciudadanos tomar las armas para luchar contra la violencia con violencia","torrent":{"xt":"urn:btih:d5dffb6b09b0493c273808da56fc387ed0f74acf","amp;dn":"Cartel+Land+%282015%29+1080p+LAT+-+ZeiZ","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5dffb6b09b0493c273808da56fc387ed0f74acf","infoHashBuffer":{"type":"Buffer","data":[213,223,251,107,9,176,73,60,39,56,8,218,86,252,56,126,208,247,74,207]},"announce":[],"urlList":[]}}