{"title":"{TeamSkeet - MyBabysittersClub} Harley Jade - A Womans Touch (30","uid":14455242,"size":255518940,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:d7290b29a1f987b6ed6d53229ce0c43763225a42&amp;dn=%7BTeamSkeet+-+MyBabysittersClub%7D+Harley+Jade+-+A+Womans+Touch+%2830&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"porn4u","files":1,"time":1461788907,"description":"{TeamSkeet - MyBabysittersClub} Harley Jade - A Womans Touch (30 April 2016 pre-release) 480p\r\n\r\n\r\n\r\nscreenshot\r\n\r\n\r\n \nhttp://xxxhost.me/viewer.php?file=2zhmnbd3ma1nre40i637.jpg\r\n\r\n\r\nGeneral info: \r\n\r\n\r\nSize: 243 Mb, \r\nDuration: 00: 28: 59, \r\nStreams: 2,\r\n Full bitrate: 1174 kb/s\r\nVideo: H264 (avc1), 854x480, 29.97 fps\r\nAudio: AAC, STEREO, 48 kHz, 164 kb/s\r\n\r\n\r\nMr. John gets called in to work late night. Time to call the babysitters club to take care of the baby while Mr. John goes to make that gravy. Harley Jade shows up at the door promptly, ready to do her duties. Mr. John could tell this wasnt her first time, so he didnt have to explain much. Unexpectedly, the baby gets her super dirty, and the polite girl Harley is calls and makes sure it would be ok if she uses the washing machine and takes a shower. Mr. john doesnt mind at all. As shes lathering up her juicy booty, Mr. John gets home a bit early. He looks for Harley and finds her through a crevice in the shower curtain. He automatically gets hard on and starts plotting how he might be able to get a little extra action. Harley comes out of the shower still in her lingerie and sits on the couch. Mr. John says how much he loves it, and asks if maybe should would babysit in those clothes for a higher rate. She seems confused, until he brings up her student loans and how a womans touch might be able to make them disappear. She seems reluctant at first, but as he starts to rub her pussy you can tell she gets super turned on. Before she goes in balls deep, he must promise to keep this a secret. Done! This hot living room fuck sesh commences and doesnt stop for almost 20 minutes. Harley is sexual goddess and really knows how to work that ass to make fucking extra fun for her and her partner. She swallows his cum, and he swallows the secret. No one will ever know!","torrent":{"xt":"urn:btih:d7290b29a1f987b6ed6d53229ce0c43763225a42","amp;dn":"%7BTeamSkeet+-+MyBabysittersClub%7D+Harley+Jade+-+A+Womans+Touch+%2830","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7290b29a1f987b6ed6d53229ce0c43763225a42","infoHashBuffer":{"type":"Buffer","data":[215,41,11,41,161,249,135,182,237,109,83,34,156,224,196,55,99,34,90,66]},"announce":[],"urlList":[]}}