{"title":"Ranking Dread - Greensleeves Most Wanted (Fattie Boom Boom)","uid":13069765,"size":684990531,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d79a4d4bfc842916ac214ad11853cb8b8c649eba&amp;dn=Ranking+Dread+-+Greensleeves+Most+Wanted+%28Fattie+Boom+Boom%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jokersmoker","files":13,"time":1450782972,"description":"Ranking Dread - Greensleeves Most Wanted (Fattie Boom Boom)\r\n\r\n\r\n\r\n\r\n Tracklist :\r\n\r\n 1.Fattie Boom Boom\r\n 2.Dub Boom\r\n 3.Love A Dub\r\n 4.Dub A Dub\r\n 5.Shut Me Mouth\r\n 6.Shut Up Shut Up\r\n 7.If Nanny Was Here\r\n 8.Nanny Was Here\r\n 9.My Mammy\r\n 10.Mammy Mammy\r\n 11.Jean Green\r\n 12.Jean Green Dub\r\n\r\n Here comes another release in Greensleeves Records' 'Most Wanted' series, collecting together a selection of classic deejay tunes (and their crashing dub versions) from the late great Ray Symbolic Sound System toaster Ranking Dread, who later on became one of the resident deejays on Lloydie Coxsone's London-based Outernational Sound System when he relocated to the UK. \r\n\r\n Ranking Dread -- a very talented deejay with a badman reputation who got himself into more than a few brushes with the authorities and ended up on the run, eventually being extradited from Canada and imprisoned in Jamaica where he was killed -- enjoyed success during the early eighties. He first had a huge hit with &quot;Love A Dub&quot; and later hit the UK Top 25 in 1981 with the huge hit &quot;Fattie Boom Boom&quot;, which went on to sell over 13,000 copies. Before that he had already set the UK reggae scene alight with his 1980 Sugar Minott produced album &quot;Lots Of Loving&quot;, which sold like hot cakes. \r\n\r\n During 1981 and 1982 Ranking Dread released five 12&quot; singles on Greensleeves, which are now -- better late than never we would say -- collected on CD for the very first time. Also featured here is a track called &quot;Jean Green&quot; (produced by Henry &quot;Junjo&quot; Lawes) that only ever appeared on a various artists album entitled &quot;Whole New Generation Of DJ&quot;, issued by Greensleeves in 1981. All the tracks taken from the 12&quot; singles were produced by Ranking Dread himself and feature the talents of Sly &amp; Robbie, Roots Radics, Jackie Mittoo and Scientist. \r\n\r\n Of course the album opens with the tune that is probably best known to a wide audience, &quot;Fattie Boom Boom&quot;. The latter was his first recording for Greensleeves and definitely lighter in tone to many of his previous outing, thus making it a serious crossover contender. The solid &quot;Love A Dub&quot; combines Ranking Dread's talent with that of Jackie Mittoo and The Roots Radics, while the awesome &quot;Shut Me Mouth&quot; is a version to Dennis Brown's &quot;Breaking Down The Barriers&quot;. &quot;If Nanny Was Here&quot; is a nice tune with intriguing lyrics, in contrast to &quot;My Mammy&quot; which once again makes us wonder why Jamaican artists have a strong tendency to record songs about their mother. \r\n\r\n &quot;Jean Green&quot;, a version to Johnny Osbourne's &quot;Too Sexy&quot;, rounds off this worthwhile album in great style. \r\n\r\n Enjoyyy and Seed !!!","torrent":{"xt":"urn:btih:d79a4d4bfc842916ac214ad11853cb8b8c649eba","amp;dn":"Ranking+Dread+-+Greensleeves+Most+Wanted+%28Fattie+Boom+Boom%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d79a4d4bfc842916ac214ad11853cb8b8c649eba","infoHashBuffer":{"type":"Buffer","data":[215,154,77,75,252,132,41,22,172,33,74,209,24,83,203,139,140,100,158,186]},"announce":[],"urlList":[]}}