{"title":"Os Oito Odiados (2015)[720p]","uid":14487593,"size":2098323797,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:db0b18364b399fd27e87491cb736e6918804871c&amp;dn=Os+Oito+Odiados+%282015%29%5B720p%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"gilsonC10","files":3,"time":1462069416,"description":"Em Os Oito Odiados, que se passa seis ou oito ou doze anos depois do final da Guerra Civil Americana, uma diligência desloca-se a toda velocidade pela paisagem invernal do Wyoming. Os passageiros – o caçador de recompensas John Ruth (Kurt Russell) e a fugitiva Daisy Domergue (Jennifer Jason Leigh) – estão a caminho da cidade de Red Rock onde Ruth, conhecido na região por O Carrasco, levará Domergue para a justiça. Ao longo da estrada, eles encontram dois forasteiros: o Major Marquis Warren (Samuel L. Jackson), um ex-soldado negro do exército que se tornou um infame caçador de recompensas, e Chris Mannix (Walton Goggins), um sulista renegado que diz ser o mais novo xerife da cidade. Perdendo o controle da viagem na nevasca, Ruth, Domergue, Warren e Mannix buscam refúgio no Armazém da Minnie, uma parada de diligências situada numa passagem entre montanhas. Quando eles chegam ao armazém, são recebidos não pela proprietária Minnie, mas por quatro rostos desconhecidos. Bob (Demián Bichir), que está tomando conta do armazém enquanto Minnie visita a mãe, na companhia de Oswaldo Mobray (Tim Roth), o enforcador de Red Rock, o vaqueiro Joe Gage (Michael Madsen), e o general confederado Sanford Smithers (Bruce Dern). À medida que a tempestade vai ganhando força sobre as montanhas, os nossos oito viajantes vêm a saber que podem não chegar à cidade de Red Rock afinal…","torrent":{"xt":"urn:btih:db0b18364b399fd27e87491cb736e6918804871c","amp;dn":"Os+Oito+Odiados+%282015%29%5B720p%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db0b18364b399fd27e87491cb736e6918804871c","infoHashBuffer":{"type":"Buffer","data":[219,11,24,54,75,57,159,210,126,135,73,28,183,54,230,145,136,4,135,28]},"announce":[],"urlList":[]}}