{"title":"Microsoft OneNote","uid":13486574,"size":390008594,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:db2cfbc9957069d34c7c5cc9e9bfe48976bc1ee7&amp;dn=Microsoft+OneNote&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NDog","files":1,"time":1455084245,"description":"Description\r\nChosen *Best of 2014* by Apple.\r\n\r\nCapture your thoughts, discoveries, and ideas with OneNote, your very own digital notebook. With OneNote you can seize that moment of inspiration, plan that big event, or track that list of errands that are too important to forget. Whether you're at home, in the office, or on the go, your notes are available to you on all your devices.\r\n\r\n-- Your notes… your style --\r\nType anywhere on this free-form canvas and easily rearrange and move your content to any place on the page. Style your notes as you wish. Make your notes bold, italicized, or colorful and organize your content with tables.\r\n\r\n-- Capture anything --\r\nAdd pictures of recipes, your PowerPoint doc or PDF for school, links to your favorite sites, and web articles for future reference. Capture it all in OneNote and add your annotations.\r\n\r\n-- Powerful organization --\r\nOrganize your notes in a way that works best for you. Create, rename, search, sort, color code, and copy pages, sections, and notebooks to organize your content as you'd like. Keep your private notes safe.\r\n\r\n-- Tag it --\r\nEasily tag your notes so they stand out. Track a list of your daily to-dos, flag questions to raise after a meeting, or mark the important points from a lecture.\r\n\r\n-- Think together --\r\nShare your notes with your friends and colleagues, whether it's a party your planning with others or a school project you’re working on with your group. Work together in a shared notebook at the same time.\r\n\r\n-- Always with you --\r\nAccess your notes on your Mac, iPhone, iPad and other devices. Your notes are synced to the cloud (OneDrive, OneDrive for Business, and SharePoint) making it easy to access your recipe notes on your iPhone at the store, your homework on your Mac in class, or your itinerary on your iPad during your trip.\r\n\r\n\r\nOneNote is free on Mac and many other devices. Get started today! Download OneNote and sign in with your Microsoft Account or the account assigned to you by your work or school. \r\n\r\nNeed help with OneNote: http://aka.ms/onenote-mac-help\r\nAdd to our feature suggestion box: http://aka.ms/onenote-mac-suggest\r\n\r\nWhat's New in Version 15.18\r\n- Sick of circling things? Keeping chart axes straight have your mood slopin' down? We've got your back. You can now add perfectly crisp lines, polygons, and other geometric miscellanies from the &quot;Insert&quot; menu. \r\n- We spiffied up Search over the holidays and added some new tricks! Now: search all of your OneDrive notebooks, even if they're not on your device; zippier results, so zippy you can search for things you're already reading and *almost* find them quicker; and, as before, see glimpses of notes you haven't written yet. Wait. Not that last one. But the rest!\r\n\r\nHaving trouble? Send feedback in the app by clicking the smiley face at the top right of the app. \r\nHave an idea? Add to our feature suggestion box at http://aka.ms/onenote-mac-suggest","torrent":{"xt":"urn:btih:db2cfbc9957069d34c7c5cc9e9bfe48976bc1ee7","amp;dn":"Microsoft+OneNote","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db2cfbc9957069d34c7c5cc9e9bfe48976bc1ee7","infoHashBuffer":{"type":"Buffer","data":[219,44,251,201,149,112,105,211,76,124,92,201,233,191,228,137,118,188,30,231]},"announce":[],"urlList":[]}}