{"title":"Close Order (Early Access v15)","uid":13042978,"size":257558567,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:db57fe5a8fb660bd39264dd3f612ae9ffea2c7d2&amp;dn=Close+Order+%28Early+Access+v15%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dauphong","files":1,"time":1450548871,"description":"About This Game\r\nClose Order is an arcade shooter with one simple goal: become a badass armada! It's not about you. It's about other ships around you known as minions that exponentially increase your firepower!\r\n\r\nDefeat enemies for parts. Combine those parts into minions. Move them around your armada however you please. Become badass!\r\n\r\nPlay through a short, episodic narrative in Story mode to discover the fate of humanity, or boot up Survival mode for fast-paced action!\r\nFeatures\r\n\r\n    Grow from a single ship into a massive armada!\r\n    Plays like a shooter, feels like arcade, acts like tower defense, relies on strategy, and is always distinctly bullet hell!\r\n    Experience the remnants of the galaxy post-Earth in Story mode.\r\n    Tackle the story your way: missions are set up in an episodic fashion through interconnected hub worlds.\r\n    Not in it for the story? No problem! Boot up Survival mode where you start with nothing and must grow your armada in order to survive.\r\n    Duke it out in Simple Survival, where levels have pre-made waves of progressively stronger enemies.\r\n    Too easy? Take it one step further with Custom Chaos, a customizable version of Simple Survival that allows you to choose the level you'd like to play, the type and difficulty of enemies, and the amount of enemies you wish to face","torrent":{"xt":"urn:btih:db57fe5a8fb660bd39264dd3f612ae9ffea2c7d2","amp;dn":"Close+Order+%28Early+Access+v15%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db57fe5a8fb660bd39264dd3f612ae9ffea2c7d2","infoHashBuffer":{"type":"Buffer","data":[219,87,254,90,143,182,96,189,57,38,77,211,246,18,174,159,254,162,199,210]},"announce":[],"urlList":[]}}