{"title":"The Lake House - Kate Morton","uid":13024535,"size":673544,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ddad04d64237cfc2e701d7d76de0789f8740995e&amp;dn=The+Lake+House+-+Kate+Morton&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TopShelfBook","files":2,"time":1450388935,"description":"The Lake House - Kate Morton\r\n\r\nFrom the New York Times and internationally bestselling author of The Secret Keeper and The Distant Hours, an intricately plotted, spellbinding new novel of heartstopping suspense and uncovered secrets.\r\n\r\nLiving on her family’s idyllic lakeside estate in Cornwall, England, Alice Edevane is a bright, inquisitive, innocent, and precociously talented sixteen-year-old who loves to write stories. But the mysteries she pens are no match for the one her family is about to endure…\r\n\r\nOne midsummer’s eve, after a beautiful party drawing hundreds of guests to the estate has ended, the Edevanes discover that their youngest child, eleven-month-old Theo, has vanished without a trace. What follows is a tragedy that tears the family apart in ways they never imagined.\r\n\r\nDecades later, Alice is living in London, having enjoyed a long successful career as an author. Theo’s case has never been solved, though Alice still harbors a suspicion as to the culprit. Miles away, Sadie Sparrow, a young detective in the London police force, is staying at her grandfather’s house in Cornwall. While out walking one day, she stumbles upon the old estate—now crumbling and covered with vines, clearly abandoned long ago. Her curiosity is sparked, setting off a series of events that will bring her and Alice together and reveal shocking truths about a past long gone...yet more present than ever.\r\n\r\nA lush, atmospheric tale of intertwined destinies, this latest novel from a masterful storyteller is an enthralling, thoroughly satisfying read.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:ddad04d64237cfc2e701d7d76de0789f8740995e","amp;dn":"The+Lake+House+-+Kate+Morton","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddad04d64237cfc2e701d7d76de0789f8740995e","infoHashBuffer":{"type":"Buffer","data":[221,173,4,214,66,55,207,194,231,1,215,215,109,224,120,159,135,64,153,94]},"announce":[],"urlList":[]}}