{"title":"SUU Design Video Thumbnails Maker v8.0.0.1","uid":13244141,"size":21953222,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:df6413c56b7e9edac333c63ffe8cb163ad33319b&amp;dn=SUU+Design+Video+Thumbnails+Maker+v8.0.0.1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ZarkBit","files":1,"time":1453078416,"description":"SUU Design Video Thumbnails Maker v8.0.0.1\r\n\r\nUpdated to v8.0.0.1\r\n new: Support for Windows 10 is added.\r\n changed: &quot;Try substituting for black frames&quot; feature is replaced by &quot;Try substituting for any color frames&quot; feature. That means the program will try to substitute any nearly black/white/green/yellow/... frame to another. New algorithm is more powerful and works 30% faster than the old one.\r\n changed: Audio/Video information module is updated.\r\n fixed: VTM did not process Special matricies with only 1 row or only 1 column correctly.\r\n fixed: Rare Ultimate engine crashes are fixed.\r\n special note: If you use Pictures Thumbnails Maker, you may want to install its latest version too, because PTM uses its own instance of Pictures Thumbnails Viewer.\r\n\r\nMicrosoft .NET Framework 4.0 Client Profile or Microsoft .NET Framework 4.0+ is required to run the appliaction.\r\n\r\nVideo Thumbnails Maker allows you to make thumbnails (caps, previews, screen-lists) and screenshots of video files. The utility can be used for home-video cataloging and for network video sharing support.\r\n\r\nThe tool consists of:\r\nVideo Thumbnails Maker = MAKER\r\nPictures Thumbnails Viewer = VIEWER\r\n\r\nThe main advantage of the VIEWER is the ability to start related video-file right from a thumbnail sheet.\r\nMoreover, you can start the video from the moment from which the thumbnail shot was taken!\r\nVTX picture files are required to be generated.\r\n\r\nKey features of the program:\r\nSupports of the batch processing of videofiles.\r\nSupports of practically any video file formats.\r\n4 rendering engines, including Crystal engine with embedded (built-in) codec system.\r\n30 Special matrices. Special matrix is a matrix where large and small frames are mixed.\r\n&quot;Construction set&quot; feature allows you to arrange big/small/empty tiles in any way.\r\nTimeline Flow contol. You can choose between &quot;Row by Row&quot;, &quot;Column by Column&quot; and even &quot;Shuffle times&quot; options.\r\nYou can pause/continue or stop active job at any moment.\r\nThe VIEWER allows you to start related video-file right from a thumbnail sheet.\r\nMoreover, you can start the video from the moment from which the thumbnail shot was taken!\r\nVisual preview of your settings right in the Options window! Momentary rendering. Never before the creation of thumbnails was so simple! Maximum freedom for your creativity.\r\nOptions preset file format (*.vtm). You can run a preset by clicking on it in your file manager, the program is automatically opened with the imported tuning.\r\nQuick preview for base preset files. You can replace base presets with your own files to have fast access to them.\r\nYou can save each tile to a separate file.\r\nYou can combine several thumbnail sheets into a single picture &quot;packs&quot;.\r\nYou can choose your own image as a background.\r\nWatermarks (alpha-channels and transparency are supported). Make your own style.\r\nFit screen option (auto adjustment of the shots to fit your screen resolution).\r\nSpecial effects (drop shadow, gray scale, cut edges, tile outlines).\r\nCustomizable fonts, colors, contours, shadows, frames, background, text.\r\nStamp time in shots option (5 different locations, transparency, contour).\r\nAudio/Video information stamp option (4 different locations and customizable configurations).\r\nExport of Audio/Video technical details to CSV, XML and VTT (WebVTT) file formats is supported.\r\n&quot;Try to substitute black frames&quot; option.\r\n&quot;Custom comment&quot; option.\r\n7 interface languages (English, German, French, Slavic, Turkish).\r\nCommand Line Interface support.\r\nThe program's small size.\r\nHot keys, hints in tooltips.\r\nAnd much more.\r\n  \nhttp://www.suu-design.com/projects.html#VTM","torrent":{"xt":"urn:btih:df6413c56b7e9edac333c63ffe8cb163ad33319b","amp;dn":"SUU+Design+Video+Thumbnails+Maker+v8.0.0.1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df6413c56b7e9edac333c63ffe8cb163ad33319b","infoHashBuffer":{"type":"Buffer","data":[223,100,19,197,107,126,158,218,195,51,198,63,254,140,177,99,173,51,49,155]},"announce":[],"urlList":[]}}