{"title":"Britains.Treasure.Islands--BBC-2016-3.Eps-w.subs-360p","uid":14448833,"size":1065587205,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e1174b5a9ac3a547c00aeab981eb6a02a1b4d171&amp;dn=Britains.Treasure.Islands--BBC-2016-3.Eps-w.subs-360p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"uggauga","files":6,"time":1461724510,"description":"\nBritain's Treasure Islands\r\n\r\nNaturalist Stewart McPherson travels to all the UK Overseas Territories, exploring their wildlife, landscapes, history and people\r\n\r\nBBC (2016) - 3 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/b077sxwf\r\n_______________________________________\r\n\r\n640x360 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!\r\n_______________________________________\r\n\r\nOcean Odyssey - Episode 1 of 3\r\nNaturalist Stewart McPherson's exploration of the UK Overseas Territories begins in Bermuda, in the north Atlantic, where he finds ancient castles and a bird that had been thought extinct for more than 300 years.\r\nStewart then travels to the British Indian Ocean Territory, which lies halfway between Tanzania and Indonesia, where he comes across the world's biggest land invertebrate. He eventually reaches Pitcairn Island, in the southern Pacific, where he meets the descendants of the mutineers of the Bounty.\r\n\r\nSouthern Ocean - Episode 2 of 3\r\nStewart McPherson continues his quest to visit all of the UK's Overseas Territories.\r\nHis second journey begins on Tristan da Cunha, the most remote inhabited island on earth and home to the entire world population of a spectacular albatross. From here, he travels to the Falkland Islands, coming face to face with a fearsomely intelligent bird of prey, and arrives in Stanley, the capital, in time for celebrations following the referendum in which the islanders decided overwhelmingly to remain part of Britain.\r\nLeaving the Falklands, he follows in the wake of Shackleton and his ill-fated Antarctic expedition, first to South Georgia to witness one of the greatest wildlife spectacles on the planet, then on to the frozen wilderness of the Antarctic peninsula.\r\n\r\nOutposts of Empire - Episode 3 of 3\r\nThe final part of Stewart McPherson's epic journey to visit all of the UK's Overseas Territories takes him to islands that could not be more different, yet are all united by being important military or trading bases, both historically and, in some cases, still today.\r\nThis journey begins in the Caribbean, where amongst sunbathing tourists, he finds some unexpected wildlife and an active volcano. In the centre of the Atlantic, the pinprick of Ascension Island, an extinct volcano, looks like somewhere on Mars rather than a part of Britain, yet it too has rich wildlife.\r\nSt Helena is so remote it was seen as a safe prison for Napoleon Bonaparte after his defeat at Waterloo. And finally, Stewart visits the newest of the Overseas Territories, the Sovereign Base Areas on Cyprus, along with Gibraltar, the last home of the Neanderthals and the present home of Barbary macaques, Europe's only wild colony of monkeys","torrent":{"xt":"urn:btih:e1174b5a9ac3a547c00aeab981eb6a02a1b4d171","amp;dn":"Britains.Treasure.Islands--BBC-2016-3.Eps-w.subs-360p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1174b5a9ac3a547c00aeab981eb6a02a1b4d171","infoHashBuffer":{"type":"Buffer","data":[225,23,75,90,154,195,165,71,192,10,234,185,129,235,106,2,161,180,209,113]},"announce":[],"urlList":[]}}