{"title":"WebYoung - Dila, Edita - Anal Curiosity HD 1080p","uid":13338467,"size":1137562837,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:e303e2971da1b28d120b36fa7bf94cb2a75a27bb&amp;dn=WebYoung+-+Dila%2C+Edita+-+Anal+Curiosity+HD+1080p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ElitePorn","files":1,"time":1454004054,"description":"\nWebYoung - Dila, Edita - Anal Curiosity HD 1080p\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\nDila and Edita have been dreaming of a crisp white atmosphere to be incredibly intimate in and today they found that paradise. In their white camisoles and panties, they climb into a plush white bed, skirted by candles and a massive mirror. The connection between these two lovely young ladies has been consistently growing over the last months. One thing is for sure, Dila can't resist Edita's sweet shaved pussy and Edita has never felt so important being the one object of Dila's true affection.\r\n\r\nDila is particularly horny today. Yesterday was special, but she is ready to make today one Edita will never forget. You have the sense that Dila's loins are burning from her inflamed clit waiting to be knocked and moistened by Edita's soft and nimble lips. The crisp, clean and soft surfaces of the white linen bed serve as a perfect canvas for the girls' first foray into the new-to-them art of rimming. First, Dila guides her slick fingers deep into Edita's shaved pussy to stimulate her insides with passion and pressure. Edita's pronounced reaction of moans and aspirated breaths indicate she's ready to be penetrated heavily. Dila inserts a second finger as she continues to lick and suck Edita's sensitive pussy. Then as Edita turns onto her side, Dila's eyes light up with excitement and Edita indicates that she wants it. With that, Dila's tongue is caressing the puckered hole of Edita's ass. Dila's slick tongue lubing and probing Edita will prepare her for the fingers Dila will insert. Not one, not two slick fingers glide in and out of Edita's tender hole as Dila masturbates Edita's wild-flower at the same time. The pleasure is running high and suddenly Edita can't handle the tension any more. She cums hard with Dila's fingers still inside her. \r\n\r\nEdita isn't finished though. Dila still has her underwear on, but what's happening underneath her panties is a pussy party with a guest-list five digits long. Edita is excited to see Dila's bald pussy dripping and waiting to feed her warm mouth. Edita spreads the smooth liquid of Dila's loins to lube her tight asshole. Dila's moans and acrobatic stretching prove she's along for the ride. Edita introduces one finger to Dila's hole at first, while she continues to lap up the sweet honey of Dila's pussy, sharing it with Dila's asshole. Dila re-positions herself, so that Edita can finger her from beneath, allowing her to be face to face with Edita. Edita plays Dila's smooth body like a violin and soon, Dila's intense cries and moans of pleasure reverberate in the entire room and she is served her orgasm complete with full torso contractions that squeeze the squeaks and screams from her burning core.\r\n\r\nScreenshots:\r\n~~~~~~~~~~~~ \nhttp://picturescream.asia/soft/Gcr\r\n \nhttp://picturescream.asia/soft/Gc5\r\n \nhttp://picturescream.asia/soft/GcL\r\n \nhttp://picturescream.asia/soft/GcX\r\n \nhttp://picturescream.asia/soft/Gcy\r\n \nhttp://picturescream.asia/soft/GeI\r\n\r\n\r\nVideos Info:\r\n~~~~~~~~~~~~\r\nSize: 1.06 GB\r\nDuration: 22:01 min \t\r\nResolution: 1920x1080\r\n\r\n\r\nShow Your Appreciation - BitCoin: 1JxUQqRrvGC6txChvaZEbqSSsq9wtswoto","torrent":{"xt":"urn:btih:e303e2971da1b28d120b36fa7bf94cb2a75a27bb","amp;dn":"WebYoung+-+Dila%2C+Edita+-+Anal+Curiosity+HD+1080p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e303e2971da1b28d120b36fa7bf94cb2a75a27bb","infoHashBuffer":{"type":"Buffer","data":[227,3,226,151,29,161,178,141,18,11,54,250,123,249,76,178,167,90,39,187]},"announce":[],"urlList":[]}}