{"title":"Freispiel 1995","uid":14456128,"size":831742976,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e32e7ce641e54194ddd073df22d5ab30cd6ec6f6&amp;dn=Freispiel+1995&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Kotmann","files":1,"time":1461795374,"description":"Originaltitel \t        Freispiel\r\nProduktionsland \tÖsterreich\r\nOriginalsprache \tDeutsch\r\nErscheinungsjahr \t1995\r\nLänge \t                94 Minuten\r\n\r\nRegie \t        Harald Sicheritz\r\nDrehbuch \tHarald Sicheritz, Alfred Dorfer\r\nProduktion \tHeinz Scheiderbauer, Scheiderbauer Film\r\nMusik \t        Peter Herrmann, Peter Janda, Lothar Scherpe\r\nKamera \t        Helmut Pirnat\r\nSchnitt \tIngrid Koller\r\n\r\nIn Freispiel kann der Zuschauer die Midlife Crisis des Musikprofessors Robert Brenneis miterleben. Dieser unterrichtet an einem Gymnasium in Wien und träumt davon, so wie sein ehemaliger Schulfreund Roland Pokorny, ein Popstar zu sein.\r\n\r\nRobert Brenneis ist Oberstudienrat in Musik und seine Schüler sind nicht gerade die besten. Er ist überall von Pech verfolgt, sogar beim Pinball-Spiel. Ein Schüler von ihm unternimmt wegen einer Mathe-Nachprüfung im Schulgebäude einen Selbstmordversuch, der jedoch misslingt. Doris (seine Frau) ist Mitarbeiterin bei der Künstleragentur Schindler. Der Chef bezirzt Doris regelmäßig und als Robert durch Zufall bei Gitarrenspiel aus dem Fenster blickt und Doris mit Carlo im Auto entdeckt, reagiert er eifersüchtig. Der Sohn Michael ist in seine Mitschülerin Tina verliebt, doch diese lässt ihn wegen eines neuen Freundes wieder abblitzen. Bei Schindlers Gartenparty verhält sich Robert schlecht gelaunt, als Carlo sich für die Kassette mit Roberts Liedern nicht interessierte. Die Direktorin des Gymnasiums lehnt Roberts Pragmatisierung ab. Nun ist er zunächst nicht in Urlaubsstimmung, aber als Sohn Michael alleine verreisen will, willigt er bei Doris Urlaubsplan ein. Die Reise geht nach Lignano. Dort ist Robert durch die Hitze wieder in mieser Laune und fährt frühzeitig mit der Bahn heim. In Kärnten entschließt er sich, seinen Billiardfreund Reinhard, der heftige Rückenschmerzen hat, im fiktiven Kurort Bad Loiperskamm zu besuchen. Bald darauf unternehmen die beiden eine Spritztour und landen später bei einem feuchtfröhlichen Fest in einem Bierzelt. Dort flirtet Robert zunächst mit der Kellnerin und zieht auf der Bühne ein schräges Lied auf, worauf er ausgepfiffen und verprügelt wird. Zurück in Wien verliebt sich Lilly (eine junge Kollegin von Doris) in Robert und gehen zum Pokorny-Konzert, um seinen Freund auftreten zu sehen. Pokorny und Brenneis sehen sich wieder und begeben sich auf eine Sexorgie, wo sie ein gemeinsam komponiertes Lied aufführen. Am Dach des Hauses eskaliert der Streit und sie rutschen zusammen die Dachschräge hinunter. Die inzwischen heimgekehrte Doris entdeckt die Rückstände des Dinners von Robert und Lilly. Daraufhin verwüstet sie die Wohnung und zerstört aus rasender Eifersucht Roberts Gitarrensammlung. Dem Installateur, der heftig die Mauer aufstemmte, gelingt der Durchbruch in die Brenneis-Wohnung, worauf der Meister seinen Mitarbeiter einen Trottel schimpft.\r\n\r\nDer Abspann des Filmes beinhaltet schließlich Tango tanzende Paare","torrent":{"xt":"urn:btih:e32e7ce641e54194ddd073df22d5ab30cd6ec6f6","amp;dn":"Freispiel+1995","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e32e7ce641e54194ddd073df22d5ab30cd6ec6f6","infoHashBuffer":{"type":"Buffer","data":[227,46,124,230,65,229,65,148,221,208,115,223,34,213,171,48,205,110,198,246]},"announce":[],"urlList":[]}}