{"title":"FakeHospital - Nikky Dream (Nurse sucks dick for sperm sample)","uid":13287142,"size":808748571,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:e39850733ce36a2a19aed7513b7631594f0753e6&amp;dn=FakeHospital+-+Nikky+Dream+%28Nurse+sucks+dick+for+sperm+sample%29++&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SudoSu","files":1,"time":1453552750,"description":"http://youpornbook.com\r\n\r\n―――――――――――――――――――――――――\r\n ... : Screenshots : ... \r\n―――――――――――――――――――――――――  \nhttp://imgkiss.com/image/tK79N \nhttp://imgkiss.com/image/tKaEF\r\n\r\nThe doctor was away and I was in his office ready to help any of his patients if I could. I was waiting patiently when a very handsome older gentleman walked into the office, asking to see the doctor. I explained that he was absent and that maybe I could help him. He seemed reluctant at first, stating that only the doctor could help him as had manly problems. I got him to sit down and it eventually turned out that he was a model agent who liked to fuck his beautiful models, but as he got older his confidence affected his performance, so he needed some pills to help him get an erection. We chatted for a while and I flirted outrageously with him. I love an older man and I was feeling so horny I decided to see if he was up for some fun. I suggested that instead of taking the pills maybe we could test it right there and then to see if he could get an erection. He seemed a little taken aback, but he had no erection issues as I leaned over the desk, pulled his cock and and began to wank it. \r\n\r\n He was soon groaning and after popping it in my hot mouth and giving him a tit wank, he was as hard as a diamond. He asked if we could fuck to see if he could maintain his erection without the pills and I was more then happy to oblige. He took me standing up and bent over the good doctors desk. His cock felt beautiful, tightly clamped in my pussy. My nerve endings began to tingle as he slid it in and out of me. This older gentlemen sure did know how to fuck and I had no idea why he needed these pills so badly. His stamina was great as he fucked me in a few positions all over the doctors desk. He fucked me with the skill and care only an older love knows. I had cum several times and the doctor was due back any minute, so I needed to see his cumshot. After pounding my pussy for a few more moments as I lay sprawled on the desk, he suddenly pulled out and shot his modest cumshot all over my pussy lips and stomach. I proved that you don't need pills to help you get your dick hard, you just need a hot, naughty nurse like myself. \r\n\r\nMore exclusive porn at:  https://thepiratebay.se/user/SudoSu/","torrent":{"xt":"urn:btih:e39850733ce36a2a19aed7513b7631594f0753e6","amp;dn":"FakeHospital+-+Nikky+Dream+%28Nurse+sucks+dick+for+sperm+sample%29++","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e39850733ce36a2a19aed7513b7631594f0753e6","infoHashBuffer":{"type":"Buffer","data":[227,152,80,115,60,227,106,42,25,174,215,81,59,118,49,89,79,7,83,230]},"announce":[],"urlList":[]}}