{"title":"Nanoparticlnology Handbook 2nd ed","uid":14593214,"size":39542939,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3eda825f01d82a38160a06123eab2fa5f06f2e3&amp;dn=Nanoparticlnology+Handbook+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1463008068,"description":"Nanoparticle Technology Handbook 2nd ed - Masuo Hosokawa et al. (Elsevier, 2012).pdf\r\n\r\nISBN 978-0-444-56336-1\r\n\r\nThe updated and expanded second edition of the Nanoparticle Technology Handbook is an authoritative reference providing both the theory behind nanoparticles and the practical applications of nanotechnology. The second edition is thoroughly updated and expanded with sixteen new chapters, providing a reference much broader in scope than the previous edition. Over 140 experts in nanotechnology and/or particle technology contributed to this new edition.\r\n\r\nNanoparticle technology is a new and revolutionary technology, which is increasingly being used in electronic devices and nanomaterials. It handles the preparation, processing, application and characterisation of nanoparticles and has become the core of nanotechnology as an extension of the conventional fine particle / powder technology. Nanoparticle technology plays an important role in the implementation of nanotechnology in many engineering and industrial fields including electronic devices, advanced ceramics, new batteries, engineered catalysts, functional paint and ink, drug delivery system, biotechnology, etc.; and makes use of the unique properties of the nanoparticles which are completely different from those of bulk materials.\r\n\r\nThe book includes not only the theory behind nanoparticles, but also the practical applications of nanotechnology. It examines future possibilities and new innovations and contains important knowledge on nanoparticle characterization and the effect of nanoparticles on the environment and on humans.\r\n\r\nThe second edition of Nanoparticle Technology Handbook remains a valuable reference source for scientists and engineers working directly with fine particles and materials or in industries that handle these nanoparticles. Related areas include pharmaceutical products, ink or paint materials, electromagnetic memory devices, ceramic materials and plastic materials with high electro-conductivity.\r\n\r\n\r\nIntroduction of all aspects of nanoparticle technology, from the fundamentals to applications\r\nBasic information on the preparation through to the characterization of nanoparticles from various viewpoints\r\nInformation on nanostructures, which play an important role in practical applications\r\nSixty applications of nanoparticles in diverse fields, from which sixteen newly added\r\nUp-to-date information given by specialists in each field\r\nInformation on nanostructures made by nanoparticles, which play a major role in practical applications","torrent":{"xt":"urn:btih:e3eda825f01d82a38160a06123eab2fa5f06f2e3","amp;dn":"Nanoparticlnology+Handbook+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3eda825f01d82a38160a06123eab2fa5f06f2e3","infoHashBuffer":{"type":"Buffer","data":[227,237,168,37,240,29,130,163,129,96,160,97,35,234,178,250,95,6,242,227]},"announce":[],"urlList":[]}}