{"title":"Paperbound","uid":13286348,"size":749322495,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e5344d2718b877bec0d06a01ff886ffc969772dd&amp;dn=Paperbound&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dauphong","files":1,"time":1453542616,"description":"'We're gonna make this an office staple.&quot; -Gamespot\r\n&quot;It’s a gorgeous and fast-paced game&quot; - Rock, Paper, Shotgun\r\n\r\nPaperbound is a smash-up brawler that combines platforming, twitchy combat, and gravity redirection. Run with scissors, walk on walls, and lob ink bombs in whimsical-yet-intense battles within the pages of old books. In addition to the 360 degrees of gravitational freedom, several other twists add to the tension and drama of a match, such as the &quot;escape through the page tear&quot; victory mechanic which brings a second phase to the combat and causes players to momentarily team up with their adversaries. Using a gamepad is highly recommended in this local-multiplayer party game.\r\n\r\nPlay as one of Paperbound's 11 original characters or as characters from Guacamelee, Monaco, VVVVVV, Cards and Castles, and Tumblestone.\r\n\r\nWhen your friends aren't around, Paperbound features challenging AI bots. Each character has his or her own personality. Some are aggressive, some are more cautious. Some are even vindictive. Some make adept use of all weapons, while others prefer to get in close for melee combat. The bots are great for solo players, for when you want to even out the teams, or for when you simply want some extra chaos","torrent":{"xt":"urn:btih:e5344d2718b877bec0d06a01ff886ffc969772dd","amp;dn":"Paperbound","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5344d2718b877bec0d06a01ff886ffc969772dd","infoHashBuffer":{"type":"Buffer","data":[229,52,77,39,24,184,119,190,192,208,106,1,255,136,111,252,150,151,114,221]},"announce":[],"urlList":[]}}