{"title":"Coast to Coast April 26,2016 Political Revelations","uid":14453124,"size":28147274,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e5fba02506696ccd87f72f3bda0c8ed2d8fa68f8&amp;dn=Coast+to+Coast+April+26%2C2016+Political+Revelations+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1461769305,"description":"Coast to Coast April 26,2016 Hours 1 and 2 MP3\r\n\r\nPolitical Revelations - Clintons ,Cruz, Bush etc  - Roger Stone -Republican Democrat Establishment Criminals and Cronies -Kennedy Conspiracy \r\n\r\nDate:\tTuesday - April 26, 2016\r\nHost:\tGeorge Noory\r\nGuests:\tRoger Stone\r\n\r\nIn the first half, consultant and strategist Roger Stone, who has written about how Richard Nixon avoided prosecution after the Watergate scandal, shared a variety of assertions about such political figures as LBJ, JFK, Bill and Hillary Clinton, Ronald Reagan, George H.W. Bush, George W. Bush, and Jeb Bush. He also commented on Donald Trump, whose presidential campaign he worked for in 2015, and he counts as a long time friend. &quot;He is supremely confident...and tough as nails...he's the guy I want to send in to negotiate with the Chinese,&quot; he said of Trump. &quot;This guy is brutal when it comes to his adversaries and these countries have been taking us to the cleaners for too long,&quot;\r\n\r\nThe anti-Trump element in the Republican party could change the rules at the convention and deny Trump the nomination on the first ballot even if he has enough delegates, Stone cautioned. He portrayed LBJ as a crude and corrupt power monger, who manipulated the situation to have John Kennedy assassinated (for more on this, see this 2013 show recap). He characterized Hillary as abrasive, mean-spirited, and greedy, and called the Bushes &quot;crony capitalists&quot; who hypocritically dabbled in drug trafficking. Interestingly, he suggested that the shooting of President Reagan may have been done as a kind of &quot;warning.&quot; There is evidence for a second gunman-- one of the bullets was known as a kind of CIA ammo, he reported.\r\n \nhttp://www.coasttocoastam.com/show/2016/04/26","torrent":{"xt":"urn:btih:e5fba02506696ccd87f72f3bda0c8ed2d8fa68f8","amp;dn":"Coast+to+Coast+April+26%2C2016+Political+Revelations+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5fba02506696ccd87f72f3bda0c8ed2d8fa68f8","infoHashBuffer":{"type":"Buffer","data":[229,251,160,37,6,105,108,205,135,247,47,59,218,12,142,210,216,250,104,248]},"announce":[],"urlList":[]}}