{"title":"Boston Babydolls 10","uid":13466575,"size":1218927101,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e7838ede309918ef253550aeacaf04b2f7f68106&amp;dn=Boston+Babydolls+10&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xxxsunset","files":8,"time":1454939764,"description":"Screenshots: \nhttp://imgur.su/image/7OZI \nhttp://imgur.su/image/7TPN \nhttp://imgur.su/image/7evG\r\n\r\nHey all, here's an obscure dredge from the murky Internet porn depths. This is volume ten of a series called &quot;Boston Babydolls&quot;, released beginning in the 2000s by a company called Boston Alternative Media. They seem to be defunct, but their work lives on by languishing in the forgotten corners of VOD sites and the like.\r\n\r\nThis series claims to use real housewives and local (presumably Boston) women in its productions. I can believe it. This volume has three scenes:\r\n\r\nScene one has two gals, Amanda and Claire, with a stud named Jeff. Thing start off with the ladies lezzing by themselves, kissing and licking each other and then having a little dildo play. The Jeff enters the scene, and the ladies get busy sucking and fucking with him. They ride his face and cock cowgirl style, get in a 69 while Jeff fucks the top gal, and then one gets fucked by Jeff missionary style while the other gal rides her face. Jeff cums on the tongue, in the mouth, and on the chin of one gal at the end.\r\n\r\nScene two has two gals, Gemini and Ivy, in a lesbian scene. They kiss each other, strip naked, and take turns eating each other out without toys.\r\n\r\nScene three has Gemini again, this time in an MMF threesome. Sucks and fucks two studs at the same time, then takes them on individually. One guy wears a condom while he fucks her, and then whips it off and just dribbles all over the blanket on the bed and Gemini licks and rubs his cock. The second guy does some brief jerking off and cums on Gemini's tongue, in her mouth, and on her chin.\r\n\r\nAnyhow, if you dig this sort of video, wank it, thank it, and leave a comment! Peace!","torrent":{"xt":"urn:btih:e7838ede309918ef253550aeacaf04b2f7f68106","amp;dn":"Boston+Babydolls+10","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7838ede309918ef253550aeacaf04b2f7f68106","infoHashBuffer":{"type":"Buffer","data":[231,131,142,222,48,153,24,239,37,53,80,174,172,175,4,178,247,246,129,6]},"announce":[],"urlList":[]}}