{"title":"Stossel.2015.12.04.Self.Defenseless.720p.WEBrip","uid":13042747,"size":794558997,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e7ad72bc8be7b5ee443cfed025126bc2b41ec0b0&amp;dn=Stossel.2015.12.04.Self.Defenseless.720p.WEBrip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BBreach","files":1,"time":1450547580,"description":"John F. Stossel is an American consumer reporter, investigative journalist, author, libertarian columnist, and former co-anchor for the ABC News show 20/20. In this show he looks at consumer-focused topics, such as civil liberties, the business of health care, and free trade\r\n\r\n_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2\r\n\r\nSELF DEFENSELESS\r\n\r\nFriday at 8PM ET on FBN\r\n\r\nFIGHTING TERRORISTS: In Paris, the terrorists killed, reloaded, and killed again. Would more citizens with guns have made the attacks much less deadly? We debate that. Also, although the Supreme Court ruled that individuals have a right to bear arms, I tried to get a gun license in New York City but was rejected.\r\n\r\nGUN MYTHS: Dana Loesch busts myths about guns: phony &quot;assault weapons,&quot; President Obama and Hillary Clinton's false claims about mass shootings, and the famous &quot;gun show loophole.&quot;\r\n\r\nNEGROES WITH GUNS: Today most blacks favor gun control over gun rights. &quot;Negroes and the Gun&quot; author Nicholas Johnson explains that's a relatively new phenomenon; blacks historically relied on guns for protection against oppression from the state and individual racists.\r\n\r\nARMED AND FEMALE: Kristina Ribali wishes more so-called feminists would get behind female gun-ownership. She's a mom who calls firearms &quot;the great equalizer&quot; because it makes women as powerful as men. She tells me, it wasn't the cops who kept her and her family safe from a repeat stalker, but her gun.\r\n\r\nZERO TOLERANCE: The stupidity continues. Examples: a 7-year-old boy is suspended from school for shaping a pop-tart into what his teacher thought looked like a gun; a 5-year-old girl is suspended for a &quot;terrorist threat&quot; that turned out to be a ‘Hello Kitty' gun, and kids suspended for using fingers as ‘guns'\r\n\r\nMY TAKE: I argue that the Second Amendment is not about allowing people the right to shoot deer, it's about allowing us to protect ourselves from criminals and tyrants","torrent":{"xt":"urn:btih:e7ad72bc8be7b5ee443cfed025126bc2b41ec0b0","amp;dn":"Stossel.2015.12.04.Self.Defenseless.720p.WEBrip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7ad72bc8be7b5ee443cfed025126bc2b41ec0b0","infoHashBuffer":{"type":"Buffer","data":[231,173,114,188,139,231,181,238,68,60,254,208,37,18,107,194,180,30,192,176]},"announce":[],"urlList":[]}}