{"title":"Hate Crime - 2nd Edition - Neil Chakraborti, Jon Garland","uid":13014358,"size":1630788,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e7ae3d0518fb0079828f8e66ee42810310cb2978&amp;dn=Hate+Crime+-+2nd+Edition+-+Neil+Chakraborti%2C+Jon+Garland&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1450277676,"description":"Hate crime is a particularly pernicious form of criminal behaviour that has significant impacts upon victims, their families and wider communities. In this substantially revised and updated edition the book examines the nature, extent and harms of hate crime, and the effectiveness of criminal justice responses to it. It covers racist, religiously motivated, homophobic, disablist and transphobic hate crime, as well as other forms of targeted victimisation such as gendered hostility, elder abuse, attacks upon alternative subcultures and violence against sex workers and the homeless. The book also assesses the complexities and controversies surrounding hate crime legislation and policy-making, as well as the continuing challenges associated with the policing of hate.\r\n\r\nThe second edition features expanded discussions of international perspectives and contemporary topics such as online hate and cyberbullying, as well as numerous case studies covering issues such as lone wolf extremists, Islamophobia, asylum seekers and the far right. The book contains a range of links to online material that accompany the extensive lists of further reading in each chapter","torrent":{"xt":"urn:btih:e7ae3d0518fb0079828f8e66ee42810310cb2978","amp;dn":"Hate+Crime+-+2nd+Edition+-+Neil+Chakraborti%2C+Jon+Garland","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7ae3d0518fb0079828f8e66ee42810310cb2978","infoHashBuffer":{"type":"Buffer","data":[231,174,61,5,24,251,0,121,130,143,142,102,238,66,129,3,16,203,41,120]},"announce":[],"urlList":[]}}