{"title":"The Anthony Cumia Show 2016-01-20 Mike Brown MP4 MP3","uid":13312238,"size":390130193,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:eab5a82837b2ba4aed07630fa44a02e4634cf920&amp;dn=The+Anthony+Cumia+Show+2016-01-20+Mike+Brown+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mothergoose58","files":2,"time":1453779758,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\r\n\r\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\r\n\r\n\r\nAfter 1 year of complete broadcasting freedom the Anthony Cumia Network is proud to launch their new studio in New York City! Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\r\n\r\nGuest: Mike Brown\r\n\r\nEpisode 300: Today’s 300th episode of TACS gives us Mike Brown and Anthony talking about attempting to handle your mail, Beavis the destroyer, the repercussions for late payments, double digit rape, Cosby’s attorney, the presidential candidates and their ideas, and Sarah Palin endorsing Trump. We hear what MSNBC had to say about Palin and Trump, the guys chat about panel shows, election odds, fake ass Hillary, Heather Matarazzo &quot;feeling the bern,&quot; pointless polling, screaming your way out of politics, hip piercings, man buns and braids, tattoo evolution, grooming loyalty, and we revisit weave boiling. After TACS gets vintage with some old timey products, we see a shitting unicorn, recap a bit of yesterday’s show with Ronnie B, they discuss the Oscar nominees and movies, the lack of Asian outrage, black Twitter, Asian representation on TV and in movies, and Pat Morita.\r\n\r\n\r\n\r\n\r\n\r\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\r\n\r\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:eab5a82837b2ba4aed07630fa44a02e4634cf920","amp;dn":"The+Anthony+Cumia+Show+2016-01-20+Mike+Brown+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eab5a82837b2ba4aed07630fa44a02e4634cf920","infoHashBuffer":{"type":"Buffer","data":[234,181,168,40,55,178,186,74,237,7,99,15,164,74,2,228,99,76,249,32]},"announce":[],"urlList":[]}}