{"title":"Midnight in the Desert with Heather Wade - 01-14, 2016.mp3","uid":13228489,"size":80667854,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:eba2dde6578b62b2876fd0886c77145c3c9a3579&amp;dn=Midnight+in+the+Desert+with+Heather+Wade+-+01-14%2C+2016.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"edcarterntwk23","files":1,"time":1452903997,"description":"So there's a problem with this one. I'm missing parts of the show. Only the beginning part though, approximately 15 minutes from the top. I have two different streams recording and they both had an issue. I'm not sure as to why that happened. \r\n\r\nI can rule out a power interruption or a lack of incoming internet, but then again, my router may have performed a reboot (to which I didn't ask it to) I also checked the devices that were recording the streams and their settings (time and crontab) were operating normally. \r\n\r\n\r\nSuffice it to say, this is why I don't feel all that comfortable filling in for missing episodes. Because I can't always guarantee that my episodes will be complete. \r\n\r\nAnyway, I can and will fill, but I certainly don't want to be relied upon, as I'm doing this because I'm able to, and as you all can see this time, I wasn't able to deliver a complete show. \r\n\r\nI'm guessing there might have been a problem with the stream? Possibly? If someone listens live, can the comment about that? If not, enjoy what I have and I'll be back to do other fills if I can. Hopefully someone else will be able to give a complete account of this episode. \r\n\r\nThanks","torrent":{"xt":"urn:btih:eba2dde6578b62b2876fd0886c77145c3c9a3579","amp;dn":"Midnight+in+the+Desert+with+Heather+Wade+-+01-14%2C+2016.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eba2dde6578b62b2876fd0886c77145c3c9a3579","infoHashBuffer":{"type":"Buffer","data":[235,162,221,230,87,139,98,178,135,111,208,136,108,119,20,92,60,154,53,121]},"announce":[],"urlList":[]}}