{"title":"WarBirds Dogfights 2016-HI2U","uid":13221218,"size":2837395718,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ecffebf2db07e274ef30a1b6a941f57d36908032&amp;dn=WarBirds+Dogfights+2016-HI2U&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kurkas","files":2,"time":1452786985,"description":"Description: Strap into the pilot’s seat and fight in the great air battles of World War II. But you aren’t alone. You’ll have a wingman, or maybe a whole squadron around you, engaging small or large groups of enemies over Europe, North Africa, and the Pacific. WarBirds Dogfights is an extended version of WarBirds with more offline play.\r\n\r\nFeatures:\r\n\r\n- OVER 60 PLANES OFFLINE: Learn to fly and fight over 60 different WWII airplanes of America, Britain, Germany, Japan and Russia. All aircraft have unique, realistic and challenging flight models.\r\n\r\n- MASSIVE AIR BATTLES WITH AI: Play in massive air battles with dozens of planes, all flown by AI except your plane. No waiting for online opponents!\r\n\r\n- ALL ACTION: Missions are all action. No takeoffs, landings, or boring flights. You start when the enemy is sighted. When mission succeeds (or fails) you can end the action or continue flying as long as you want.\r\n\r\n- OVER 20 AIR COMBAT BATTLE SPACES: Participate in over 20 different large scale air battles set in historic battle areas around the world. Each of these battles has separate procedural generation systems:\r\n– North Africa (Tobruk and Tunisia)\r\n– Europe (from Battle of Britain to Battle over Germany)\r\n– The Pacific (Midway, South Pacific atolls, Philippines)\r\n– Western Russia\r\nBattle sizes vary from 1v1 duels to multiple waves of massive attacks.\r\n\r\n- RANDOM GENERATION FOR EACH BATTLE: Each battle space uses procedural generation to vary starting positions, aircraft types and numbers, pilot quality, flight plans, objectives, and more. You can play the in the same battlespace, with the same plane, hundreds of times and never see the same situation!\r\n\r\n- FULL TRAINING: The game includes a full training section with over 15 maneuvers to practice and train on!\r\n\r\n- UNIQUE EXPERIENCES: Unique bonus missions, including handling a 40mm anti-aircraft gun defending Tobruk, or flying the German Me-163 rocket fighter to intercept allied bombers.\r\n\r\n- ADVANCEMENT TRACKING: Advance from novice to world’s greatest fighter pilot through a series of promotions.\r\n\r\n- MMO ONLINE PLAY: Steam purchasers get a free 30-day trial in the WarBirds Online massively multiplayer online game. Battle against a community other air combat enthusiasts in the plane (or planes) of your choice. WarBirds has live, human online trainers available starting 2100 Eastern Time every Tuesday and Thursday.\r\n\r\n- OVER 125 PLANES &amp; VEHICLES ONLINE: Tthe WarBirds online game includes dozens of additional planes and ground vehicles. Drive a platoon of up to four tanks or a flight of four bombers, with AIs following your lead in other vehicles. Experience combat on different types of terrain. Enjoy arenas where both air and ground combat rages, or test your mettle in air-combat-only arenas.\r\n\r\nGenre: Action, Massively Multiplayer, Simulation\r\nPublisher: iEntertainment Network Inc\r\nDeveloper: iEntertainment Network Inc","torrent":{"xt":"urn:btih:ecffebf2db07e274ef30a1b6a941f57d36908032","amp;dn":"WarBirds+Dogfights+2016-HI2U","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecffebf2db07e274ef30a1b6a941f57d36908032","infoHashBuffer":{"type":"Buffer","data":[236,255,235,242,219,7,226,116,239,48,161,182,169,65,245,125,54,144,128,50]},"announce":[],"urlList":[]}}