{"title":"Steganos Privacy Suite 17.1.1.11605 + Serial Patch","uid":13499809,"size":64242650,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ee8efef845b4ab705550732e2fa411eb7b967c79&amp;dn=Steganos+Privacy+Suite+17.1.1.11605+%2B+Serial+Patch&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rubberboy37","files":1,"time":1455187680,"description":"Steganos Privacy Suite 17 combines the rewarded Steganos Security software products, Steganos Save and the Stweganos Password Manager with added features that are onkly available in the Privacy Suite.\r\n\r\n\r\n\r\nUsers are able to encrypt sensible data like business reports, TAN-lists or holidasy photo's thanks to a clear and easy menu navigation - on the PC, in Networks and in the Cloud. \r\n\r\n\r\n\r\n\r\nPasswords for all online accounts can be created automatically and are easily managed and administrated, regardless if it is on a computer, smartphone or tablet.\r\n\r\n\r\n\r\nWith only one click you are able to delete all browser data and histories, and with the brand new functions you can now block tracking and advertising before information is stored and increase your privacy with an anonymized browser.\r\n\r\n\r\n\r\nFeatures:\r\n\r\n- NEW Protects your online privacy by stopping tracking as well as advertising and anonymizes browser\r\n- Automatically expanding Safes that saves your precious Flashdrive space\r\n- NEW Improved &quot;Steganos Mobile Privacy&quot; app for iOS and Android which automatically inserts passwords on smartphones with the In-App-Browser for your smartphone and tablet!\r\n- NEW Now more comfortable with Password-Expiration notice and Touch ID on iOS\r\n- NEW Mobile access for yiour passwords now also via iTunes or Explorer (Android) sync possible - no Cloud access required\r\n- NEW Mobile acces for your passwords via OneDrive, Dropbox or Google Drive\r\n- Supports data encryption in Dropbox, Microsoft OneDrive and Google Drive\r\n- Double the safwe size: 2TB (2,048 GB)\r\n- Easily configure safes in your home network\r\n- Safes are now simple to move and delete, and safe sizes can easily be changed\r\n- AES-XES encryption with 348 bits (IEEE P1619) with NI-Hardware acceleration for optimal protection against thieves, snoops and intelligence services\r\n- The unlocked safe seamlessly integrades itself in Windows as a disk drive and can be used from within any application\r\n- Steganos Safe not only encrypts your data, but also inconspicuously hides it in a picture, piece of music or a video if desired\r\n- Portable Safe: archive sensitive data on an USB stick, CD, DVD or Blu-Ray disc\r\n- PLUS PicPass (picture passwords), Steganos Shredder (permanently destroys files)\r\n\r\n\r\n\r\nOS: Windows\r\nLanguage: English, German and Spanish\r\nInstaller: 62 MB\r\n\r\n\r\n\r\nDon't hit and run! A minimum seed time required, the maximum seed time desired. Please seed for as long as you are able to keep this torrent alive!\r\n\r\n\r\nScreenshots:\r\n \nhttp://imgbay.mobi/di/Screenshot1-zx7nx.jpg\r\n \nhttp://imgbay.mobi/di/Screenshot2-ebnq9.jpg","torrent":{"xt":"urn:btih:ee8efef845b4ab705550732e2fa411eb7b967c79","amp;dn":"Steganos+Privacy+Suite+17.1.1.11605+%2B+Serial+Patch","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee8efef845b4ab705550732e2fa411eb7b967c79","infoHashBuffer":{"type":"Buffer","data":[238,142,254,248,69,180,171,112,85,80,115,46,47,164,17,235,123,150,124,121]},"announce":[],"urlList":[]}}