{"title":"Cute Asian Slave Buggered On Glass Coffee Table","uid":14625284,"size":566181589,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f085a6cf0e1708f073779837847f6cd49f3878bb&amp;dn=Cute+Asian+Slave+Buggered+On+Glass+Coffee+Table&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sarah.jensen","files":1,"time":1463296917,"description":"So I met Pet again and asked her if the last video did its purpose of getting rid of her boyfriend. Yes, she said, that had got rid of him, he was horrified. But even better than that, loads of other guys had seen the video and wanted not just to have sex with Pet, but be her boyfriend and shower her with gifts. She had her choice of rich and ridiculous ageing foreign men. She picked one or two and drained them of their assets. Delighted, she was really pleased she made that video. It could not have done more for her economically. So knowing the power of a good video, Pet has asked me to do this next video, where she will showcase her total subservience and sweet supple body. She has asked me to use her mouth, cunt and ass. Never done it before, but Pet knows she has to be buggered as well. So here it is, Pet is my total sex slave, totally for free, for the duration of this video. She knows that you will like her. She knows that the more of a slut she acts, the more stupid old codgers will want to make her respectable, by endangering of their own livelihoods. Although she appears in chains, you will end up doing exactly what she wants. And after feeling her lovely tits a few times, she knows well how to dump you. Done it before many times, Pet is well on her way to being a multi millionaire. And a great fuck too. Fuck any man who cannot keep his dick in his pants for a pretty face and a wet cunt. And fuck dear shackled Pet on high definition video","torrent":{"xt":"urn:btih:f085a6cf0e1708f073779837847f6cd49f3878bb","amp;dn":"Cute+Asian+Slave+Buggered+On+Glass+Coffee+Table","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f085a6cf0e1708f073779837847f6cd49f3878bb","infoHashBuffer":{"type":"Buffer","data":[240,133,166,207,14,23,8,240,115,119,152,55,132,127,108,212,159,56,120,187]},"announce":[],"urlList":[]}}