{"title":"John-Batchelor-brink-of-war-in-the-south-china-sea.mp3","uid":14439761,"size":20256955,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f1291bf04da96befcd604deff69b5c507d0149af&amp;dn=John-Batchelor-brink-of-war-in-the-south-china-sea.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1461669189,"description":"John Batchelor april 25 , 2016\r\n\r\nBrink of War in the South China Sea. @gordongchang, Forbes. @thadmccotter, WJR. Claudia Rosett, PJ Media\r\n\r\n&quot;The world's two greatest powers are competing for military dominance of the western Pacific Ocean and the contest is about to intensify. The US and China are each jockeying for advantage as they anticipate a quickening in a struggle that &quot;has the potential to escalate into one of the deadliest conflicts of our time, if not history&quot;, according to Malaysia's Defence Minister, Hishammuddin Hussein.\r\n\r\n&quot;An important ruling from the International Court of Justice in the Hague is expected in the weeks ahead. It will rule on a claim by a US ally, the Philippines, to sovereignty over reefs that are also claimed by China. Most experts expect the ruling, due by the end of June, will favour the Philippines. Beijing has warned it will not recognise the court's jurisdiction.\r\n\r\n&quot;The South China Morning Post reported on Monday that, if the court ruled against it, Beijing would accelerate plans to build an artificial island around one of the reefs at the heart of the dispute, Scarborough Shoal. The shoal is 230kilometres from the Philippines coast and 1020kilometres from China's.\r\n\r\n&quot;China recently put fighter jets and surface-to-air missiles on another island a few hundred kilometres away, Woody Island. The President of China Xi Jinping is reported to be planning to travel there soon.\r\n\r\n&quot;The US Defence Secretary Ash Carter cancelled a visit to China, but two weeks ago went to India and the Philippines to conclude base-sharing and other agreements to strengthen co-operation out of shared worry over China.\r\n\r\n&quot;The US position is the same as Australia's: it takes no sides over the disputed territories but urges the claimants to settle the argument through negotiation, not force.\r\n\r\nIn the same week, the top Chinese military officer, General Fan Changlong, made a visit to the Spratly Islands, also subject to rival claims by China, Vietnam, Malaysia, Brunei and the Philippines. China has built artificial islands, runways, lighthouses and ports there, despite the objections of all the other claimants.\r\n\r\n&quot;Then, last week, in another unmistakable sign of hardening Chinese determination, Xi made his first public appearance in military uniform and formally claimed the title of commander in chief of China's war-fighting headquarters....&quot;\r\n \nhttp://www.smh.com.au/comment/south-china-sea-the-fight-china-will-take-to-the-brink-of-war-20160425-goe3zi.html#ixzz46tPGGgN5\r\n\r\nFollow us: @smh on Twitter | sydneymorningherald on\n\r\nThe John Batchelor Show","torrent":{"xt":"urn:btih:f1291bf04da96befcd604deff69b5c507d0149af","amp;dn":"John-Batchelor-brink-of-war-in-the-south-china-sea.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1291bf04da96befcd604deff69b5c507d0149af","infoHashBuffer":{"type":"Buffer","data":[241,41,27,240,77,169,107,239,205,96,77,239,246,155,92,80,125,1,73,175]},"announce":[],"urlList":[]}}