{"title":"Exiled Kingdoms RPG full v0.6.866 mod","uid":13220229,"size":92429457,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:fb9314664853c21dfb1fcec1ce581a2485d4c1f2&amp;dn=Exiled+Kingdoms+RPG+full+v0.6.866+mod&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":1,"time":1452753869,"description":"Exiled Kingdoms is an single-player classic RPG that takes place in a huge interactive world that you can freely roam. Explore dungeons, gain experience, find new treasures and allies, and immerse yourself in the ultimate battle between humanity and the forces that want to annihilate it!. This is an offline game that doesn't require an internet connection to play.\r\n\r\nExiled Kingdoms is not a linear sucession of levels, but an open world. You decide where to go, what to do and who to be friends with! Explore mysterious ruins, fight to free slaves, or join some of the powerful factions; the choice is yours.\r\n\r\nInspired by the great old-school RPGs. The game is greatly inspired by classics like Baldur's Gate, Morrowind, Darklands or Pool of Radiance. Expect a challenging game, like they used to be. Sometimes you'll have to run, you'll get lost, and often you'll check your journal to know what to do next. And death awaits the unwary adventurer behind every corner...\r\n\r\nStory introduction:\r\nA dark tale, and a brave new world\r\nA century ago, the Andorian Empire was destroyed by a magical cataclysm that brought The Horrors into our world; humanity was nearly annihilated. Many thousands managed to escape sailing away to the Imperial Colony of Varannar: a savage island, dangerous and unexplored. Mistrust and blame made impossible to elect a new Emperor, and the four Exiled Kingdoms were proclaimed.\r\nNowadays, the ragtag kingdoms still struggle to survive in a harsh land, often waging war on each other. Empire and the Horrors are, for many, just old legends and fairytales. You are a novice adventurer, rarely paying attention to such old stories; you're more concerned with your latest misadventures and lack of gold.\r\n\r\nBut for once, luck seems to be on your side. You received a letter from New Garand, stating that you are the sole beneficiary of a big inheritance. You don’t remember any relatives in the capital of the Kingdom of Varsilia, but certainly that won’t stop you from an opportunity like this! The road to New Garand will reveal many surprises, and will teach you that fairytales and legends can become, in fact, very real.\r\n\r\nFeatures\r\n• Real-time combat against all kinds of different monsters and beasts, from vicious goblins to raging minotaurs, wyverns and dragons.\r\n• Explore all kind of environments freely: forests and caves, dungeons, cities, ancient tombs and remote valleys.\r\n• Customize your character choosing between 4 classes, 40 skills and hundreds of different items you can loot.\r\n• A rich world, and a real fantasy setting. Dozens of quests, sometimes with different endings. Hundreds of non-player characters with unique dialogues, solve mysteries, make friends and enemies.\r\n• Work on your reputation to become a hero of one or more of the kingdoms or guilds. Eventually you can become a knight, a high mage, a hero... or a villiain.\r\n\r\nAbout this game\r\nExiled Kingdoms is currently in public Beta, features and new areas keep coming each week. Future updates will always be compatible with your savegames, so you will not need to start all over.\r\n\r\nA 25% of the world is free to play, and as I release new maps and quests weekly, some of them will be made free as well. On the free version, there is a level cap adequate to those areas. If you decide to purchase, the whole game becomes unlocked.\r\n\r\nI've been developing this game for years, putting a lot of effort into bringing back the classic flavor of the golden era of RPGs, into each dialogue, quest or even item descriptions. I hope you enjoy the game! - David.\r\n\r\nWhat’s new:\r\n-New characters and dialogues in New Garand.\r\n-Secret doors will remain visible forever once you discover them.\r\n-New score system and scoreboards! check the Details section of your character.\r\n-Bugfixes related with storing items in full containers, and other minor issues.\r\n-New area, the Trollfens, and also new quests and items!\r\n-other changes and fixes\r\n\r\nRequired Android O/S : 4.1+","torrent":{"xt":"urn:btih:fb9314664853c21dfb1fcec1ce581a2485d4c1f2","amp;dn":"Exiled+Kingdoms+RPG+full+v0.6.866+mod","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb9314664853c21dfb1fcec1ce581a2485d4c1f2","infoHashBuffer":{"type":"Buffer","data":[251,147,20,102,72,83,194,29,251,31,206,193,206,88,26,36,133,212,193,242]},"announce":[],"urlList":[]}}