{"title":"Kurdo Baksi - Min vän Stieg Larsson (Svensk Retail EPUB)","uid":13018275,"size":137787,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff9a3c818006e4e824301c0b474ec9f6dd233ed1&amp;dn=Kurdo+Baksi+-+Min+v%26auml%3Bn+Stieg+Larsson+%28Svensk+Retail+EPUB%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1450314590,"description":"Författare: Kurdo Baksi\r\n       Titel: Min vän Stieg Larsson\r\nUtgivningsår: 2010\r\n       Språk: Svenska\r\n        ISBN: 9789113026572\r\n      Format: Retail EPUB\r\n\r\nKurdo Baksi var en av Stiegs få riktigt nära vänner. De kallade varandra lillebror och storebror. Sorgen efter Stieg blev stor. Att han dessutom, inte långt efter sin död, blev en av de mest lästa deckarförfattarna ökade nyfikenheten på vem Stieg egentligen var. Kurdo Baksi lägger till en viktig bit i det pusslet.\r\n\r\n&quot;I många hänseenden kommer Stieg alltid att framstå som gåtfull. Det var helt enkelt en del av hans personlighet. Men få har samtidigt så frikostigt delat med sig till andra. Jag tror att många nästan betraktade honom som en outsinlig källa. Han gav och vi var många som villigt tog emot.&quot; Kurdo Baksi\r\n\r\nFå läsare vet vem Stieg Larsson egentligen var och att han tidigare skrivit mycket, både artiklar och böcker av ett helt annat slag än deckarna om Mikael Blomkvist och Lisbeth Salander. Nu har Stiegs &quot;lillebror&quot; Kurdo Baksi valt att skriva ett slags personlig biografi om sin nära vän. Det har tagit honom nästan fem år att samla mod och styrka att skriva om den Stieg som han kände. De var två vänner som ofta fick täcka upp för varandra, ständigt måna om att värna om sina privatliv eftersom de levde under ständiga hot från nynazistiska grupper.\r\n\r\nKurdo beskriver deras samarbete, deras många och långa diskussioner, om Stiegs enorma arbetskapacitet, hans energi och idérikedom men också om oron för hans hälsa och hans kompromisslösa sidor och envishet som ibland satte krokben för honom själv. Han skildrar också Stiegs arbete på TT och hur hans stora intresse för deckargenren lockade honom att skriva. Den här boken ger röst och kropp åt Stieg Larsson, och vi får en unik inblick i vem Stieg Larsson var både som människa och författare","torrent":{"xt":"urn:btih:ff9a3c818006e4e824301c0b474ec9f6dd233ed1","amp;dn":"Kurdo+Baksi+-+Min+v%26auml%3Bn+Stieg+Larsson+%28Svensk+Retail+EPUB%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff9a3c818006e4e824301c0b474ec9f6dd233ed1","infoHashBuffer":{"type":"Buffer","data":[255,154,60,129,128,6,228,232,36,48,28,11,71,78,201,246,221,35,62,209]},"announce":[],"urlList":[]}}