{"title":"Counselor among Wolves Liv Olteano","uid":13300237,"size":597078,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ffabb586b77d992246a8204e061f9e6e2a1918cd&amp;dn=Counselor+among+Wolves+Liv+Olteano&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1453685543,"description":"Sequel to A Tooth for a Fang\r\nLeader Murders: Case Two\r\n\r\nFive dead leaders, their bodies arranged in a pentagram. Treason, lies, and backstabbing. A make-believe affair that turns into a real mating.\r\n\r\nTimothy Sands is a PBI counselor, half-fey, half-elf, with a secret crush on Herman Weiss, PBI director. As a new chapter is added to the Leader Murders, it is Weiss’s responsibility to investigate what seems an impossible-to-solve case. The other problem? Weiss is suffering from rages, and his only salvation lies in Tim’s emotional-grid-balancing skills. They only have to pretend to be a couple for Tim to use his talents, and he owes Weiss a big favor. Piece of cake, right?\r\n\r\nThe fey might be involved in the Leader Murders. Someone on the Council might be their ally, and another prominent PBI figure looks more and more suspicious as they investigate. The stakes are upped when Timothy’s father, the Fey King, threatens to leave the Council destitute if they don’t hand Timothy over to him. Weiss’s brilliant solution? Mating Timothy and forcing the Council into protecting him.\r\n\r\nThere’s only one small hitch in that plan: instead of protecting one, the Council might decide to get rid of two","torrent":{"xt":"urn:btih:ffabb586b77d992246a8204e061f9e6e2a1918cd","amp;dn":"Counselor+among+Wolves+Liv+Olteano","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffabb586b77d992246a8204e061f9e6e2a1918cd","infoHashBuffer":{"type":"Buffer","data":[255,171,181,134,183,125,153,34,70,168,32,78,6,31,158,110,42,25,24,205]},"announce":[],"urlList":[]}}